home/dot_config/emacs-old/README.org
#+startup: show2levels
#+auto_tangle: t

* early-init.el
:PROPERTIES:
:header-args: :tangle "./early-init.el"
:END:
These settings are going into separate init file: =early-init.el=, which will be
invoked before GUI invocation and general =init.el= file.
** Preamble
#+begin_src emacs-lisp
;;; early-init.el -*- lexical-binding: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in ~/.config/emacs/README.org
;;;
;;; Code:
#+end_src

** Variables

#+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum
      read-process-output-max (* 1024 1024 4) ; 4mb
      inhibit-compacting-font-caches t
      message-log-max 16384
      load-prefer-newer noninteractive)
#+end_src

Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
#+begin_src emacs-lisp
(setopt tool-bar-mode nil
        menu-bar-mode nil
        scroll-bar-mode nil)
#+end_src

Resizing the Emacs frame can be a terribly expensive part of changing the font.
By inhibiting this, we easily halve startup times with fonts that are larger
than the system default.
#+begin_src emacs-lisp
(setopt frame-inhibit-implied-resize t)
#+end_src

** Native compilation
#+begin_src emacs-lisp
(when (featurep 'native-compile)
  (setq native-comp-async-report-warnings-errors 'silent))
#+end_src

Set native compilation cache location:
#+begin_src emacs-lisp
(when (fboundp 'startup-redirect-eln-cache)
  (startup-redirect-eln-cache
    (convert-standard-filename
      (expand-file-name  "var/eln-cache/" user-emacs-directory))))
#+end_src

** auto-compile elisp libraries
#+begin_src emacs-lisp
(setq load-prefer-newer t)
(when (require 'auto-compile nil t)
  (auto-compile-on-load-mode)
  (auto-compile-on-save-mode))
#+end_src

** The end of =early-init.el= file

This concludes the =early-init.el= file.
#+begin_src emacs-lisp
(provide 'early-init)
;;; early-init.el ends here
#+end_src


* init.el
:PROPERTIES:
:header-args: :tangle "./init.el"
:END:
** Preamble
#+begin_src emacs-lisp
;;; init.el --- Emacs main configuration file -*- lexical-binding: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in ~/.config/emacs/README.org
;;;
;;; Code:
#+end_src

** Packages management
*** package.el
#+begin_src emacs-lisp
(require 'package)
(setopt package-install-upgrade-built-in t)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(add-hook 'package-menu-mode-hook #'hl-line-mode)
#+end_src

*** use-package
#+begin_src emacs-lisp
(setopt use-package-enable-imenu-support t)
#+end_src

#+begin_src emacs-lisp
(when (version< emacs-version "30")
  (unless (package-installed-p 'vc-use-package)
    (package-vc-install "https://github.com/slotThe/vc-use-package"))
  (require 'vc-use-package))
#+end_src

** Libraries and essential packages
#+begin_src emacs-lisp
(use-package diminish :ensure t)
(use-package hydra    :ensure t)
(use-package auto-compile :ensure t)
(use-package no-littering :ensure t :demand t) ;; files paths configuration
(use-package f :ensure t)
#+end_src

*** gcmh (Garbage Collector Magic Hack)
#+begin_src emacs-lisp
(use-package gcmh
  :ensure t
  :init (gcmh-mode))
#+end_src

*** dash
#+begin_src emacs-lisp
(use-package dash
  :ensure t
  :hook (after-init . global-dash-fontify-mode)
  :config
  (with-eval-after-load 'info-look
    (dash-register-info-lookup)))
#+end_src

*** which-key
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :demand t ; Force the package to load immediately.
  :diminish which-key-mode
  :hook after-init
  :custom
  (which-key-idle-delay 0.6)
  (which-key-popup-type 'side-window)
  (which-key-sort-order 'which-key-key-order-alpha))
#+end_src

**** my/which-key-set-command-description
#+begin_src emacs-lisp
(defun my/which-key-set-command-description (&rest spec)
  "Set description for command that would be shown in the whick-key menu."
  (dolist (s (-partition 2 spec))
    (-let* (((fname description) s)
            (fname (if (symbolp fname)
                       (symbol-name fname)
                     fname)))
      (add-to-list 'which-key-replacement-alist
                   `((nil . ,fname) . (nil . ,description))))))
#+end_src

**** COMMENT which-key-posframe
- [[https://github.com/emacsorphanage/which-key-posframe][GitHub - emacsorphanage/which-key-posframe]]

#+begin_src emacs-lisp
(use-package which-key-posframe
  :ensure t
  :after which-key
  :hook after-init
  :custom
  (which-key-posframe-poshandler 'posframe-poshandler-frame-bottom-center))
#+end_src

*** general
#+begin_src emacs-lisp
(use-package general
  :ensure t
  :after which-key
  :config
  (general-auto-unbind-keys))
#+end_src

*** My custom function
**** add-to-list
- [[https://stackoverflow.com/questions/24356401/how-to-append-multiple-elements-to-a-list-in-emacs-lisp][Source]]
#+begin_src emacs-lisp
(defun my/add-to-list (list elements &optional append)
  "Add ELEMENTS to the front of the LIST.

If APPEND is non-nil add ELEMENTS to the end of the LIST.
This function change the value of the LIST symbol.

LIST sould be a symbol.
ELEMENTS could be either a list or a single element."
  (unless (consp elements)
    (setq elements `(,elements)))
  (set list (if append
                (append (symbol-value list) elements)
              (append elements (symbol-value list)))))
#+end_src

**** remove-from-list
#+begin_src emacs-lisp
(defun my/remove-from-list (list elements)
  "Remove ELEMENTS from the LIST.

LIST should be a symbol.
ELEMENTS could be either a list or a single element."
  (unless (consp elements)
    (setq elements (list elements)))
  (dolist (element elements)
    (set list (remove element (symbol-value list)))))
#+end_src

**** set-face-attribute
#+begin_src emacs-lisp
(defun my/set-face-attribute (face-specs)
  (unless (listp (car face-specs))
    (setq face-specs (list face-specs)))
  (dolist (s face-specs)
    (-let [(face . spec) s]
      (apply #'set-face-attribute face nil spec))))
#+end_src

** Emacs core settings
*** Initial frame settings
#+begin_src emacs-lisp
(when window-system
  (set-frame-size (selected-frame) 1300 1000 :pixelwise))
#+end_src

#+begin_src emacs-lisp
(when window-system
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (horizontal-scroll-bar-mode -1)
  (blink-cursor-mode -1))
#+end_src

*** Basic settings
#+begin_src emacs-lisp :noweb yes
(use-package better-defaults :ensure t)
(use-package emacs
  :after better-defaults
  :custom
  <<customize-emacs-variables>>
  :config
  <<config-emacs-settings>>)
#+end_src
**** custom
:PROPERTIES:
:header-args: :noweb-ref customize-emacs-variables
:END:

User credentials. Some modes can use full name and email address automatically.
#+begin_src emacs-lisp
(user-full-name "Yuriy Artemyev")
(user-mail-address "anuvyklack@gmail.com")
#+end_src

#+begin_src emacs-lisp
(ring-bell-function #'ignore)
(inhibit-startup-message t)
(cursor-type 'box)
(cursor-in-non-selected-windows nil)
#+end_src

=ga= keys in normal-state (native =M-=== key-chord) will show human readable output.
#+begin_src emacs-lisp
(what-cursor-show-names t)
#+end_src

~y-or-n-p~
#+begin_src emacs-lisp
(use-short-answers t)
#+end_src

**** config
:PROPERTIES:
:header-args: :noweb-ref config-emacs-settings
:END:

*** Custom file
Emacs customization system writes to =init.el= by default, which is not great when
using tangle approach. This setting move custom modifications to a separate file.

#+begin_src emacs-lisp
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

*** help system

Always move point into help buffer, when its appeares.
#+begin_src emacs-lisp
(setopt help-window-select t)
#+end_src

#+begin_src emacs-lisp
(setopt help-at-pt-display-when-idle t)
#+end_src

#+begin_src emacs-lisp
(keymap-unset help-map "C-c" :remove) ; 'describe-copying
#+end_src

**** helpful
#+begin_src emacs-lisp
(use-package helpful
  :ensure t
  ;; :preface
  ;; (add-to-list 'load-path "~/code/emacs/helpful")
  :hook (helpful-mode . outline-minor-mode)
  :bind (([remap describe-function] . helpful-callable)
         ([remap describe-variable] . helpful-variable)
         ([remap describe-command] . helpful-command)
         ([remap describe-key] . helpful-key)
         :map help-map
         ("F" . helpful-function)))
#+end_src

*** tab-bar
Per-frame tabs, with each tab representing a window configuration (like in Vim).
#+begin_src emacs-lisp
(tab-bar-mode)
;; (tab-bar-history-mode)
#+end_src

Replace ~tab-bar-format-tabs~ with ~tab-bar-format-tabs-groups~ to make tab bar
displays tab groups. [[https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=f9b737fb9d21ac7adff403274167e76e77d033b8][Source]]
#+begin_src emacs-lisp
;; :options
;; tab-bar-format-menu-bar
;; tab-bar-format-tabs
;; tab-bar-format-tabs-groups
;; tab-bar-separator
;; tab-bar-format-add-tab
;; tab-bar-format-align-right
;; tab-bar-format-global
(setopt tab-bar-format '(tab-bar-format-history
                         tab-bar-format-tabs-groups
                         tab-bar-separator
                         tab-bar-format-add-tab))
#+end_src

#+begin_src emacs-lisp
(setopt tab-bar-tab-hints nil ;; Show tab numbers.
        tab-bar-close-button-show nil)
#+end_src

#+begin_src emacs-lisp
;; (setopt tab-bar-show 1) ;; Hide tab bar if only 1 tabs open.
(setopt tab-bar-show t) ;; Always show tab bar.
#+end_src

Buffer to show in new tab.
#+begin_src emacs-lisp
;; (setopt tab-bar-new-tab-choice "*dashboard*")
#+end_src

*** isearch
#+begin_src emacs-lisp
(setopt isearch-lazy-count t
        isearch-lazy-highlight t)
#+end_src

