home/dot_config/emacs/init.el
;;; init.el --- Emacs main configuration file -*- lexical-binding: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in ~/.config/emacs/README.org
;;;
;;; Code:

(require 'package)
(setopt package-install-upgrade-built-in t)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(add-hook 'package-menu-mode-hook #'hl-line-mode)

(setopt use-package-enable-imenu-support t)

(when (version< emacs-version "30")
  (unless (package-installed-p 'vc-use-package)
    (package-vc-install "https://github.com/slotThe/vc-use-package"))
  (require 'vc-use-package))

(use-package diminish :ensure t)
(use-package hydra    :ensure t)
(use-package auto-compile :ensure t)
(use-package no-littering :ensure t :demand t) ;; files paths configuration
(use-package f :ensure t)

(use-package gcmh
  :ensure t
  :init (gcmh-mode))

(use-package dash
  :ensure t
  :hook (after-init . global-dash-fontify-mode)
  :config
  (with-eval-after-load 'info-look
    (dash-register-info-lookup)))

(use-package which-key
  :ensure t
  :demand t ; Force the package to load immediately.
  :diminish which-key-mode
  :hook after-init
  :custom
  (which-key-idle-delay 0.6)
  (which-key-popup-type 'side-window)
  (which-key-sort-order 'which-key-key-order-alpha))

(defun my/which-key-set-command-description (&rest spec)
  "Set description for command that would be shown in the whick-key menu."
  (dolist (s (-partition 2 spec))
    (-let* (((fname description) s)
            (fname (if (symbolp fname)
                       (symbol-name fname)
                     fname)))
      (add-to-list 'which-key-replacement-alist
                   `((nil . ,fname) . (nil . ,description))))))

(use-package general
  :ensure t
  :after which-key
  :config
  (general-auto-unbind-keys))

(defun my/add-to-list (list elements &optional append)
  "Add ELEMENTS to the front of the LIST.

If APPEND is non-nil add ELEMENTS to the end of the LIST.
This function change the value of the LIST symbol.

LIST sould be a symbol.
ELEMENTS could be either a list or a single element."
  (unless (consp elements)
    (setq elements `(,elements)))
  (set list (if append
                (append (symbol-value list) elements)
              (append elements (symbol-value list)))))

(defun my/remove-from-list (list elements)
  "Remove ELEMENTS from the LIST.

LIST should be a symbol.
ELEMENTS could be either a list or a single element."
  (unless (consp elements)
    (setq elements (list elements)))
  (dolist (element elements)
    (set list (remove element (symbol-value list)))))

(defun my/set-face-attribute (face-specs)
  (unless (listp (car face-specs))
    (setq face-specs (list face-specs)))
  (dolist (s face-specs)
    (-let [(face . spec) s]
      (apply #'set-face-attribute face nil spec))))

(when window-system
  (set-frame-size (selected-frame) 1300 1000 :pixelwise))

(when window-system
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (horizontal-scroll-bar-mode -1)
  (blink-cursor-mode -1))

(use-package better-defaults :ensure t)
(use-package emacs
  :after better-defaults
  :custom
  (user-full-name "Yuriy Artemyev")
  (user-mail-address "anuvyklack@gmail.com")
  (ring-bell-function #'ignore)
  (inhibit-startup-message t)
  (cursor-type 'box)
  (cursor-in-non-selected-windows nil)
  (what-cursor-show-names t)
  (use-short-answers t)
  :config
  )

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))

(setopt help-window-select t)

(setopt help-at-pt-display-when-idle t)

(keymap-unset help-map "C-c" :remove) ; 'describe-copying

(use-package helpful
  :ensure t
  ;; :preface
  ;; (add-to-list 'load-path "~/code/emacs/helpful")
  :hook (helpful-mode . outline-minor-mode)
  :bind (([remap describe-function] . helpful-callable)
         ([remap describe-variable] . helpful-variable)
         ([remap describe-command] . helpful-command)
         ([remap describe-key] . helpful-key)
         :map help-map
         ("F" . helpful-function)))

(tab-bar-mode)
;; (tab-bar-history-mode)

;; :options
;; tab-bar-format-menu-bar
;; tab-bar-format-tabs
;; tab-bar-format-tabs-groups
;; tab-bar-separator
;; tab-bar-format-add-tab
;; tab-bar-format-align-right
;; tab-bar-format-global
(setopt tab-bar-format '(tab-bar-format-history
                         tab-bar-format-tabs-groups
                         tab-bar-separator
                         tab-bar-format-add-tab))

(setopt tab-bar-tab-hints nil ;; Show tab numbers.
        tab-bar-close-button-show nil)

;; (setopt tab-bar-show 1) ;; Hide tab bar if only 1 tabs open.
(setopt tab-bar-show t) ;; Always show tab bar.

;; (setopt tab-bar-new-tab-choice "*dashboard*")

(setopt isearch-lazy-count t
        isearch-lazy-highlight t)
