home/dot_config/emacs-old/README.org
****** Headings
#+begin_src emacs-lisp
(my/set-face-attribute
 '((org-level-1 :foreground "#375cd8" :weight normal :height 1.09)
   (org-level-2 :foreground "#cf25aa" :weight normal :height 1.09)
   (org-level-3 :foreground "#1f77bb" :weight normal :height 1.09)
   (org-level-4 :foreground "#b65050" :weight normal :height 1.09)
   (org-level-5 :foreground "#6052cf" :weight normal :height 1.09)))
#+end_src

Add a box with the same color as a background around every org heading. It does
take effect of adding padding around headings, but it is a hack and not reliable.
#+begin_src emacs-lisp
;; (my/set-face-attribute
;;  `((org-level-1 :foreground "#375cd8" :weight normal :height 1.08
;;                 :box (:line-width 4 :color ,(face-background 'default)))
;;    (org-level-2 :foreground "#cf25aa" :weight normal :height 1.08
;;                 :box (:line-width 4 :color ,(face-background 'default)))
;;    (org-level-3 :foreground "#1f77bb" :weight normal :height 1.08
;;                 :box (:line-width 4 :color ,(face-background 'default)))
;;    (org-level-4 :foreground "#b65050" :weight normal :height 1.08
;;                 :box (:line-width 4 :color ,(face-background 'default)))
;;    (org-level-5 :foreground "#6052cf" :weight normal :height 1.08
;;                 :box (:line-width 4 :color ,(face-background 'default)))))
#+end_src

****** "TODO" keywords
#+begin_src emacs-lisp
(setq org-todo-keyword-faces
      '(("SOMEDAY"    . (:foreground "#6e6e6e"))
        ;; ("TODO"       . (:foreground "#cf7200"))
        ;; ("NEXT"       . (:foreground "#de0000"))
        ("INPROGRESS" . (:foreground "#0076c8"))
        ("WAITING"    . (:foreground "#cf7200"))
        ;; ("DONE"       . (:foreground "#598d3f"))
        ("CANCELLED"  . (:foreground "#63735b"))
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ("󰒅" . (:foreground "#7b7b7b"))
        ;; ("󰿦" . (:foreground "#7b7b7b"))
        ;; ("󰔌" . (:foreground "#7b7b7b"))
        ;; ("󰄱" . (:foreground ""))
        ;; ("󱗝" . (:foreground ""))
        ;; ("󰡖" . (:foreground ""))
        ;; ("󰤌" . (:foreground ""))
        ;; ("󱅊" . (:foreground ""))
        ("󰔟" . (:foreground "#0076c8"))
        ;; ("󰄵" . (:foreground ""))
        ("󰅘" . (:foreground "#6e6e6e"))
        ("󱈎" . (:foreground "#6e6e6e"))))
#+end_src

****** Priorities
#+begin_src emacs-lisp
(setq org-priority-faces
      '((?A :foreground "red"     :weight bold)
        (?B :foreground "orange"  :weight bold)
        (?C :foreground "#7CB342" :weight bold)
        (?D :foreground "#2196F3" :weight bold)
        ;; (?D :foreground "#AB47BC" :weight bold)
        ))
#+end_src

***** avy faces
:PROPERTIES:
:header-args: :noweb-ref ef-themes-config
:END:
#+begin_src emacs-lisp :noweb yes
(with-eval-after-load 'avy
  <<ef-avy-faces>>
  )
#+end_src

#+begin_src emacs-lisp :noweb-ref ef-avy-faces
(my/set-face-attribute
 '((avy-background-face :foreground "#7e6f8e" :background unspecified)
   (avy-lead-face       :foreground "grey5"   :background "#ffe9b0" :weight bold)
   ;; (avy-lead-face-0     :background "#ffced7" :weight normal)
   (avy-lead-face-0     :background "#ffe2e7" :weight normal)
   (avy-lead-face-1     :foreground "black"   :background "#ffd5ff" :weight normal)
   (avy-lead-face-2     :background "#c1ffc4")))
#+end_src

#+begin_src emacs-lisp :noweb-ref ef-avy-faces
;; (my/set-face-attribute
;;  '((avy-lead-face   :foreground "red"   :background unspecified :weight bold)
;;    (avy-lead-face-0 :foreground "brown" :background unspecified :weight normal)))
#+end_src

***** eglot faces
:PROPERTIES:
:header-args: :noweb-ref ef-eglot-faces
:END:

#+begin_src emacs-lisp
(my/set-face-attribute
 '((eglot-highlight-symbol-face :background "grey98"
                                :box (:line-width (-1 . -1) :color "grey75")
                                :inherit unspecified)))
#+end_src

**** COMMENT OS^1
[[https://github.com/sashimacs/os1-theme][Source]]
#+begin_src emacs-lisp
(use-package os1-theme
  :vc (:fetcher github :repo "sashimacs/os1-theme")
  :config (load-theme 'os1 :no-confirm))
#+end_src

**** COMMENT modus-themes
#+begin_src emacs-lisp
(use-package modus-themes
  :ensure t
  :config
  (load-theme 'modus-operandi-tritanopia :no-confirm))
#+end_src

**** COMMENT shanty-themes
#+begin_src emacs-lisp
(use-package shanty-themes
  :ensure t
  ;; :custom
  ;; ;; Enable or disable the boxes around function definitions.
  ;; (shanty-themes-function-box t)
  :config
  ;; (load-theme 'shanty-themes-light :no-confirm)
  (load-theme 'shanty-themes-dark :no-confirm))
#+end_src

**** COMMENT doom-themes
#+begin_src emacs-lisp
(use-package doom-themes
  :ensure t
  :custom
  (doom-themes-enable-bold t)
  (doom-themes-enable-italic t)
  :config
  ;; (load-theme 'doom-spacegrey t)
  ;; (load-theme 'doom-flatwhite t)
  ;; (load-theme 'doom-miramare t)
  ;; (load-theme 'doom-plain t)
  (load-theme 'doom-one t)
  )
#+end_src

**** COMMENT gruvbox-material
#+begin_src emacs-lisp
(use-package doom-themes
  :ensure t
  :custom
  (doom-themes-enable-bold t)
  (doom-themes-enable-italic t))

(use-package doom-gruvbox-material-theme
  :vc (:fetcher github :repo "Cardoso1994/doom-gruvbox-material-theme")
  :after doom-themes
  :custom
  (doom-gruvbox-material-background "soft")  ; soft, medium, hard
  (doom-gruvbox-material-palette "material") ; material, mix, original
  ;; (doom-theme 'doom-gruvbox-material)
  :config
  ;;; Symlink `gruvbox-material' file to `doom-themes' directory.
  (let* ((elpa-dir "~/.config/emacs/elpa")
         (doom-themes-dir (car (f-glob "doom-themes-*" elpa-dir)))
         (theme-file "doom-gruvbox-material-theme.el")
         (from (f-join elpa-dir "doom-gruvbox-material-theme" theme-file))
         (to (f-join doom-themes-dir theme-file)))
    (unless (f-file? to)
      (f-symlink from to)))
  (load-theme 'doom-gruvbox-material t))
#+end_src

*** Fringes
- [[https://emacsredux.com/blog/2015/01/18/customizing-the-fringes/][Customizing the Fringes | Emacs Redux]]

The fringes are used to display symbols that provide information about the text
in the window. You can type =M-x fringe-mode= to disable the fringes, or modify
their width. This command affects fringes in all frames; to modify fringes on
the selected frame only, use =M-x set-fringe-style=. You can make your changes to
the fringes permanent by customizing the variable ~fringe-mode~.

#+begin_src emacs-lisp
(setopt fringe-mode 10)
#+end_src

*** Page breaks
From-feed ASCII cahacter.

**** COMMENT form-feed
#+begin_src emacs-lisp
(use-package form-feed
  :ensure t
  :custom (form-feed-lighter "# ^L")
  :hook (emacs-lisp-mode
         nushell-ts-mode))
#+end_src

**** COMMENT form-feed-st
#+begin_src emacs-lisp
(use-package form-feed-st
  :ensure t
  :hook (emacs-lisp-mode
         nushell-ts-mode))
#+end_src

**** page-break-lines
#+begin_src emacs-lisp
(use-package page-break-lines
  :ensure t
  :hook (emacs-lisp-mode
         nushell-ts-mode)
  ;; :config
  ;; (global-page-break-lines-mode)
  )
#+end_src

*** Scrolling
#+begin_src emacs-lisp
(setopt scroll-margin 0
        auto-window-vscroll nil
        scroll-error-top-bottom nil)
#+end_src

#+begin_src emacs-lisp
(setopt mouse-wheel-tilt-scroll t
        mouse-wheel-progressive-speed nil)
#+end_src

*** Do not jump half the page when point goes out of the screen.

#+begin_src emacs-lisp
(setopt scroll-conservatively 101)
#+end_src

Restore original value for some functions.
#+begin_src emacs-lisp
(defun with-default-scroll-settings (fun)
  (eval `(define-advice ,fun
             (:around (orig-fun &rest args) scroll-conservatively)
           (-let (((scroll-conservatively) (get 'scroll-conservatively 'standard-value)))
             (apply orig-fun args)))))

(mapcar #'with-default-scroll-settings '(dired-do-find-regexp-and-replace
                                         projectile-replace
                                         projectile-replace-regexp))
#+end_src

*** Smooth scrolling
#+begin_src emacs-lisp
(setq jit-lock-stealth-time 1.25) ; Calculate fonts when idle for 1.25 seconds.
(setq jit-lock-stealth-nice 0.2)  ; Seconds between font locking.
(setq jit-lock-chunk-size 4096)
#+end_src

#+begin_src emacs-lisp
(setq jit-lock-defer-time 0)
(with-eval-after-load 'evil
  (add-hook 'evil-insert-state-entry-hook
            (lambda () (setq jit-lock-defer-time 0.25))
            nil t)
  (add-hook 'evil-insert-state-exit-hook
            (lambda () (setq jit-lock-defer-time 0))
            nil t))
#+end_src

**** COMMENT good-scroll
#+begin_src emacs-lisp :noweb yes
(use-package good-scroll
  :ensure t
  :after evil
  :custom (good-scroll-duration 0.3)
  :config
  (good-scroll-mode)
  ;; Return variables back
  (setq mwheel-scroll-up-function   #'scroll-up
        mwheel-scroll-down-function #'scroll-down)
  <<good-scroll-config>>
  )
#+end_src
***** config
:PROPERTIES:
:header-args: :noweb-ref good-scroll-config
:END:
#+begin_src emacs-lisp
(defun good-scroll--convert-line-to-step (line)
  (cl-typecase line
    (integer              (* line (line-pixel-height)))
    ((or null (member -)) (- (good-scroll--window-usable-height)
                             (* next-screen-context-lines
                                (line-pixel-height))))
    (t                    (line-pixel-height))))
#+end_src

****** COMMENT Rebind scrolling keybindings explicitly
#+begin_src emacs-lisp
(defun good-scroll-up-half-screen ()
  (interactive)
  (good-scroll-move (/ (good-scroll--window-usable-height) 2)))

(defun good-scroll-down-half-screen ()
  (interactive)
  (good-scroll-move (- (/ (good-scroll--window-usable-height) 2))))

(general-def :states 'motion
  "C-d" 'good-scroll-up-half-screen
  "C-u" 'good-scroll-down-half-screen
  "C-f" 'good-scroll-up-full-screen
  "C-b" 'good-scroll-down-full-screen)

;; Page-Up / Page-Down keys
(general-def
  "<next>"  'good-scroll-up-full-screen
  "<prior>" 'good-scroll-down-full-screen)
#+end_src

******* COMMENT Evil =C-y= / =C-e= keybindings:

#+begin_src emacs-lisp
(evil-define-command evil-scroll-line-up (count)
  "Scroll the window COUNT lines upwards."
  :repeat nil
  :keep-visual t
  (interactive "p")
  (let ((scroll-preserve-screen-position nil)
        (steps (- (good-scroll--convert-line-to-step count))))
    (good-scroll-move steps)))

(evil-define-command evil-scroll-line-down (count)
  "Scroll the window COUNT lines downwards."
  :repeat nil
  :keep-visual t
  (interactive "p")
  (let ((scroll-preserve-screen-position nil)
        (steps (good-scroll--convert-line-to-step count)))
    (good-scroll-move steps)))
#+end_src

****** Rebind scrolling keybindings implicitly

Rebind scrolling keybindings implicitly by replacing
~scroll-up~ / ~scroll-down~ functions.

#+begin_src emacs-lisp
(defun good-scroll--scroll-up (&optional arg)
  (good-scroll-move (good-scroll--convert-line-to-step arg)))

(defun good-scroll--scroll-down (&optional arg)
  (good-scroll-move (- (good-scroll--convert-line-to-step arg))))

(advice-add 'scroll-up   :override 'good-scroll--scroll-up)
(advice-add 'scroll-down :override 'good-scroll--scroll-down)
#+end_src

****** Make evil =C-y= / =C-e= scroll =n= lines at time
#+begin_src emacs-lisp
(let ((n 3)) ;; number of lines for short move
  (define-advice evil-scroll-line-down (:around (callback count) triple)
    (funcall callback (* count n)))

  (define-advice evil-scroll-line-up (:around (callback count) triple)
    (funcall callback (* count n))))
#+end_src

