home/dot_config/emacs/init.el
     '((org-level-1 :foreground "#375cd8" :weight normal :height 1.09)
       (org-level-2 :foreground "#cf25aa" :weight normal :height 1.09)
       (org-level-3 :foreground "#1f77bb" :weight normal :height 1.09)
       (org-level-4 :foreground "#b65050" :weight normal :height 1.09)
       (org-level-5 :foreground "#6052cf" :weight normal :height 1.09)))
    ;; (my/set-face-attribute
    ;;  `((org-level-1 :foreground "#375cd8" :weight normal :height 1.08
    ;;                 :box (:line-width 4 :color ,(face-background 'default)))
    ;;    (org-level-2 :foreground "#cf25aa" :weight normal :height 1.08
    ;;                 :box (:line-width 4 :color ,(face-background 'default)))
    ;;    (org-level-3 :foreground "#1f77bb" :weight normal :height 1.08
    ;;                 :box (:line-width 4 :color ,(face-background 'default)))
    ;;    (org-level-4 :foreground "#b65050" :weight normal :height 1.08
    ;;                 :box (:line-width 4 :color ,(face-background 'default)))
    ;;    (org-level-5 :foreground "#6052cf" :weight normal :height 1.08
    ;;                 :box (:line-width 4 :color ,(face-background 'default)))))
    (setq org-todo-keyword-faces
          '(("SOMEDAY"    . (:foreground "#6e6e6e"))
            ;; ("TODO"       . (:foreground "#cf7200"))
            ;; ("NEXT"       . (:foreground "#de0000"))
            ("INPROGRESS" . (:foreground "#0076c8"))
            ("WAITING"    . (:foreground "#cf7200"))
            ;; ("DONE"       . (:foreground "#598d3f"))
            ("CANCELLED"  . (:foreground "#63735b"))
            ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
            ("󰒅" . (:foreground "#7b7b7b"))
            ;; ("󰿦" . (:foreground "#7b7b7b"))
            ;; ("󰔌" . (:foreground "#7b7b7b"))
            ;; ("󰄱" . (:foreground ""))
            ;; ("󱗝" . (:foreground ""))
            ;; ("󰡖" . (:foreground ""))
            ;; ("󰤌" . (:foreground ""))
            ;; ("󱅊" . (:foreground ""))
            ("󰔟" . (:foreground "#0076c8"))
            ;; ("󰄵" . (:foreground ""))
            ("󰅘" . (:foreground "#6e6e6e"))
            ("󱈎" . (:foreground "#6e6e6e"))))
    (setq org-priority-faces
          '((?A :foreground "red"     :weight bold)
            (?B :foreground "orange"  :weight bold)
            (?C :foreground "#7CB342" :weight bold)
            (?D :foreground "#2196F3" :weight bold)
            ;; (?D :foreground "#AB47BC" :weight bold)
            ))
    )
  (with-eval-after-load 'eglot
    (my/set-face-attribute
     '((eglot-highlight-symbol-face :background "grey98"
                                    :box (:line-width (-1 . -1) :color "grey75")
                                    :inherit unspecified)))
    )
  )

(setopt fringe-mode 10)

(use-package page-break-lines
  :ensure t
  :hook (emacs-lisp-mode
         nushell-ts-mode)
  ;; :config
  ;; (global-page-break-lines-mode)
  )

(setopt scroll-margin 0
        auto-window-vscroll nil
        scroll-error-top-bottom nil)

(setopt mouse-wheel-tilt-scroll t
        mouse-wheel-progressive-speed nil)

(setopt scroll-conservatively 101)

(defun with-default-scroll-settings (fun)
  (eval `(define-advice ,fun
             (:around (orig-fun &rest args) scroll-conservatively)
           (-let (((scroll-conservatively) (get 'scroll-conservatively 'standard-value)))
             (apply orig-fun args)))))

(mapcar #'with-default-scroll-settings '(dired-do-find-regexp-and-replace
                                         projectile-replace
                                         projectile-replace-regexp))

(setq jit-lock-stealth-time 1.25) ; Calculate fonts when idle for 1.25 seconds.
(setq jit-lock-stealth-nice 0.2)  ; Seconds between font locking.
(setq jit-lock-chunk-size 4096)

(setq jit-lock-defer-time 0)
(with-eval-after-load 'evil
  (add-hook 'evil-insert-state-entry-hook
            (lambda () (setq jit-lock-defer-time 0.25))
            nil t)
  (add-hook 'evil-insert-state-exit-hook
            (lambda () (setq jit-lock-defer-time 0))
            nil t))
