home/dot_config/emacs-old/README.org
**** pixel-scroll
#+begin_src emacs-lisp :noweb yes
(use-package pixel-scroll
  :hook (after-init . pixel-scroll-precision-mode)
  :custom
  ;; (pixel-scroll-precision-use-momentum nil)
  (pixel-scroll-precision-interpolate-page t)
  (pixel-scroll-precision-interpolate-mice nil)
  (pixel-scroll-precision-large-scroll-height 20.0)
  :config
  <<pixel-scroll-config>>
  )
#+end_src
***** Evil keybindings for smooth scrolling
:PROPERTIES:
:header-args: :noweb-ref pixel-scroll-config
:END:
#+begin_src emacs-lisp
(setopt pixel-scroll-precision-interpolation-total-time 0.3)

(let ((num-of-lines 4))
  (evil-define-command my/pixel-scroll-interpolate-line-up (count)
    :repeat nil
    :keep-visual t
    (interactive "p")
    (let* ((pixel-scroll-precision-interpolation-total-time 0.08)
           (pixels-per-line (/ (window-text-height nil t)
                               (window-text-height)))
           (delta (* pixels-per-line
                     num-of-lines
                     count)))
      (pixel-scroll-precision-interpolate delta nil 1)))

  (evil-define-command my/pixel-scroll-interpolate-line-down (count)
    :repeat nil
    :keep-visual t
    (interactive "p")
    (let* ((pixel-scroll-precision-interpolation-total-time 0.08)
           (pixels-per-line (/ (window-text-height nil t)
                               (window-text-height)))
           (delta (- (* pixels-per-line
                        num-of-lines
                        count))))
      (pixel-scroll-precision-interpolate delta nil 1))))

(evil-define-command my/pixel-scroll-interpolate-half-page-up ()
  "Interpolate a scroll upwards by half page."
  :repeat nil
  :keep-visual t
  (interactive)
  (pixel-scroll-precision-interpolate (/ (window-text-height nil t) 2)
                                      nil 1))

(evil-define-command my/pixel-scroll-interpolate-half-page-down ()
  "Interpolate a scroll downwards by half page."
  :repeat nil
  :keep-visual t
  (interactive)
  (pixel-scroll-precision-interpolate (- (/ (window-text-height nil t) 2))
                                      nil 1))

(evil-add-command-properties #'pixel-scroll-interpolate-down :repeat nil :keep-visual t)
(evil-add-command-properties #'pixel-scroll-interpolate-up   :repeat nil :keep-visual t)

(general-def
  [remap evil-scroll-down]      'my/pixel-scroll-interpolate-half-page-down ; C-d
  [remap evil-scroll-up]        'my/pixel-scroll-interpolate-half-page-up   ; C-u
  [remap evil-scroll-page-down] 'pixel-scroll-interpolate-down              ; C-f
  [remap evil-scroll-page-up]   'pixel-scroll-interpolate-up                ; C-b
  [remap evil-scroll-line-down] 'my/pixel-scroll-interpolate-line-down      ; C-e
  [remap evil-scroll-line-up]   'my/pixel-scroll-interpolate-line-up)       ; C-y

;; (general-def :keymaps 'help-mode-map :states 'normal
;;   "C-f" 'pixel-scroll-interpolate-down
;;   "C-b" 'pixel-scroll-interpolate-up)
#+end_src

*** Long lines
Do not wrap long lines.
#+begin_src emacs-lisp
(setopt truncate-lines t)
#+end_src

**** Visually wrap long lines

- ~visual-line-mode~ :: (built-in) Turn on long lines wrapping on words ends.

***** COMMENT virtual-auto-fill

#+begin_src emacs-lisp
(use-package virtual-auto-fill :ensure t)
#+end_src

- ~virtual-auto-fill-mode~ :: Visually wrap lines between wrap prefix and ~fill-column~.

This package combine together two packages:
- =visual-fill-column=
- =adaptive-wrap=

***** COMMENT visual-fill-column & adaptive-wrap
This two packages improves ~visual-line-mode~.
Detailed description with images is in the repo: [[https://codeberg.org/joostkremers/visual-fill-column][joostkremers/visual-fill-column]].

1. Visually break long lines on ~fill-column~.
   #+begin_src emacs-lisp
   (use-package visual-fill-column
     :ensure t
     :custom
     (visual-fill-column-width 90)
     ;; (visual-fill-column-center-text t)
     :hook (visual-line-mode . visual-fill-column-mode))
   #+end_src

2. Visually prepend wrapped lines to preserve visual column structures.
   #+begin_src emacs-lisp
   (use-package adaptive-wrap
     :ensure t
     :hook (visual-line-mode . adaptive-wrap-prefix-mode))
   #+end_src

*** Display line numbers
#+begin_src emacs-lisp
(use-package display-line-numbers
  :custom
  ;; (display-line-numbers-width 4)
  (display-line-numbers-grow-only t)
  (display-line-numbers-width-start t)
  :hook (prog-mode . display-line-numbers-mode))
#+end_src

*** Display fill-column indicator
#+begin_src emacs-lisp
(use-package display-fill-column-indicator
  :hook prog-mode)
#+end_src

*** Show column number in modeline
#+begin_src emacs-lisp
(column-number-mode)
#+end_src

*** Modeline
**** doom-modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  ;; :elpaca (:host github :repo "seagle0128/doom-modeline"
  ;;                ;; :ref "aa0e2dd"
  ;;                :ref "379b45bffe7d67683f17c3e815797a082d8793d3")
  :init
  (setq doom-modeline-support-imenu t)
  :custom
  (doom-modeline-height 27)
  (doom-modeline-buffer-file-name-style 'relative-from-project)
  (doom-modeline-icon t)
  (doom-modeline-major-mode-icon t)
  (doom-modeline-time-icon t)
  (doom-modeline-highlight-modified-buffer-name nil)
  :config
  (doom-modeline-mode))
#+end_src

*** Compose escape signs together to make regexps more readable

=\\= in strings is displayed as a ~easy-escape-character~ (single =\= by default)
and fontified using ~easy-escape-face~.

#+begin_src emacs-lisp
(use-package easy-escape
  :ensure t
  :custom
  (easy-escape-character ?⧵) ;; REVERSE SOLIDUS OPERATOR
  ;; (easy-escape-character ?⧹) ;; BIG REVERSE SOLIDUS
  ;; (easy-escape-character ?＼) ;; FULLWIDTH REVERSE SOLIDUS
  :hook (emacs-lisp-mode . easy-escape-minor-mode))
#+end_src

*** rainbow-mode — Colorize strings that represent colors.
#+begin_src emacs-lisp
(use-package rainbow-mode
  :ensure t
  :hook (emacs-lisp-mode conf-space-mode fish-mode conf-toml-mode toml-ts-mode))
#+end_src

*** Highlight whitespace characters
- ~leerzeichen-mode~
#+begin_src emacs-lisp
(use-package leerzeichen
  :ensure t)
#+end_src

*** prettify-symbols-mode
#+begin_src emacs-lisp
(setopt prettify-symbols-unprettify-at-point t)
#+end_src

** Evil
*** evil
#+begin_src emacs-lisp :noweb yes
(use-package evil
  :ensure t
  :preface
  (setq evil-want-keybinding nil)
  :init (evil-mode)
  :custom
  ;; Needed for evil-collection.
  (evil-want-integration t)
  (evil-want-keybinding nil)

  (evil-want-C-u-scroll t)
  (evil-want-C-d-scroll t)
  (evil-want-C-i-jump t)
  (evil-want-C-u-delete t)
  (evil-respect-visual-line-mode t)
  ;; (evil-want-minibuffer t)
  (evil-want-fine-undo t)
  (evil-undo-system 'undo-redo)
  (evil-overriding-maps nil)
  (evil-move-beyond-eol t)
  ;; (evil-ex-complete-emacs-commands 'always)
  (evil-shift-round t)
  (org-return-follows-link t)
  (evil-vsplit-window-right t)
  (evil-split-window-below t)

  :config

  ;;; Make `Y' work as `y$'.
  ;;; Set it here explicitly, because it doesn't work if set in `custom' section.
  (setopt evil-want-Y-yank-to-eol t)

  ;; (setopt evil-search-module 'isearch)
  (setopt evil-search-module 'evil-search)

  ;;; Bind `:ls' command to `bufler' (`ibuffer') instead of `list-buffers'.
  (evil-ex-define-cmd "ls" 'bufler)
  ;; (evil-ex-define-cmd "ls" 'ibuffer-jump)

  ;;; Paste and indent before/after.
  (defun my/paste-and-indent-before ()
    (interactive)
    (with-undo-amalgamate
      (evil-paste-before 1)
      (evil-indent (evil-get-marker ?\[)
                   (evil-get-marker ?\]))))

  (defun my/paste-and-indent-after ()
    (interactive)
    (with-undo-amalgamate
      (evil-paste-after 1)
      (evil-indent (evil-get-marker ?\[)
                   (evil-get-marker ?\])))))
#+end_src

**** custom =ZZ= command

Save buffer and kill it.

#+begin_src emacs-lisp
(with-eval-after-load 'evil
 ;; (advice-add :after 'evil-window-vsplit)
 (evil-define-command my/evil-save-modified-buffer-and-kill-it (file &optional bang)
   "Save the current buffer and kill it"
   :repeat nil
   (interactive "<f><!>")
   (when (buffer-modified-p)
     (evil-write nil nil nil file bang))
   (kill-this-buffer)
   ;; (ibuffer)
   (bufler)))
#+end_src

*** evil-collection
#+begin_src emacs-lisp
(use-package evil-collection
  :ensure t
  :after evil
  :custom
  ;; SPC is my leader key, so forbid evil-collection to bind to it.
  (evil-collection-key-blacklist '("SPC"))
  (evil-collection-setup-minibuffer t)
  (evil-collection-corfu-key-themes '(default tab-n-go))
  :config
  (evil-collection-init))
#+end_src

