home/dot_config/emacs/init.el

(use-package pixel-scroll
  :hook (after-init . pixel-scroll-precision-mode)
  :custom
  ;; (pixel-scroll-precision-use-momentum nil)
  (pixel-scroll-precision-interpolate-page t)
  (pixel-scroll-precision-interpolate-mice nil)
  (pixel-scroll-precision-large-scroll-height 20.0)
  :config
  (setopt pixel-scroll-precision-interpolation-total-time 0.3)
  
  (let ((num-of-lines 4))
    (evil-define-command my/pixel-scroll-interpolate-line-up (count)
      :repeat nil
      :keep-visual t
      (interactive "p")
      (let* ((pixel-scroll-precision-interpolation-total-time 0.08)
             (pixels-per-line (/ (window-text-height nil t)
                                 (window-text-height)))
             (delta (* pixels-per-line
                       num-of-lines
                       count)))
        (pixel-scroll-precision-interpolate delta nil 1)))
  
    (evil-define-command my/pixel-scroll-interpolate-line-down (count)
      :repeat nil
      :keep-visual t
      (interactive "p")
      (let* ((pixel-scroll-precision-interpolation-total-time 0.08)
             (pixels-per-line (/ (window-text-height nil t)
                                 (window-text-height)))
             (delta (- (* pixels-per-line
                          num-of-lines
                          count))))
        (pixel-scroll-precision-interpolate delta nil 1))))
  
  (evil-define-command my/pixel-scroll-interpolate-half-page-up ()
    "Interpolate a scroll upwards by half page."
    :repeat nil
    :keep-visual t
    (interactive)
    (pixel-scroll-precision-interpolate (/ (window-text-height nil t) 2)
                                        nil 1))
  
  (evil-define-command my/pixel-scroll-interpolate-half-page-down ()
    "Interpolate a scroll downwards by half page."
    :repeat nil
    :keep-visual t
    (interactive)
    (pixel-scroll-precision-interpolate (- (/ (window-text-height nil t) 2))
                                        nil 1))
  
  (evil-add-command-properties #'pixel-scroll-interpolate-down :repeat nil :keep-visual t)
  (evil-add-command-properties #'pixel-scroll-interpolate-up   :repeat nil :keep-visual t)
  
  (general-def
    [remap evil-scroll-down]      'my/pixel-scroll-interpolate-half-page-down ; C-d
    [remap evil-scroll-up]        'my/pixel-scroll-interpolate-half-page-up   ; C-u
    [remap evil-scroll-page-down] 'pixel-scroll-interpolate-down              ; C-f
    [remap evil-scroll-page-up]   'pixel-scroll-interpolate-up                ; C-b
    [remap evil-scroll-line-down] 'my/pixel-scroll-interpolate-line-down      ; C-e
    [remap evil-scroll-line-up]   'my/pixel-scroll-interpolate-line-up)       ; C-y
  
  ;; (general-def :keymaps 'help-mode-map :states 'normal
  ;;   "C-f" 'pixel-scroll-interpolate-down
  ;;   "C-b" 'pixel-scroll-interpolate-up)
  )

(setopt truncate-lines t)

(use-package display-line-numbers
  :custom
  ;; (display-line-numbers-width 4)
  (display-line-numbers-grow-only t)
  (display-line-numbers-width-start t)
  :hook (prog-mode . display-line-numbers-mode))

(use-package display-fill-column-indicator
  :hook prog-mode)

(column-number-mode)

(use-package doom-modeline
  :ensure t
  ;; :elpaca (:host github :repo "seagle0128/doom-modeline"
  ;;                ;; :ref "aa0e2dd"
  ;;                :ref "379b45bffe7d67683f17c3e815797a082d8793d3")
  :init
  (setq doom-modeline-support-imenu t)
  :custom
  (doom-modeline-height 27)
  (doom-modeline-buffer-file-name-style 'relative-from-project)
  (doom-modeline-icon t)
  (doom-modeline-major-mode-icon t)
  (doom-modeline-time-icon t)
  (doom-modeline-highlight-modified-buffer-name nil)
  :config
  (doom-modeline-mode))

(use-package easy-escape
  :ensure t
  :custom
  (easy-escape-character ?⧵) ;; REVERSE SOLIDUS OPERATOR
  ;; (easy-escape-character ?⧹) ;; BIG REVERSE SOLIDUS
  ;; (easy-escape-character ?＼) ;; FULLWIDTH REVERSE SOLIDUS
  :hook (emacs-lisp-mode . easy-escape-minor-mode))

(use-package rainbow-mode
  :ensure t
  :hook (emacs-lisp-mode conf-space-mode fish-mode conf-toml-mode toml-ts-mode))

(use-package leerzeichen
  :ensure t)

(setopt prettify-symbols-unprettify-at-point t)

(use-package evil
  :ensure t
  :preface
  (setq evil-want-keybinding nil)
  :init (evil-mode)
  :custom
  ;; Needed for evil-collection.
  (evil-want-integration t)
  (evil-want-keybinding nil)

  (evil-want-C-u-scroll t)
  (evil-want-C-d-scroll t)
  (evil-want-C-i-jump t)
  (evil-want-C-u-delete t)
  (evil-respect-visual-line-mode t)
  ;; (evil-want-minibuffer t)
  (evil-want-fine-undo t)
  (evil-undo-system 'undo-redo)
  (evil-overriding-maps nil)
  (evil-move-beyond-eol t)
  ;; (evil-ex-complete-emacs-commands 'always)
  (evil-shift-round t)
  (org-return-follows-link t)
  (evil-vsplit-window-right t)
  (evil-split-window-below t)

  :config

  ;;; Make `Y' work as `y$'.
  ;;; Set it here explicitly, because it doesn't work if set in `custom' section.
  (setopt evil-want-Y-yank-to-eol t)

  ;; (setopt evil-search-module 'isearch)
  (setopt evil-search-module 'evil-search)

  ;;; Bind `:ls' command to `bufler' (`ibuffer') instead of `list-buffers'.
  (evil-ex-define-cmd "ls" 'bufler)
  ;; (evil-ex-define-cmd "ls" 'ibuffer-jump)

  ;;; Paste and indent before/after.
  (defun my/paste-and-indent-before ()
    (interactive)
    (with-undo-amalgamate
      (evil-paste-before 1)
      (evil-indent (evil-get-marker ?\[)
                   (evil-get-marker ?\]))))

  (defun my/paste-and-indent-after ()
    (interactive)
    (with-undo-amalgamate
      (evil-paste-after 1)
      (evil-indent (evil-get-marker ?\[)
                   (evil-get-marker ?\])))))

(with-eval-after-load 'evil
 ;; (advice-add :after 'evil-window-vsplit)
 (evil-define-command my/evil-save-modified-buffer-and-kill-it (file &optional bang)
   "Save the current buffer and kill it"
   :repeat nil
   (interactive "<f><!>")
   (when (buffer-modified-p)
     (evil-write nil nil nil file bang))
   (kill-this-buffer)
   ;; (ibuffer)
   (bufler)))

(use-package evil-collection
  :ensure t
  :after evil
  :custom
  ;; SPC is my leader key, so forbid evil-collection to bind to it.
  (evil-collection-key-blacklist '("SPC"))
  (evil-collection-setup-minibuffer t)
  (evil-collection-corfu-key-themes '(default tab-n-go))
  :config
  (evil-collection-init))

(use-package evil-easymotion
  :ensure t
  :after (avy evil)
  :config
