home/dot_config/emacs/init.el
  (evil-define-avy-motion avy-goto-word-0-above exclusive)
  (evil-define-avy-motion avy-goto-word-0-below exclusive)
  (evilem-make-motion evilem-motion-forward-WORD-begin  #'evil-forward-WORD-begin)
  (evilem-make-motion evilem-motion-backward-WORD-begin #'evil-backward-WORD-begin)
  (evilem-make-motion evilem-motion-forward-word-end    #'evil-forward-word-end)
  (evilem-make-motion evilem-motion-forward-WORD-end    #'evil-forward-WORD-end)
  (general-def :keymaps 'semicolon-leader-map
    "w"  #'evil-avy-goto-word-0-below
    "W"  #'evilem-motion-forward-WORD-begin
    "b"  #'evil-avy-goto-word-0-above
    "B"  #'evilem-motion-backward-WORD-begin
    "e"  #'evilem-motion-forward-word-end
    "E"  #'evilem-motion-forward-WORD-end
    "ge" #'evilem-motion-backward-word-end
    "gE" #'evilem-motion-backward-WORD-end
    "j"  #'evilem-motion-next-visual-line
    "k"  #'evilem-motion-previous-visual-line))

(use-package evil-snipe
  :ensure t
  :after evil-collection
  :custom
  (evil-snipe-scope 'whole-visible)
  (evil-snipe-override-evil-repeat-keys nil)
  (evil-snipe-smart-case t)
  :config
  (evil-snipe-mode)
  (evil-snipe-override-mode)
  (my/add-to-list
   'evil-snipe-disabled-modes '(telega-root-mode
                                pdf-view-mode
                                ;; helpful-mode
                                magit-mode ;; magit-status-mode
                                nov-mode))
  (general-def :keymaps 'evil-snipe-parent-transient-map
    "n" 'evil-snipe-repeat
    "N" 'evil-snipe-repeat-reverse
    "<tab>"     'evil-snipe-repeat
    "<backtab>" 'evil-snipe-repeat-reverse)

  ;; Integration with evil-easymotion
  (with-eval-after-load 'evil-easymotion
    (general-def :keymaps 'evil-snipe-parent-transient-map
      ";" (evilem-create 'evil-snipe-repeat
                         :bind ((evil-snipe-scope 'buffer)
                                (evil-snipe-enable-highlight nil)
                                (evil-snipe-enable-incremental-highlight nil))
                         :post-hook #'evil-snipe--cleanup))))

(use-package evil-visualstar
  :ensure t
  :after evil
  :config (global-evil-visualstar-mode))

(use-package evil-cleverparens
  :ensure t
  :after evil
  :hook lisp-data-mode
  :custom
  (evil-cleverparens-use-s-and-S nil)
  (evil-cleverparens-drag-ignore-lines t)
  :config

  (evil-define-motion my/evil-cp-forward-sexp (count)
    "Motion for moving forward by a sexp."
    :type exclusive
    (let ((count (or count 1)))
      (when (evil-eolp)
        (forward-char))
      (forward-sexp count)
      (forward-sexp)
      (backward-sexp)))

  (evil-define-motion my/evil-cp-backward-sexp (count)
    "Motion for moving backwward by a sexp."
    :type exclusive
    (let ((count (or count 1)))
      (backward-sexp count)))

  (evil-define-motion my/evil-cp-up-sexp (count)
    "Move the cursor to the nearest paired closing bracket."
    :move-point nil
    :type inclusive
    (let ((count (or count 1)))
      (when (evil-cp--looking-at-any-opening-p)
        (evilmi-jump-items)
        (setq count (- count 1)))
      (when (> count 0)
        (when (evil-cp--looking-at-any-closing-p)
          (forward-char))
        (and (sp-up-sexp count)
             (backward-char))))))

(use-package evil-goggles
  :ensure t
  :after (evil evil-cleverparens)
  ;; :custom
  ;; (evil-goggles-duration 0.100) ; default is 0.200
  ;; (evil-goggles-enable-delete nil)
  ;; (evil-goggles-enable-change nil)
  :config

  ;;; Add `evil-cleverparens' support
  (progn
    (defvar my/evil-cp-goggles-commands
      '((evil-cp-delete      :face evil-goggles-delete-face :switch t :advice evil-goggles--generic-blocking-advice)
        (evil-cp-delete-line :face evil-goggles-delete-face :switch t :advice evil-goggles--delete-line-advice)
        (evil-cp-yank        :face evil-goggles-yank-face   :switch t :advice evil-goggles--generic-async-advice)
        (evil-cp-yank-line   :face evil-goggles-yank-face   :switch t :advice evil-goggles--generic-async-advice)
        (evil-cp-change      :face evil-goggles-change-face :switch t :advice evil-goggles--generic-blocking-advice)
        (evil-cp-change-line :face evil-goggles-change-face :switch t :advice evil-goggles--generic-blocking-advice)))
    (my/add-to-list 'evil-goggles--commands my/evil-cp-goggles-commands :append))

  (evil-goggles-mode)

  ;; Use diff-mode's faces; deleted text will be highlighed with `diff-removed',
  ;; other faces such as `diff-added' will be used for other actions.
  (evil-goggles-use-diff-faces))

(use-package evil-org
  ;; :ensure t
  :load-path "~/code/emacs/evil-org-mode"
  :after evil-collection
  :hook
  (org-mode . evil-org-mode)
  (org-agenda-mode . (lambda ()
                       (require 'evil-org-agenda)
                       (evil-org-agenda-set-keys)))
  :config
  (evil-org-set-key-theme '(operators
                            textobjects
                            insert
                            ;; navigation
                            additional
                            ;; shift
                            todo
                            ;; heading
                            )))

(use-package evil-anzu
  :ensure t
  :after (evil anzu))

(use-package evil-nerd-commenter
  :ensure t
  :after evil-collection
  :config
  (setopt evilnc-comment-text-object "c")
  (keymap-set evil-inner-text-objects-map evilnc-comment-text-object #'evilnc-inner-commenter)
  (keymap-set evil-outer-text-objects-map evilnc-comment-text-object #'evilnc-outer-commenter)
  (general-def :states 'motion
    "gc" 'evilnc-comment-operator))

(use-package better-jumper
  :ensure t
  :after evil-collection
  :custom
  (better-jumper-context 'window)
  (better-jumper-new-window-behavior 'copy)
  (better-jumper-add-jump-behavior 'append)
  :config
  (better-jumper-mode)
  (general-def
    [remap evil-jump-backward] 'better-jumper-jump-backward
    [remap evil-jump-forward]  'better-jumper-jump-forward
    "<tab>" 'indent-for-tab-command))

(use-package evil-surround
  :ensure t
  :after evil
  :init (global-evil-surround-mode)
  :config
  (add-hook 'c++-ts-mode-hook
            (lambda ()
              (my/add-to-list 'evil-surround-pairs-alist
                              '((?< . ("< " . " >"))
                                (?> . ("<" . ">"))))))
  (add-hook 'org-mode-hook
            (lambda ()
              (my/add-to-list 'evil-surround-pairs-alist
                              '((?* . ("*" . "*"))
                                (?/ . ("/" . "/"))
                                (?_ . ("_" . "_"))
                                (?+ . ("+" . "+"))
                                (?= . ("=" . "="))
                                (?~ . ("~" . "~"))))))
  (add-hook 'emacs-lisp-mode-hook
            (lambda ()
              (push '(?` . ("`" . "'")) evil-surround-pairs-alist))))

(use-package evil-matchit
  :ensure t
  :after evil-collection
  :init (global-evil-matchit-mode))

(use-package evil-fringe-mark
  :ensure t
  :hook (after-init . global-evil-fringe-mark-mode)
  ;; :config
  ;; (setq left-fringe-width 16)
  )

(use-package vertico
  :ensure t
  :after better-defaults
  :custom
