home/dot_config/emacs-old/README.org
***** custom
:PROPERTIES:
:header-args: :noweb-ref vertico-custom
:END:

#+begin_src emacs-lisp
(vertico-count 14) ;; How many candidates to show.
(vertico-scroll-margin 2)
(vertico-cycle nil)
(vertico-resize 'grow-only) ;; Grow and shrink the Vertico minibuffer.
#+end_src

Hide commands in =M-x= menu which do not work in the current mode.
- Vertico commands are hidden in normal buffers.
- Corfu commands are hidden, since they are not supposed to be used via =M-x=.
#+begin_src emacs-lisp
(read-extended-command-predicate #'command-completion-default-include-p)
#+end_src

#+begin_src emacs-lisp
(enable-recursive-minibuffers t)
(minibuffer-depth-indicate-mode t)
#+end_src

#+begin_src emacs-lisp
(read-file-name-completion-ignore-case t)
(read-buffer-completion-ignore-case t)
(completion-ignore-case t)
#+end_src

***** config
:PROPERTIES:
:header-args: :noweb-ref vertico-config
:END:

Turn off ~ido-mode~ because [[*Emacs][better-defaults]] package turns it on.
#+begin_src emacs-lisp
(ido-mode -1)
(vertico-mode)
#+end_src

#+begin_src emacs-lisp
(defun my/crm-indicator (args)
  "Add prompt indicator to `completing-read-multiple'.
We display [CRM<separator>], e.g., [CRM,] if the separator is a comma."
  (cons (format "[CRM%s] %s"
                (replace-regexp-in-string "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'"
                                          ""
                                          crm-separator)
                (car args))
        (cdr args)))

(advice-add #'completing-read-multiple :filter-args #'my/crm-indicator)
#+end_src

Do not allow the cursor in the minibuffer prompt.
#+begin_src emacs-lisp
(setq minibuffer-prompt-properties '(read-only t
                                     cursor-intangible t
                                     face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
#+end_src

***** vertico-extensions
:PROPERTIES:
:header-args: :noweb-ref vertico-extensions
:END:
****** vertico-repeat
#+begin_src emacs-lisp
(use-package vertico-repeat
  :after vertico
  :config
  ;; (keymap-global-set "M-r" #'vertico-repeat)
  (add-hook 'minibuffer-setup-hook #'vertico-repeat-save))
#+end_src

****** vertico-directory
#+begin_src emacs-lisp
(use-package vertico-directory
  :after vertico
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src

****** COMMENT vertico-multiform
#+begin_src emacs-lisp
(use-package vertico-multiform
  :config
  (vertico-multiform-mode)
  (setq vertico-multiform-categories
        ;; '((file buffer grid)
        ;;   (imenu (:not indexed mouse))
        ;;   (symbol (vertico-sort-function . vertico-sort-alpha)))

        ;; ;; Configure the display per command.
        ;; ;; Use a buffer with indices for imenu
        ;; ;; and a flat (Ido-like) menu for M-x.
        ;; '((consult-imenu buffer indexed)
        ;;   (execute-extended-command unobtrusive))

        ;; Configure the display per completion category.
        ;; Use the grid display for files and a buffer
        ;; for the consult-grep commands.
        '((file grid)
          (consult-grep buffer))
        )
  )
#+end_src

**** consult
#+begin_src emacs-lisp :noweb yes
(use-package consult
  :ensure t
  :init
  (setq completion-in-region-function #'consult-completion-in-region)
  :config
  <<consult-config>>)
#+end_src
***** config
:PROPERTIES:
:header-args: :noweb-ref consult-config
:END:
****** yank fix
By default ~consult-yank-from-kill-ring~ not override region in visual mode, but
append to it. This advice fixes this.

#+begin_src emacs-lisp
(with-eval-after-load 'evil
 (defun my/kill-on-paste (str &optional arg)
   "Delete the region before inserting poped string."
   (when (eq evil-state 'visual)
     (kill-region (region-beginning) (region-end))))

 (advice-add 'consult-yank-from-kill-ring :before #'my/kill-on-paste))
#+end_src

****** COMMENT cunsult-xref
#+begin_src emacs-lisp
(setopt xref-show-definitions-function 'consult-xref
        xref-show-xrefs-function 'consult-xref)
#+end_src

**** consult-dir
#+begin_src emacs-lisp
(use-package consult-dir
  :ensure t
  :bind ("C-x C-d" . consult-dir))
#+end_src

**** marginalia
#+begin_src emacs-lisp
(use-package marginalia
  :ensure t
  :init (marginalia-mode))
#+end_src

**** COMMENT affe
#+begin_src emacs-lisp :noweb yes
(use-package affe
  :ensure t
  :config
  <<affe-config>>
  )
#+end_src
***** config
:PROPERTIES:
:header-args: :noweb-ref affe-config
:END:

- =-H=   :: Search hidden files.
- =-I=   :: Do not respect .gitignoew files.
- =-t f= :: Filter by type: file (f).
#+begin_src emacs-lisp
(setopt affe-find-command "fd -HI -t f")
#+end_src

#+begin_src emacs-lisp
(setopt affe-grep-command "rg --no-ignore-vcs --null --color=never --max-columns=1000 --no-heading --line-number -v ^$")
#+end_src

Manual preview key for =affe-grep=:
#+begin_src emacs-lisp
(consult-customize affe-grep :preview-key "M-.")
#+end_src

#+begin_src emacs-lisp
(defun affe-orderless-regexp-compiler (input _type _ignorecase)
  (setq input (orderless-pattern-compiler input))
  (cons input (apply-partially #'orderless--highlight input)))

(setq affe-regexp-compiler #'affe-orderless-regexp-compiler)
#+end_src

**** icons
***** COMMENT all-the-icons-completion
#+begin_src emacs-lisp
(use-package all-the-icons-completion
  :ensure t
  :demand t
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
  :config (all-the-icons-completion-mode))
#+end_src

***** nerd-icons-completion
#+begin_src emacs-lisp
(use-package nerd-icons-completion
  :ensure t
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup)
  :init (nerd-icons-completion-mode))
#+end_src

*** Text completion
**** corfu
#+begin_src emacs-lisp :noweb yes
(use-package corfu
  :ensure t
  :custom
  <<corfu-custom>>
  :config
  (global-corfu-mode)
  <<corfu-config>>)
#+end_src
***** custom
:PROPERTIES:
:header-args: :noweb-ref corfu-custom
:END:
****** Emacs variables related to completion

=TAB= cycle if there are only few candidates:
#+begin_src emacs-lisp
(completion-cycle-threshold 3)
#+end_src

Enable indentation + completion using the =TAB= key.
~completion-at-point~ is often bound to =M-TAB=.
#+begin_src emacs-lisp
(tab-always-indent 'complete)
(tab-first-completion nil)
#+end_src

****** Corfu custom variables
#+begin_src emacs-lisp
;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
(corfu-auto t)                 ;; Enable auto completion
(corfu-separator ?\s)          ;; Orderless field separator
(corfu-auto-prefix 3)
;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
;; (corfu-preview-current nil)    ;; Disable current candidate preview
;; (corfu-preselect 'prompt)      ;; Preselect the prompt
;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
;; (corfu-scroll-margin 5)        ;; Use scroll margin
#+end_src

***** config
:PROPERTIES:
:header-args: :noweb-ref corfu-config
:END:
****** Completing in the minibuffer for commands that doesn't use Vertico

Such as =:= (~evli-ex~), =M-:= (~eval-expression~) and =M-!= (~shell-command~).

Activate ~corfu-mode~ only if ~completion-at-point~ is bound in the ~minibuffer-local~
keymap.

#+begin_src emacs-lisp
(defun corfu-enable-in-minibuffer ()
  "Enable Corfu in the minibuffer if `completion-at-point' is bound."
  (when (where-is-internal #'completion-at-point
                           (list (current-local-map)))
    (setq-local corfu-auto t ;; Enable/disable auto completion
                corfu-echo-delay t ;; Disable automatic echo and popup
                corfu-auto-prefix 2
                corfu-popupinfo-delay nil)
    (corfu-mode)))

(add-hook 'minibuffer-setup-hook #'corfu-enable-in-minibuffer)
#+end_src

****** COMMENT Completing for every minibuffer, if no completion UI is active

First we check for Vertico. Then we ensure that Corfu is not enabled if a
password is read from the minibuffer.

#+begin_src emacs-lisp
(defun corfu-enable-always-in-minibuffer ()
  "Enable Corfu in the minibuffer if Vertico are not active."
  (unless (or (bound-and-true-p vertico--input)
              (eq (current-local-map) read-passwd-map))
    (setq-local corfu-auto t ;; Enable/disable auto completion
                corfu-echo-delay t ;; Disable automatic echo and popup
                corfu-auto-prefix 2
                corfu-popupinfo-delay nil)
    (corfu-mode)))

(add-hook 'minibuffer-setup-hook #'corfu-enable-always-in-minibuffer 1)
#+end_src

****** Move Corfu list to minibuffer
#+begin_src emacs-lisp
(defun corfu-move-to-minibuffer ()
  (interactive)
  (when completion-in-region--data
    (let ((completion-extra-properties corfu--extra)
          completion-cycle-threshold
          completion-cycling)
      (apply #'consult-completion-in-region completion-in-region--data))))

(keymap-set corfu-map "M-m" #'corfu-move-to-minibuffer)
(add-to-list 'corfu-continue-commands #'corfu-move-to-minibuffer)
#+end_src

***** corfu extensions
:PROPERTIES:
:header-args: :noweb-ref corfu-config
:END:

Remembers selected candidates and sorts the candidates by their history position.
#+begin_src emacs-lisp
(use-package corfu-history
  :config (corfu-history-mode))
#+end_src

Display candidate documentation or source in a popup next to the candidate menu.
#+begin_src emacs-lisp
(use-package corfu-popupinfo
  :custom (corfu-popupinfo-delay (cons 0.5 0.5))
  :config (corfu-popupinfo-mode))
#+end_src

Provides commands to show additional information to the candidates in a separate
buffer. In the [[elisp:(describe-keymap 'corfu-map)][corfu-map]] they are bound to:
- =M-g= (~corfu-info-location~)
- =M-h= (~corfu-info-documentation~)
#+begin_src emacs-lisp
(use-package corfu-info)
#+end_src

**** kind-icons
#+begin_src emacs-lisp
(use-package kind-icon
  :ensure t
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src

**** dabbrev
Use Dabbrev with Corfu.
#+begin_src emacs-lisp
(use-package dabbrev
  :custom
  (dabbrev-ignored-buffer-regexps '("\\.\\(?:pdf\\|jpe?g\\|png\\)\\'"))
  :config
  (general-def
    "M-/"   'dabbrev-completion
    "C-M-/" 'dabbrev-expand))
#+end_src

**** cape
#+begin_src emacs-lisp :noweb yes
(use-package cape
  :ensure t
  :config
  <<cape-config>>
  )
#+end_src
