home/dot_config/emacs/init.el
  (vertico-count 14) ;; How many candidates to show.
  (vertico-scroll-margin 2)
  (vertico-cycle nil)
  (vertico-resize 'grow-only) ;; Grow and shrink the Vertico minibuffer.
  (read-extended-command-predicate #'command-completion-default-include-p)
  (enable-recursive-minibuffers t)
  (minibuffer-depth-indicate-mode t)
  (read-file-name-completion-ignore-case t)
  (read-buffer-completion-ignore-case t)
  (completion-ignore-case t)
  :config
  (ido-mode -1)
  (vertico-mode)
  (defun my/crm-indicator (args)
    "Add prompt indicator to `completing-read-multiple'.
  We display [CRM<separator>], e.g., [CRM,] if the separator is a comma."
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'"
                                            ""
                                            crm-separator)
                  (car args))
          (cdr args)))
  
  (advice-add #'completing-read-multiple :filter-args #'my/crm-indicator)
  (setq minibuffer-prompt-properties '(read-only t
                                       cursor-intangible t
                                       face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  (use-package vertico-repeat
    :after vertico
    :config
    ;; (keymap-global-set "M-r" #'vertico-repeat)
    (add-hook 'minibuffer-setup-hook #'vertico-repeat-save))
  (use-package vertico-directory
    :after vertico
    ;; Tidy shadowed file names
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
  )

(use-package consult
  :ensure t
  :init
  (setq completion-in-region-function #'consult-completion-in-region)
  :config
  (with-eval-after-load 'evil
   (defun my/kill-on-paste (str &optional arg)
     "Delete the region before inserting poped string."
     (when (eq evil-state 'visual)
       (kill-region (region-beginning) (region-end))))
  
   (advice-add 'consult-yank-from-kill-ring :before #'my/kill-on-paste)))

(use-package consult-dir
  :ensure t
  :bind ("C-x C-d" . consult-dir))

(use-package marginalia
  :ensure t
  :init (marginalia-mode))

(use-package nerd-icons-completion
  :ensure t
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup)
  :init (nerd-icons-completion-mode))

(use-package corfu
  :ensure t
  :custom
  (completion-cycle-threshold 3)
  (tab-always-indent 'complete)
  (tab-first-completion nil)
  ;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ;; Enable auto completion
  (corfu-separator ?\s)          ;; Orderless field separator
  (corfu-auto-prefix 3)
  ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
  ;; (corfu-preview-current nil)    ;; Disable current candidate preview
  ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
  ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  ;; (corfu-scroll-margin 5)        ;; Use scroll margin
  :config
  (global-corfu-mode)
  (defun corfu-enable-in-minibuffer ()
    "Enable Corfu in the minibuffer if `completion-at-point' is bound."
    (when (where-is-internal #'completion-at-point
                             (list (current-local-map)))
      (setq-local corfu-auto t ;; Enable/disable auto completion
                  corfu-echo-delay t ;; Disable automatic echo and popup
                  corfu-auto-prefix 2
                  corfu-popupinfo-delay nil)
      (corfu-mode)))
  
  (add-hook 'minibuffer-setup-hook #'corfu-enable-in-minibuffer)
  (defun corfu-move-to-minibuffer ()
    (interactive)
    (when completion-in-region--data
      (let ((completion-extra-properties corfu--extra)
            completion-cycle-threshold
            completion-cycling)
        (apply #'consult-completion-in-region completion-in-region--data))))
  
  (keymap-set corfu-map "M-m" #'corfu-move-to-minibuffer)
  (add-to-list 'corfu-continue-commands #'corfu-move-to-minibuffer)
  (use-package corfu-history
    :config (corfu-history-mode))
  (use-package corfu-popupinfo
    :custom (corfu-popupinfo-delay (cons 0.5 0.5))
    :config (corfu-popupinfo-mode))
  (use-package corfu-info))

(use-package kind-icon
  :ensure t
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(use-package dabbrev
  :custom
  (dabbrev-ignored-buffer-regexps '("\\.\\(?:pdf\\|jpe?g\\|png\\)\\'"))
  :config
  (general-def
    "M-/"   'dabbrev-completion
    "C-M-/" 'dabbrev-expand))

(use-package cape
  :ensure t
  :config
