home/dot_config/emacs-old/README.org
***** config
:PROPERTIES:
:header-args: :noweb-ref cape-config
:END:

*NOTE:* The order matters!
#+begin_src emacs-lisp
(my/add-to-list 'completion-at-point-functions
                '(;; cape-line
                  ;; cape-symbol
                  ;; cape-dict
                  ;; cape-abbrev
                  ;; cape-rfc1345
                  ;; cape-sgml
                  cape-tex
                  cape-keyword
                  cape-history
                  ;; cape-elisp-block
                  cape-file
                  cape-dabbrev
                  ;; dabbrev-capf ; Emacs 29 built-in
                  ))
#+end_src

Invoke desired capfs manually. Alternative prefix keys: =C-c p=, =M-p=, =M-+=.
#+begin_src emacs-lisp
(general-def
  "C-c p p" 'completion-at-point ; capf
  "C-c p t" 'complete-tag        ; etags
  "C-c p d" 'cape-dabbrev        ; or dabbrev-completion
  "C-c p h" 'cape-history
  "C-c p f" 'cape-file
  "C-c p k" 'cape-keyword
  "C-c p s" 'cape-symbol
  "C-c p a" 'cape-abbrev
  "C-c p l" 'cape-line
  "C-c p w" 'cape-dict
  "C-c p \\" 'cape-tex
  "C-c p _" 'cape-tex
  "C-c p ^" 'cape-tex
  "C-c p &" 'cape-sgml
  "C-c p r" 'cape-rfc1345)
#+end_src

*** orderless
#+begin_src emacs-lisp :noweb yes
(use-package orderless
  :ensure t
  :config
  <<orderless-config>>
  )
#+end_src
**** config
:PROPERTIES:
:header-args: :noweb-ref orderless-config
:END:

#+begin_src emacs-lisp
(setq completion-styles '(orderless basic))
;; (setq completion-styles '(substring orderless))
;; (setq completion-styles '(flex)) ;; fuzzy search
#+end_src

#+begin_src emacs-lisp
(setq orderless-component-separator #'orderless-escapable-split-on-space)
#+end_src

#+begin_src emacs-lisp
(setq orderless-matching-styles '(orderless-initialism
                                  orderless-prefixes
                                  orderless-regexp))
#+end_src

Configure a custom style dispatcher (see the [[https://github.com/minad/consult/wiki][Consult wiki]])
#+begin_src emacs-lisp
;; (setq orderless-style-dispatchers '(+orderless-dispatch)
;;       orderless-component-separator #'orderless-escapable-split-on-space)
#+end_src

#+begin_src emacs-lisp
(setq completion-category-defaults nil)
#+end_src

~partial-completion~ for file path expansion. ~partial-completion~ is important for
file wildcard support. Multiple files can be opened at once with ~find-file~ if
you enter a wildcard.

#+begin_src emacs-lisp
(setq completion-category-overrides '((file (styles . (partial-completion)))))
#+end_src

***** COMMENT Fast prefix filtering with Orderless filtering

If you want to combine fast prefix filtering and Orderless filtering you can
still do that by defining a custom Orderless completion style via
~orderless-define-completion-style~. We use a custom style dispatcher, which
enables prefix filtering for input shorter than 4 characters. Note that such a
setup is quite advanced. Please refer to the Orderless documentation and source
code for further details.

#+begin_src emacs-lisp
(defun orderless-fast-dispatch (word index total)
  (and (= index 0) (= total 1) (length< word 4)
       `(orderless-regexp . ,(concat "^" (regexp-quote word)))))

(orderless-define-completion-style orderless-fast
  (orderless-style-dispatchers '(orderless-fast-dispatch))
  (orderless-matching-styles '(orderless-literal orderless-regexp)))

(setq-local corfu-auto t
            corfu-auto-delay 0
            corfu-auto-prefix 0
            completion-styles '(orderless-fast))
#+end_src

** Text editing
#+begin_src emacs-lisp
(setopt fill-column 80
        comment-empty-lines t
        require-final-newline 'visit-save
        sentence-end-double-space nil)
#+end_src

*** Automatic parens pairing
#+begin_src emacs-lisp
(electric-pair-mode)
#+end_src

Make =electric-pair= mode not to complete ~<>~ pair when ~<~ char entered in org mode.
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
          (lambda ()
            (setq-local electric-pair-inhibit-predicate
                        (lambda (c)
                          (if (char-equal c ?<)
                              t
                            (electric-pair-default-inhibit c))))))
#+end_src

*** Delete selection by typing
This is necessary for the replacement of selected text with the
~consult-yank-from-kill-ring~ function to work.

#+begin_src emacs-lisp
(delete-selection-mode)
#+end_src

*** flyspell
**** flyspell
#+begin_src emacs-lisp
(use-package flyspell
  :custom
  (flyspell-issue-message-flag nil))
#+end_src

**** flyspell-correct
Spell check

#+begin_src emacs-lisp
(use-package flyspell-correct
  :ensure t
  ;; :hook ((markdown-mode . flyspell-mode)
  ;;        (org-mode . flyspell-mode)
  ;;        (text-mode . flyspell-mode))
  )
#+end_src

**** flyspell-correct-popup
#+begin_src emacs-lisp
(use-package flyspell-correct-popup
  :ensure t
  :after flyspell-correct)
#+end_src

*** hide-show-mode
#+begin_src emacs-lisp
(setopt hs-hide-comments-when-hiding-all nil)
#+end_src

*** fill-paragraph
#+begin_src emacs-lisp
;; Don’t break after the first word of a sentence or before the last
(add-hook 'fill-nobreak-predicate #'fill-single-word-nobreak-p)

;; Don’t break after a one-letter word preceded by a whitespace character
(add-hook 'fill-nobreak-predicate #'fill-single-char-nobreak-p)
#+end_src

**** COMMENT unpackaged/flex-fill-paragraph
- [[https://github.com/alphapapa/unpackaged.el#flexibly-fillunfill-paragraphs][Source]]

#+begin_src emacs-lisp
(defvar unpackaged/flex-fill-paragraph-column nil
  "Last fill column used in command `unpackaged/flex-fill-paragraph'.")

;;;###autoload
(defun unpackaged/flex-fill-paragraph (&optional fewer-lines unfill)
  "Fill paragraph, incrementing fill column to cause a change when repeated.
The global value of `fill-column' is not modified; it is only
bound around calls to `fill-paragraph'.

When called for the first time in a sequence, unfill to the
default `fill-column'.

When called repeatedly, increase `fill-column' until filling
changes.

With one universal prefix, increase `fill-column' until the
number of lines is reduced.  With two, unfill completely."
  (interactive "P")
  (let* ((fewer-lines (or fewer-lines (equal current-prefix-arg '(4))))
         (unfill (or unfill (equal current-prefix-arg '(16))))
         (fill-column
          (cond (unfill (setf unpackaged/flex-fill-paragraph-column nil)
                        most-positive-fixnum)
                (t (setf unpackaged/flex-fill-paragraph-column
                         (if (equal last-command this-command)
                             (or (unpackaged/flex-fill-paragraph--next-fill-column fewer-lines)
                                 fill-column)
                           fill-column))))))
    (fill-paragraph)
    (message "Fill column: %s" fill-column)))

(defun unpackaged/flex-fill-paragraph--next-fill-column (&optional fewer-lines)
  "Return next `fill-column' value.
If FEWER-LINES is non-nil, reduce the number of lines in the
buffer, otherwise just change the current paragraph."
  ;; This works well, but because of all the temp buffers, sometimes when called
  ;; in rapid succession, it can cause GC, which can be noticeable.  It would be
  ;; nice to avoid that.  Note that this has primarily been tested on
  ;; `emacs-lisp-mode'; hopefully it works well in other modes.
  (let* ((point (point))
         (source-buffer (current-buffer))
         (mode major-mode)
         (fill-column (or unpackaged/flex-fill-paragraph-column fill-column))
         (old-fill-column fill-column)
         (hash (unless fewer-lines
                 (buffer-hash)))
         (original-num-lines (when fewer-lines
                               (line-number-at-pos (point-max)))))
    (with-temp-buffer
      (delay-mode-hooks
        (funcall mode))
      (setq-local fill-column old-fill-column)
      (insert-buffer-substring source-buffer)
      (goto-char point)
      (cl-loop while (fill-paragraph)
               ;; If filling doesn't change after 100 iterations, abort by returning nil.
               if (> (- fill-column old-fill-column) 100)
               return nil
               else do (cl-incf fill-column)
               while (if fewer-lines
                         (= original-num-lines (line-number-at-pos (point-max)))
                       (string= hash (buffer-hash)))
               finally return fill-column))))
#+end_src

**** COMMENT far-fill-paragraph

Provides ~far-fill-paragraph~ function which fills the paragraph at the point.
#+begin_src emacs-lisp
(use-package far
  :vc (:fetcher github :repo "eshrh/far.el"))
#+end_src

*** COMMENT indent-relative region

#+begin_src emacs-lisp
(save-excursion)

(progn
  (back-to-indentation)
  (indent-relative))

(foreach-in-region)

(when (use-region-p))
(region-beginning)
(region-end)

(defun do-lines (fun &optional start end)
  "Invoke function FUN on the text of each line from START to END."
  ;; (interactive
  ;;  (let ((fn  (intern (completing-read "Function: " obarray 'functionp t))))
  ;;    (if (use-region-p)
  ;;        (list fn (region-beginning) (region-end))
  ;;      (list fn (point-min) (point-max)))))
  (save-excursion
    (goto-char start)
    (while (< (point) end)
      (funcall fun (buffer-substring (line-beginning-position) (line-end-position)))
      (forward-line 1))))
#+end_src

*** ws-butler
#+begin_src emacs-lisp
(use-package ws-butler
  :ensure t
  :config
  (ws-butler-global-mode))
#+end_src

