home/dot_config/emacs/init.el
  (my/add-to-list 'completion-at-point-functions
                  '(;; cape-line
                    ;; cape-symbol
                    ;; cape-dict
                    ;; cape-abbrev
                    ;; cape-rfc1345
                    ;; cape-sgml
                    cape-tex
                    cape-keyword
                    cape-history
                    ;; cape-elisp-block
                    cape-file
                    cape-dabbrev
                    ;; dabbrev-capf ; Emacs 29 built-in
                    ))
  (general-def
    "C-c p p" 'completion-at-point ; capf
    "C-c p t" 'complete-tag        ; etags
    "C-c p d" 'cape-dabbrev        ; or dabbrev-completion
    "C-c p h" 'cape-history
    "C-c p f" 'cape-file
    "C-c p k" 'cape-keyword
    "C-c p s" 'cape-symbol
    "C-c p a" 'cape-abbrev
    "C-c p l" 'cape-line
    "C-c p w" 'cape-dict
    "C-c p \\" 'cape-tex
    "C-c p _" 'cape-tex
    "C-c p ^" 'cape-tex
    "C-c p &" 'cape-sgml
    "C-c p r" 'cape-rfc1345)
  )

(use-package orderless
  :ensure t
  :config
  (setq completion-styles '(orderless basic))
  ;; (setq completion-styles '(substring orderless))
  ;; (setq completion-styles '(flex)) ;; fuzzy search
  (setq orderless-component-separator #'orderless-escapable-split-on-space)
  (setq orderless-matching-styles '(orderless-initialism
                                    orderless-prefixes
                                    orderless-regexp))
  ;; (setq orderless-style-dispatchers '(+orderless-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-category-defaults nil)
  (setq completion-category-overrides '((file (styles . (partial-completion)))))
  )

(setopt fill-column 80
        comment-empty-lines t
        require-final-newline 'visit-save
        sentence-end-double-space nil)

(electric-pair-mode)

(add-hook 'org-mode-hook
          (lambda ()
            (setq-local electric-pair-inhibit-predicate
                        (lambda (c)
                          (if (char-equal c ?<)
                              t
                            (electric-pair-default-inhibit c))))))

(delete-selection-mode)

(use-package flyspell
  :custom
  (flyspell-issue-message-flag nil))

(use-package flyspell-correct
  :ensure t
  ;; :hook ((markdown-mode . flyspell-mode)
  ;;        (org-mode . flyspell-mode)
  ;;        (text-mode . flyspell-mode))
  )

(use-package flyspell-correct-popup
  :ensure t
  :after flyspell-correct)

(setopt hs-hide-comments-when-hiding-all nil)

;; Don’t break after the first word of a sentence or before the last
(add-hook 'fill-nobreak-predicate #'fill-single-word-nobreak-p)

;; Don’t break after a one-letter word preceded by a whitespace character
(add-hook 'fill-nobreak-predicate #'fill-single-char-nobreak-p)

(use-package ws-butler
  :ensure t
  :config
  (ws-butler-global-mode))
