home/dot_config/emacs-old/README.org
*** par
- [[https://emacs.stackexchange.com/questions/26361/how-can-i-use-par-as-my-paragraph-formatter][Source]]

#+begin_src emacs-lisp
(when (executable-find "par")
  (defun my/par-fill-region (begin end par-option)
    "Use `par' executable to fill region between BEGIN and END.

- With C-u also justify the text.
- With C-u C-u try to make all lines of almost equal lengths instead
  of justifying.

If PAR-OPTION is \\='(4) `\\[universal-argument]', also justify the text.
If PAR-OPTION is \\='(16) `\\[universal-argument] \\[universal-argument]', try to
make all lines of almost equal lengths instead of justifying.

See `man par' for more information."
    (interactive "r\nP")
    (let* ((width-str (number-to-string fill-column))
           (err-buf "*par Error*")
           (par-cmd
            (concat "par "
                    "w" width-str " " ; set fill width
                    ;; Body characters: . , ? upper-case lower-case
                    (shell-quote-argument "B=.,?_A_a") " "
                    ;; Quote characters: space > | <comment-start char>
                    (shell-quote-argument
                     (concat "Q=_s>|" (when comment-start comment-start))) " "
                    ;; Allow bodiless characters like *, space, .. to inc/dec by
                    ;; up to 10 characters to adjust line width.
                    "r10"
                    "T4" ; Expand tab chars to 4 spaces
                    ;; Prefixes may not contain any trailing body characters, and
                    ;; suffixes may not contain any leading body characters
                    "b"
                    "h2"
                    "e1" ; Expel/remove superfluous lines
                    (when (equal '(16) par-option)
                      "f") ; Try to make all lines of nearly the same length
                    "g" ; Make a better guess at inserting line breaks
                    (when (equal '(4) par-option)
                      "j") ; Justify the lines by inserting spaces between words
                    "q" ; Insert blank lines before/after quoted text
                    "R" ; Throw an error if a word length exceeds the fill width
                    "E" ; Send error to stderr instead of stdout
                    ))
           (before-text (buffer-substring-no-properties begin end))
           par-ret
           ;; Do the formatting in a temp buffer so that the text in the original
           ;; buffer doesn't get corrupted in case `par' fails due to some error.
           (after-text (with-temp-buffer
                         (insert before-text)
                         (setq par-ret (shell-command-on-region
                                        (point-min) (point-max)
                                        par-cmd nil :replace
                                        err-buf :display-error-buffer))
                         (buffer-substring-no-properties (point-min) (point-max)))))
      ;; If 1 is returned, error occurred in the cmd execution; 0 - no error
      (if (= 1 par-ret)
          (progn
            ;; Switch to the error buffer
            (switch-to-buffer-other-window err-buf)
            (special-mode)) ; Set this mode so that you can quit it quickly using C-u q
        ;; If no error occurred, do below in the original buffer
        (delete-region begin end)
        (insert after-text))
      (message "Executed `%s' on the region" par-cmd))))
#+end_src

** IDE
*** Indentation
Do not reindet the previous line on insert newline.
#+begin_src emacs-lisp
(setq-default electric-indent-inhibit t)
#+end_src

**** Automaticaly guess indentation level
#+begin_src emacs-lisp
(use-package dtrt-indent
  :ensure t
  :hook
  ((c-mode c++-mode c-ts-mode c++-ts-mode) . dtrt-indent-mode)
  ;; :config
  ;; (dtrt-indent-global-mode)
  )
#+end_src

*** Colors in compilers output

Convert ansi-colors to emacs faces in compiliers output.
#+begin_src emacs-lisp
(use-package ansi-color
  :custom (ansi-color-for-compilation-mode t)
  :hook (compilation-filter . ansi-color-compilation-filter))
#+end_src

*** project.el
#+begin_src emacs-lisp
(setq project-vc-extra-root-markers
      '(".projectile" ".project"))
#+end_src

*** Projectile
#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :custom
  (projectile-auto-discover t)
  (projectile-project-search-path '("~"))
  :init (projectile-mode))
#+end_src

**** consult-projectile
#+begin_src emacs-lisp
(use-package consult-projectile
  :ensure t
  :after projectile
  :bind (([remap projectile-switch-to-buffer] . consult-projectile-switch-to-buffer)
         ([remap projectile-find-dir] . consult-projectile-find-dir)
         ([remap projectile-find-file] . consult-projectile-find-file)
         ([remap projectile-recentf] . consult-projectile-recentf)
         ;; ([remap projectile-switch-project] . consult-projectile-switch-project)
         ([remap projectile-switch-project] . consult-projectile)))

;; The multiview includes initially buffers, files and known projects.  To include
;; recent files and directires add `consult-projectile--source-projectile-dir' and/or
;; `consult-projectile--source-projectile-recentf' to `consult-projectile-sources'.
#+end_src

*** LSP
**** COMMENT lsp-mode
***** lsp-mode
#+begin_src emacs-lisp :noweb yes
(use-package lsp-mode
  :ensure t
  ;; :commands lsp
  :custom
  (lsp-idle-delay 0.5)
  (lsp-completion-provider :none) ; I use Corfu
  ;; (lsp-headerline-breadcrumb-enable-diagnostics nil)
  ;; (lsp-headerline-breadcrumb-icons-enable t)
  ;; (lsp-diagnostics-provider :flycheck)
  (lsp-eldoc-render-all t) ;; Show all documenttion
  (lsp-eldoc-enable-hover nil)
  :hook
  ;; ((c-mode c++-mode c-ts-mode c++-ts-mode) . lsp)
  ((c-mode c++-mode c-ts-mode c++-ts-mode) . lsp-deferred)
  :config
  <<lsp-mode-config>>
  )
#+end_src

****** config
:PROPERTIES:
:header-args: :noweb-ref lsp-mode-config
:END:

#+begin_src emacs-lisp
(add-hook 'lsp-mode  #'lsp-enable-which-key-integration)
#+end_src

#+begin_src emacs-lisp
(add-hook 'lsp-completion-mode
          (lambda ()
            (setf (->> completion-category-defaults
                       (alist-get 'lsp-capf)
                       (alist-get 'styles))
                  '(orderless))))
#+end_src

#+begin_src emacs-lisp
;; (add-hook 'lsp-after-initialize-hook)
#+end_src

***** lsp-ui
#+begin_src emacs-lisp
(use-package lsp-ui
  :ensure t
  ;; :commands lsp-ui-mode
  :hook (lsp-mode . lsp-ui-mode)
  ;; :custom
  ;; (lsp-ui-doc-enable nil)
  ;; (lsp-ui-doc-delay 0.5)
  ;; (lsp-ui-doc-position 'bottom)
  :config
  (general-def :keymaps 'lsp-ui-mode-map
    [remap xref-find-definitions] 'lsp-ui-peek-find-definitions
    [remap xref-find-references]  'lsp-ui-peek-find-references)
  )
#+end_src

***** COMMENT lsp-treemacs
#+begin_src emacs-lisp
(use-package lsp-treemacs
  :ensure t
  :commands lsp-treemacs-errors-list)
#+end_src

***** consult-lsp
#+begin_src emacs-lisp
(use-package consult-lsp
  :ensure t
  :after (consult lsp-mode))
#+end_src

***** eldoc-box
Show eldoc content in the floating frame.

#+begin_src emacs-lisp
(use-package eldoc-box
  :ensure t
  :autoload (eldoc-box--replace-en-space
             eldoc-box--prettify-markdown-separator
             eldoc-box--remove-linked-images
             eldoc-box--remove-noise-chars
             eldoc-box--fontify-html
             eldoc-box--condense-large-newline-gaps)
  :config
  (my/add-to-list 'eldoc-box-self-insert-command-list
                  '(evil-force-normal-state)))
#+end_src

***** COMMENT lsp-pyright
#+begin_src emacs-lisp
(use-package lsp-pyright
  :ensure t
  :hook
  (python-mode . (lambda ()
                   (require 'lsp-pyright)
                   (lsp)))) ;; or lsp-deferred
#+end_src

***** COMMENT dap-mode
#+begin_src emacs-lisp
(use-package dap-mode :ensure t)
(use-package dap-python :ensure t)
#+end_src

**** eglot
In case you have some problem with eglot, first update it to the last version
with ~eglot-upgrade-eglot~.

***** eglot
#+begin_src emacs-lisp :noweb yes
(use-package eglot
  :hook
  ((;; c-mode c++-mode
    c-ts-mode c++-ts-mode
    cmake-mode cmake-ts-mode) . eglot-ensure)
  :custom
  (eglot-autoshutdown t)
  (eglot-extend-to-xref t)
  (eglot-events-buffer-size 0) ; Don't use event's buffer.
  (eglot-report-progress t)
  (eglot-send-changes-idle-time 1.2)
  (eglot-ignored-server-capabilities '(:documentOnTypeFormattingProvider))
  :config
  <<eglot-config>>
  )
#+end_src
****** config
:PROPERTIES:
:header-args: :noweb-ref eglot-config
:END:

#+begin_src emacs-lisp
(defun my/eglot-managed-buffer-setup ()
  (if (eglot-managed-p)
      (progn
        (setq-local eldoc-idle-delay 0.5
                    eldoc-echo-area-use-multiline-p t
                    flymake-no-changes-timeout 0.5)
        (use-local-map eglot-mode-map))
    ;; Eglot stops managing buffer
    (mapc #'kill-local-variable '(eldoc-idle-delay
                                  eldoc-echo-area-use-multiline-p
                                  flymake-no-changes-timeout))))

(add-hook 'eglot-managed-mode-hook #'my/eglot-managed-buffer-setup)
#+end_src

#+begin_src emacs-lisp
;; (add-to-list 'eglot-stay-out-of 'eldoc)
#+end_src

******* Make a Cape super Capf
- [[https://github.com/minad/corfu/wiki#making-a-cape-super-capf-for-eglot][source]]

#+begin_src emacs-lisp
(defun my/eglot-capf ()
  (setq-local completion-at-point-functions '(#'cape-capf-super
                                              #'eglot-completion-at-point
                                              ;; #'tempel-expand
                                              #'cape-file)))

(add-hook 'eglot-managed-mode-hook #'my/eglot-capf)
#+end_src

