home/dot_config/emacs/init.el

(when (executable-find "par")
  (defun my/par-fill-region (begin end par-option)
    "Use `par' executable to fill region between BEGIN and END.

- With C-u also justify the text.
- With C-u C-u try to make all lines of almost equal lengths instead
  of justifying.

If PAR-OPTION is \\='(4) `\\[universal-argument]', also justify the text.
If PAR-OPTION is \\='(16) `\\[universal-argument] \\[universal-argument]', try to
make all lines of almost equal lengths instead of justifying.

See `man par' for more information."
    (interactive "r\nP")
    (let* ((width-str (number-to-string fill-column))
           (err-buf "*par Error*")
           (par-cmd
            (concat "par "
                    "w" width-str " " ; set fill width
                    ;; Body characters: . , ? upper-case lower-case
                    (shell-quote-argument "B=.,?_A_a") " "
                    ;; Quote characters: space > | <comment-start char>
                    (shell-quote-argument
                     (concat "Q=_s>|" (when comment-start comment-start))) " "
                    ;; Allow bodiless characters like *, space, .. to inc/dec by
                    ;; up to 10 characters to adjust line width.
                    "r10"
                    "T4" ; Expand tab chars to 4 spaces
                    ;; Prefixes may not contain any trailing body characters, and
                    ;; suffixes may not contain any leading body characters
                    "b"
                    "h2"
                    "e1" ; Expel/remove superfluous lines
                    (when (equal '(16) par-option)
                      "f") ; Try to make all lines of nearly the same length
                    "g" ; Make a better guess at inserting line breaks
                    (when (equal '(4) par-option)
                      "j") ; Justify the lines by inserting spaces between words
                    "q" ; Insert blank lines before/after quoted text
                    "R" ; Throw an error if a word length exceeds the fill width
                    "E" ; Send error to stderr instead of stdout
                    ))
           (before-text (buffer-substring-no-properties begin end))
           par-ret
           ;; Do the formatting in a temp buffer so that the text in the original
           ;; buffer doesn't get corrupted in case `par' fails due to some error.
           (after-text (with-temp-buffer
                         (insert before-text)
                         (setq par-ret (shell-command-on-region
                                        (point-min) (point-max)
                                        par-cmd nil :replace
                                        err-buf :display-error-buffer))
                         (buffer-substring-no-properties (point-min) (point-max)))))
      ;; If 1 is returned, error occurred in the cmd execution; 0 - no error
      (if (= 1 par-ret)
          (progn
            ;; Switch to the error buffer
            (switch-to-buffer-other-window err-buf)
            (special-mode)) ; Set this mode so that you can quit it quickly using C-u q
        ;; If no error occurred, do below in the original buffer
        (delete-region begin end)
        (insert after-text))
      (message "Executed `%s' on the region" par-cmd))))

(setq-default electric-indent-inhibit t)

(use-package dtrt-indent
  :ensure t
  :hook
  ((c-mode c++-mode c-ts-mode c++-ts-mode) . dtrt-indent-mode)
  ;; :config
  ;; (dtrt-indent-global-mode)
  )

(use-package ansi-color
  :custom (ansi-color-for-compilation-mode t)
  :hook (compilation-filter . ansi-color-compilation-filter))

(setq project-vc-extra-root-markers
      '(".projectile" ".project"))

(use-package projectile
  :ensure t
  :custom
  (projectile-auto-discover t)
  (projectile-project-search-path '("~"))
  :init (projectile-mode))

(use-package consult-projectile
  :ensure t
  :after projectile
  :bind (([remap projectile-switch-to-buffer] . consult-projectile-switch-to-buffer)
         ([remap projectile-find-dir] . consult-projectile-find-dir)
         ([remap projectile-find-file] . consult-projectile-find-file)
         ([remap projectile-recentf] . consult-projectile-recentf)
         ;; ([remap projectile-switch-project] . consult-projectile-switch-project)
         ([remap projectile-switch-project] . consult-projectile)))

;; The multiview includes initially buffers, files and known projects.  To include
;; recent files and directires add `consult-projectile--source-projectile-dir' and/or
;; `consult-projectile--source-projectile-recentf' to `consult-projectile-sources'.

(use-package eglot
  :hook
  ((;; c-mode c++-mode
    c-ts-mode c++-ts-mode
    cmake-mode cmake-ts-mode) . eglot-ensure)
  :custom
  (eglot-autoshutdown t)
  (eglot-extend-to-xref t)
  (eglot-events-buffer-size 0) ; Don't use event's buffer.
  (eglot-report-progress t)
  (eglot-send-changes-idle-time 1.2)
  (eglot-ignored-server-capabilities '(:documentOnTypeFormattingProvider))
  :config
  (defun my/eglot-managed-buffer-setup ()
    (if (eglot-managed-p)
        (progn
          (setq-local eldoc-idle-delay 0.5
                      eldoc-echo-area-use-multiline-p t
                      flymake-no-changes-timeout 0.5)
          (use-local-map eglot-mode-map))
      ;; Eglot stops managing buffer
      (mapc #'kill-local-variable '(eldoc-idle-delay
                                    eldoc-echo-area-use-multiline-p
                                    flymake-no-changes-timeout))))
  
  (add-hook 'eglot-managed-mode-hook #'my/eglot-managed-buffer-setup)
  ;; (add-to-list 'eglot-stay-out-of 'eldoc)
  (defun my/eglot-capf ()
    (setq-local completion-at-point-functions '(#'cape-capf-super
                                                #'eglot-completion-at-point
                                                ;; #'tempel-expand
                                                #'cape-file)))
  
  (add-hook 'eglot-managed-mode-hook #'my/eglot-capf)
