home/dot_config/emacs-old/README.org
******* COMMENT Cape integration
- [[https://github.com/minad/corfu/wiki#configuring-corfu-for-eglot][source]]

*BUG:* I disable this config because it breakes completion for C++ with clangd! ([[https://github.com/minad/corfu/discussions/400][source]])

#+begin_src emacs-lisp
(with-eval-after-load 'cape
  (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster))
#+end_src

******* Documentatin window configs
#+begin_src emacs-lisp
(define-advice eldoc-doc-buffer (:after (_) prettify-eldoc-buffer)
  (with-current-buffer eldoc--doc-buffer
    (setq-local fill-column 90)
    (visual-line-mode)
    (virtual-auto-fill-mode)
    ;; (eldoc-box--prettify-markdown-separator)
    (eldoc-box--replace-en-space)
    ;; (eldoc-box--remove-linked-images)
    ;; (eldoc-box--remove-noise-chars)
    ;; (eldoc-box--fontify-html)
    ;; (eldoc-box--condense-large-newline-gaps)
    ))
#+end_src

******* LSP-servers config
******** COMMENT emacs-lsp-booster
- [[https://github.com/blahgeek/emacs-lsp-booster][Source]]
********* eglot-booster
- [[https://github.com/jdtsmith/eglot-booster][Source]]
#+begin_src emacs-lisp
(use-package eglot-booster
  :vc (:fetcher github :repo "jdtsmith/eglot-booster")
  :after eglot
  :config
  (eglot-booster-mode))
#+end_src

******** clangd settings
#+begin_src emacs-lisp
(add-to-list 'eglot-server-programs
             '((c++-mode c++-ts-mode)
               . (;; "emacs-lsp-booster" ;; in case I start to use emacs-lsp-booster
                  "clangd"
                  "--compile-commands-dir=debug"
                  "--background-index"
                  "--suggest-missing-includes"
                  "--pch-storage=memory"

                  ;; bounded  :: Similar completion items (e.g. function overloads) are
                  ;;             combined.  Type information shown where possible.
                  ;; detailed :: One completion item for each semantically distinct
                  ;;             completion, with full type information.
                  "--completion-style=bundled")))
#+end_src

******** COMMENT ccls settings
#+begin_src emacs-lisp
(dolist (mode '(c++-mode c++-ts-mode))
  (add-to-list 'eglot-server-programs
               `(,mode . ("ccls"))))
#+end_src

******** neocmakelsp (cmake)
#+begin_src emacs-lisp
(dolist (mode '(cmake-mode cmake-ts-mode))
  (add-to-list 'eglot-server-programs
               `(,mode . ("neocmakelsp" "--stdio"))))
#+end_src

******* COMMENT Disable eglot lsp-server communicating buffer
- [[https://www.reddit.com/r/emacs/comments/1447fy2/comment/jnev6ca/?utm_source=share&utm_medium=web2x&context=3][Source]]

The events buffer is enabled by default, and slow down the performance.
It contains all the communications between eglot and the lsp server (some are
very chatty), and it's also pretty-printed. Turn it off:

#+begin_src emacs-lisp
(fset #'jsonrpc--log-event #'ignore)
#+end_src

***** eldoc-box
Show eldoc content in the floating frame.

#+begin_src emacs-lisp
(use-package eldoc-box
  :ensure t
  :autoload (eldoc-box--replace-en-space
             eldoc-box--prettify-markdown-separator
             eldoc-box--remove-linked-images
             eldoc-box--remove-noise-chars
             eldoc-box--fontify-html
             eldoc-box--condense-large-newline-gaps)
  :after eglot
  :config
  (my/add-to-list 'eldoc-box-self-insert-command-list
                  '(evil-force-normal-state)))
#+end_src

***** COMMENT eldoc-overlay
#+begin_src emacs-lisp
(use-package eldoc-overlay
  :ensure t)
#+end_src

***** flymake
#+begin_src emacs-lisp
(setopt
 flymake-start-on-save-buffer t)
#+end_src

#+begin_src emacs-lisp
(dolist (hook '(flymake-diagnostics-buffer-mode-hook
                flymake-project-diagnostics-mode-hook))
  (add-hook hook #'hl-line-mode))
#+end_src

****** COMMENT flymake-diagnostic-at-point
#+begin_src emacs-lisp
(use-package flymake-diagnostic-at-point
  :ensure t
  :hook (flymake-mode . flymake-diagnostic-at-point-mode))
#+end_src

***** consult-eglot
This package provides a single command ~consult-eglot-symbols~ that query
workspace symbol from eglot using consult.

#+begin_src emacs-lisp
(use-package consult-eglot
  :ensure t
  :after eglot)
#+end_src

***** COMMENT flycheck-eglot
#+begin_src emacs-lisp
(use-package flycheck-eglot
  :ensure t
  :after (flycheck eglot)
  :config
  (global-flycheck-eglot-mode))
#+end_src

***** breadcrumb
#+begin_src emacs-lisp
(use-package breadcrumb
  :ensure t
  :hook
  ((c-mode c++-mode c-ts-mode c++-ts-mode) . breadcrumb-local-mode))
#+end_src

**** xref
#+begin_src emacs-lisp
(setopt xref-auto-jump-to-first-definition 'show)
#+end_src

**** COMMENT flycheck
***** flycheck
#+begin_src emacs-lisp
(use-package flycheck
  :ensure t
  :custom
  (flycheck-display-errors-function #'flycheck-display-error-messages-unless-error-list)
  ;; (flycheck-indication-mode nil)
  :config
  (global-flycheck-mode))
#+end_src

***** flycheck-inline
#+begin_src emacs-lisp
(use-package flycheck-inline
  :ensure t
  :hook (flycheck-mode . flycheck-inline-mode))
#+end_src

***** COMMENT flycheck-pos-tip
#+begin_src emacs-lisp
(use-package flycheck-pos-tip
  :ensure t
  :after flycheck
  :config
  (flycheck-pos-tip-mode))
#+end_src

*** Snippets
**** COMMENT tempel
#+begin_src emacs-lisp
;; Templates that can be used as 'capf'
(use-package tempel
  :after corfu
  :init
  (defun tempel-setup-capf ()
    ;; Add the Tempel Capf to `completion-at-point-functions'.
    ;; `tempel-expand' only triggers on exact matches. Alternatively use
    ;; `tempel-complete' if you want to see all matches, but then you
    ;; should also configure `tempel-trigger-prefix', such that Tempel
    ;; does not trigger too often when you don't expect it. NOTE: We add
    ;; `tempel-expand' *before* the main programming mode Capf, such
    ;; that it will be tried first.
    (setq-local completion-at-point-functions
                (#'tempel-expand . completion-at-point-functions)))
  :hook
  (prog-mode text-mode) . tempel-setup-capf)
#+end_src

*** Structural editing
**** [[*evil-cleverparens][evil-cleverparens]]
**** COMMENT symex
- [[https://github.com/drym-org/symex.el?tab=readme-ov-file&utm_source=pocket_saves][Source]]
#+begin_src emacs-lisp
(use-package symex
  :ensure t
  :custom
  (symex-modal-backend 'evil)
  :config
  ;; (dolist (mode '(lisp-mode emacs-lisp-mode))
  ;;   (let ((hook (intern (concat (symbol-name mode) "-hook"))))
  ;;     (add-hook hook (lambda ()
  ;;                      ;; (general-def :keymaps 'local :states 'normal
  ;;                      ;;   "\\" 'symex-mode-interface)
  ;;                      (general-def :keymaps 'local :states 'normal
  ;;                        "<escape>" 'symex-mode-interface)
  ;;                      (general-def :keymaps 'local :states 'insert
  ;;                        "<escape>" 'symex-mode-interface)))))
  (add-hook 'lisp-data-mode-hook
            (lambda ()
              ;; (general-def :keymaps 'local :states 'normal
              ;;   "\\" 'symex-mode-interface)
              (general-def :keymaps 'local :states 'normal
                "<escape>" 'symex-mode-interface)
              (general-def :keymaps 'local :states 'insert
                "<escape>" 'symex-mode-interface)))
  ;; Should be set before invoking `symex-initialize'.
  (setq symex--user-evil-keyspec
        '(("j" . symex-go-up)
          ("k" . symex-go-down)))
  (symex-initialize))
#+end_src

**** COMMENT puni
#+begin_src emacs-lisp
(use-package puni
  :ensure t
  :defer t
  :hook (term-mode . puni-disable-puni-mode)
  :init
  ;; The autoloads of Puni are set up so you can enable `puni-mode` or
  ;; `puni-global-mode` before `puni` is actually loaded. Only after you press
  ;; any key that calls Puni commands, it's loaded.
  (puni-global-mode))
#+end_src

**** COMMENT lispy
#+begin_src emacs-lisp
(use-package lispy
  :ensure t
  :custom
  (lispy-safe-delete t)
  (lispy-safe-copy t)
  (lispy-safe-paste t)
  :hook (emacs-lisp-mode . lispy-mode))
#+end_src

**** COMMENT lispyville
#+begin_src emacs-lisp :noweb yes
(use-package lispyville
  :ensure t
  :after general
  :hook (lispy-mode . my/lispyville-mode)
  :config
  <<lispyville-config>>)
#+end_src
***** config
:PROPERTIES:
:header-args: :noweb-ref lispyville-config
:END:

#+begin_src emacs-lisp
(lispyville-set-key-theme
 '(operators c-w c-u prettify additional-motions additional wrap))
#+end_src

#+begin_src emacs-lisp
(defun my/lispyville-mode ()
  (lispyville-mode)
  (general-def :keymaps 'local :states 'normal
    "(" 'lispyville-backward-up-list
    "g c" 'lispyville-comment-or-uncomment
    "[ SPC" 'evil-collection-unimpaired-insert-newline-above
    "] SPC" 'evil-collection-unimpaired-insert-newline-below)
  (general-def :keymaps 'local :states '(motion normal visual)
    ";" '(:keymap semicolon-leader-map)
    ;; ";" '(:keymap evilem-map)
    )
  (general-def :keymaps 'local :states 'visual
    "g c" 'lispyville-comment-or-uncomment))
#+end_src

*** COMMENT Auto close =*compilation*= buffer if success
#+begin_src emacs-lisp
(setq compilation-finish-functions
      (lambda (buf str)
        (if (null (string-match ".*exited abnormally.*" str))
            ;;no errors, make the compilation window go away in a few seconds
            (progn
              (run-at-time "0.6 sec"
                           nil
                           'delete-windows-on
                           (get-buffer-create "*compilation*"))
              ;; (run-at-time "0.4 sec" nil
              ;;              (lambda ()
              ;;                (-> (get-buffer-create "*compilation*")
              ;;                    (get-buffer-window)
              ;;                    (select-window))
              ;;                (switch-to-buffer nil)))
              (message "No Compilation Errors!")))))
#+end_src

** Tools
*** COMMENT embark
#+begin_src emacs-lisp
(use-package embark
  :ensure t
  :config
  (general-def :states 'motion
    "," 'embark-act
    "M-," 'embark-dwim)
  ;; ;; Show the Embark target at point via Eldoc.  You may adjust the Eldoc
  ;; ;; strategy, if you want to see the documentation from multiple providers.
  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)
  )
#+end_src

**** embark-consult
#+begin_src emacs-lisp
(use-package embark-consult
  :ensure t
  :hook (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

*** avy
#+begin_src emacs-lisp
(use-package avy
  :ensure t
  :custom
  (avy-background t)
  (avy-keys (number-sequence ?a ?z)) ;; Any lower-case letter a-z.
  ;; (avy-words)
  (avy-style 'at-full)
  (avy-all-windows nil))
#+end_src

#+begin_src emacs-lisp :tangle no
;; (define-advice forward-evil-paragraph
;;     (:around (callback &rest args) use-default-paragraph-definiton-in-org)
;;   (if (derived-mode-p 'org-mode)
;;       (let ((paragraph-start    (default-value 'paragraph-start))
;;             (paragraph-separate (default-value 'paragraph-separate)))
;;         (apply callback args))
;;     (apply callback args)))

(with-eval-after-load 'avy
  (define-advice avy-action-goto))
#+end_src

*** anzu
#+begin_src emacs-lisp
(use-package anzu
  :ensure t
  :init (global-anzu-mode)
  :config
  (general-def
    [remap query-replace]                'anzu-query-replace
    [remap query-replace-regexp]         'anzu-query-replace-regexp
    [remap isearch-query-replace]        'anzu-isearch-query-replace
    [remap isearch-query-replace-regexp] 'anzu-isearch-query-replace-regexp))
#+end_src

*** expand-region
#+begin_src emacs-lisp
(use-package expand-region
  :ensure t
  :after evil-collection
  :custom
  (expand-region-contract-fast-key "C-v")
  :config
  (general-def :states 'visual
    "v" 'er/expand-region))

;; (defun my/collapse-region ()
;;   (interactive)
;;   (er/expand-region -1))
;; (general-def :states 'visual
;;   "v" 'er/expand-region
;;   "C-v" 'my/collapse-region)
#+end_src

*** zoxide
#+begin_src emacs-lisp
(use-package zoxide
  :ensure t
  :bind (:map leader-map
         ("fz" . zoxide-find-file)))
#+end_src

