home/dot_config/emacs/init.el
  (define-advice eldoc-doc-buffer (:after (_) prettify-eldoc-buffer)
    (with-current-buffer eldoc--doc-buffer
      (setq-local fill-column 90)
      (visual-line-mode)
      (virtual-auto-fill-mode)
      ;; (eldoc-box--prettify-markdown-separator)
      (eldoc-box--replace-en-space)
      ;; (eldoc-box--remove-linked-images)
      ;; (eldoc-box--remove-noise-chars)
      ;; (eldoc-box--fontify-html)
      ;; (eldoc-box--condense-large-newline-gaps)
      ))
  (add-to-list 'eglot-server-programs
               '((c++-mode c++-ts-mode)
                 . (;; "emacs-lsp-booster" ;; in case I start to use emacs-lsp-booster
                    "clangd"
                    "--compile-commands-dir=debug"
                    "--background-index"
                    "--suggest-missing-includes"
                    "--pch-storage=memory"
  
                    ;; bounded  :: Similar completion items (e.g. function overloads) are
                    ;;             combined.  Type information shown where possible.
                    ;; detailed :: One completion item for each semantically distinct
                    ;;             completion, with full type information.
                    "--completion-style=bundled")))
  (dolist (mode '(cmake-mode cmake-ts-mode))
    (add-to-list 'eglot-server-programs
                 `(,mode . ("neocmakelsp" "--stdio"))))
  )

(use-package eldoc-box
  :ensure t
  :autoload (eldoc-box--replace-en-space
             eldoc-box--prettify-markdown-separator
             eldoc-box--remove-linked-images
             eldoc-box--remove-noise-chars
             eldoc-box--fontify-html
             eldoc-box--condense-large-newline-gaps)
  :after eglot
  :config
  (my/add-to-list 'eldoc-box-self-insert-command-list
                  '(evil-force-normal-state)))

(setopt
 flymake-start-on-save-buffer t)

(dolist (hook '(flymake-diagnostics-buffer-mode-hook
                flymake-project-diagnostics-mode-hook))
  (add-hook hook #'hl-line-mode))

(use-package consult-eglot
  :ensure t
  :after eglot)

(use-package breadcrumb
  :ensure t
  :hook
  ((c-mode c++-mode c-ts-mode c++-ts-mode) . breadcrumb-local-mode))

(setopt xref-auto-jump-to-first-definition 'show)

(use-package avy
  :ensure t
  :custom
  (avy-background t)
  (avy-keys (number-sequence ?a ?z)) ;; Any lower-case letter a-z.
  ;; (avy-words)
  (avy-style 'at-full)
  (avy-all-windows nil))

(use-package anzu
  :ensure t
  :init (global-anzu-mode)
  :config
  (general-def
    [remap query-replace]                'anzu-query-replace
    [remap query-replace-regexp]         'anzu-query-replace-regexp
    [remap isearch-query-replace]        'anzu-isearch-query-replace
    [remap isearch-query-replace-regexp] 'anzu-isearch-query-replace-regexp))

(use-package expand-region
  :ensure t
  :after evil-collection
  :custom
  (expand-region-contract-fast-key "C-v")
  :config
  (general-def :states 'visual
    "v" 'er/expand-region))

;; (defun my/collapse-region ()
;;   (interactive)
;;   (er/expand-region -1))
;; (general-def :states 'visual
;;   "v" 'er/expand-region
;;   "C-v" 'my/collapse-region)

(use-package zoxide
  :ensure t
  :bind (:map leader-map
         ("fz" . zoxide-find-file)))
