home/dot_config/emacs-old/README.org
*** origami
#+begin_src emacs-lisp
(use-package origami
  :ensure t
  :after evil
  ;; :custom
  ;; (origami-show-fold-header t) ;; highlight fold headers
  ;; :init (global-origami-mode)
  :config
  ;; (setq origami-fold-style 'triple-braces)
  (general-def :keymaps 'origami-mode-map :states 'normal
    "z j" 'origami-forward-fold
    "z k" 'origami-previous-fold))
#+end_src

*** rainbow-delimiters
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** rg
#+begin_src emacs-lisp
(use-package rg
  :ensure t)
#+end_src

*** fzf
#+begin_src emacs-lisp
(use-package fzf
  :ensure t
  :custom
  ;; (fzf/args "-x --color bw --print-query --margin=1,0 --no-hscroll")
  ;; (fzf/executable "fzf")
  (fzf/git-grep-args "-i --line-number %s")
  ;; command used for `fzf-grep-*` functions
  ;; example usage for ripgrep:
  (fzf/grep-command "rg --files --no-ignore --hidden --follow -g \"!{.git,node_modules}\" 2> /dev/null'")
  ;; If nil, the fzf buffer will appear at the top of the window
  (fzf/position-bottom t)
  (fzf/window-height 20)
  :config
  (defun my/fzf-curdir ()
    (interactive)
    (fzf-find-file-in-dir  default-directory))
  (defun my/fzf-home ()
    (interactive)
    (fzf-find-file-in-dir (getenv "HOME")))
  (my/which-key-set-command-description
   'my/fzf-curdir "fzf"
   'my/fzf-home   "fzf-home")
  )
#+end_src

*** undo tree
#+begin_src emacs-lisp
(use-package vundo
  :ensure t
  ;; :vc (:fetcher github :repo "casouri/vundo")
  :custom
  (vundo-glyph-alist vundo-unicode-symbols)
  ;; (vundo-roll-back-on-quit nil)
  (vundo-compact-display nil)
  :config
  (general-def :states 'normal
    "U" 'vundo))
#+end_src

*** separedit
#+begin_src emacs-lisp
(use-package separedit :ensure t
  :custom
  ;; Default major-mode for edit buffer can also be other mode e.g. ‘org-mode’.
  (separedit-default-mode 'markdown-mode)
  (separedit-preserve-string-indentation t)
  (separedit-continue-fill-column t)
  (separedit-write-file-when-execute-save t)
  (separedit-remove-trailing-spaces-in-comment t)
  :config
  ;; ;; Key binding for modes you want edit or simply bind ‘global-map’ for all.
  (general-def :keymaps 'global-map :states 'normal
    "z'" 'separedit)
  ;; (general-def :keymaps 'prog-mode-map :states 'normal
  ;;   "z'" 'separedit)
  ;; (general-def :keymaps 'minibuffer-local-map :states 'normal
  ;;   "z'" 'separedit)
  ;; (general-def :keymaps 'help-mode-map :states 'normal
  ;;   "z'" 'separedit)
  ;; (general-def :keymaps 'helpful-mode-map :states 'normal
  ;;   "z'" 'separedit)
  ;; (with-eval-after-load 'obsidian
  ;;   (general-def :keymaps 'obsidian-mode-map :states 'normal
  ;;     "z'" 'separedit))

  ;; (general-def :keymaps 'separedit-mode-map :states 'normal
  ;;   "ZZ" 'separedit-commit
  ;;   "ZQ" 'separedit-abort)
  (general-def :keymaps 'separedit-mode-map :states 'normal
    [remap edit-indirect-commit] 'separedit-commit))
#+end_src

*** restart-emacs
#+begin_src emacs-lisp
(use-package restart-emacs
  :ensure t
  :commands (restart-emacs  restart-emacs-start-new-emacs))
#+end_src

*** COMMENT moom
#+begin_src emacs-lisp
(use-package moom
  :ensure t
  :after transient
  :config
  (moom-mode)
  (moom-move-frame-to-edge-right))
#+end_src

*** COMMENT elisp-demos
#+begin_src emacs-lisp
(use-package elisp-demos
  :ensure t
  :after helpful
  :config
  (advice-add #'helpful-update :after #'elisp-demos-advice-helpful-update))
#+end_src

*** COMMENT zoom
#+begin_src emacs-lisp
(use-package zoom
  :ensure t
  :custom
  (split-width-threshold 130) ;; Threshold to split window horizontally.
  (zoom-mode t)
  (zoom-ignored-major-modes '(dired-mode))
  (temp-buffer-resize-mode t))
#+end_src

*** COMMENT fancy-compilation
#+begin_src emacs-lisp
(use-package fancy-compilation
  :ensure t
  :config (fancy-compilation-mode))
#+end_src

** Org-mode
*** org
#+begin_src emacs-lisp :noweb yes
(use-package org
  :custom
  <<org-custom>>
  :config
  <<org-config>>)
#+end_src
**** custom
:PROPERTIES:
:header-args: :noweb-ref org-custom
:END:

Sometimes you may inadvertently edit an invisible part of the buffer and be
confused on what has been edited and how to undo the mistake. This setting
allow to preventing this.
#+begin_src emacs-lisp
;; (org-fold-catch-invisible-edits 'smart)
(org-fold-catch-invisible-edits 'show-and-error)
#+end_src

Turn on ~org-indent-mode~ on startup, which softly indent text according to
outline structure.
#+begin_src emacs-lisp
(org-startup-indented t)
#+end_src

Cycle globally if cursor is at beginning of buffer and not at a headline.
#+begin_src emacs-lisp
(org-cycle-global-at-bob t)
#+end_src

Make ~org-beginning-of-line~ and ~org-end-of-line~ ignore leading stars or tags on
headings. Repeat to toggle. ~evil-org-insert-line~ and ~evil-org-append-line~ also
respect this setting.
#+begin_src emacs-lisp
(org-special-ctrl-a/e t)
#+end_src

Прижимать тэги к 80 колонке справа.
#+begin_src emacs-lisp
(org-tags-column -80)
#+end_src

The maximum level for Imenu access to Org headlines.
#+begin_src emacs-lisp
(org-imenu-depth 8)
#+end_src

Show inline images by default in org-mode.
#+begin_src emacs-lisp
(org-startup-with-inline-images t)
#+end_src

#+begin_src emacs-lisp
(org-image-actual-width '(400))
#+end_src

Open src block buffer to the right of the current window keeping all other
windows.
#+begin_src emacs-lisp
;; (org-src-window-setup 'split-window-right)
(org-src-window-setup 'current-window) ; edit in current window
#+end_src

Indentation for the content of a source code block.
#+begin_src emacs-lisp
(org-edit-src-content-indentation 0)
(org-src-preserve-indentation nil)
#+end_src

If non-nil, the effect of =TAB= in a code block is as if it were issued in the
language major mode buffer.
#+begin_src emacs-lisp
(org-src-tab-acts-natively nil)
#+end_src

Follow org links by press Enter with point on it.
#+begin_src emacs-lisp
;; (org-return-follows-link t)
#+end_src

Follow org links by press Tab with point on it.
#+begin_src emacs-lisp
;; (org-tab-follows-link t)
#+end_src

#+begin_src emacs-lisp
(org-use-speed-commands nil)
#+end_src

Changes to task states might get logged, especially for recurring
routines. If so, log them in a drawer, not the content of the note.
#+begin_src emacs-lisp
;; (org-log-state-notes-into-drawer t)
#+end_src

Show only description of the link.
#+begin_src emacs-lisp
(org-link-descriptive t)
#+end_src

#+begin_src emacs-lisp
(org-ctrl-k-protect-subtree t)
(org-id-locations-file-relative t)
;; (org-indirect-buffer-display 'current-window)
(org-list-allow-alphabetical t)
(org-log-into-drawer t)
#+end_src

Initial visibility.
#+begin_src emacs-lisp
;; (org-startup-folded 'content)
(org-startup-folded 'show2levels)
#+end_src

Properties apply also for sublevels.
#+begin_src emacs-lisp
(org-use-property-inheritance t)
#+end_src

#+begin_src emacs-lisp
(org-src-fontify-natively t)
(org-fontify-whole-heading-line t)
(org-fontify-done-headline t)
(org-fontify-quote-and-verse-blocks t)
#+end_src

#+begin_src emacs-lisp
(org-log-done 'time) ; Track time when tasks were finished.
(org-deadline-warning-days 14)
(org-log-redeadline 'note)
(org-log-reschedule nil)
#+end_src

#+begin_src emacs-lisp
(org-pretty-entities t)
#+end_src

***** lists settings
#+begin_src emacs-lisp
;; (org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+")))
#+end_src

Additional indentation for sub-items in a list.
#+begin_src emacs-lisp
;; (org-list-indent-offset 1)
#+end_src

Consider plain lists items as a lower level subheadings, during cycling
with =Tab= key.
#+begin_src emacs-lisp
;; (org-cycle-include-plain-lists 'integrate)
#+end_src

***** [[*Applications used to open external files][org-file-apps]]
***** attachments
#+begin_src emacs-lisp
(org-attach-store-link-p t)
(org-attach-dir-relative t)
(org-attach-id-dir "data/")
;; (org-attach-use-inheritance nil)
(org-attach-auto-tag "ATTACH")
#+end_src

***** "TODO" keywords and Priorities
#+begin_src emacs-lisp
(org-todo-keywords
 '((sequence ;; "󰔌"  ; SOMEDAY
             "󰒅"  ; SOMEDAY
             "󰄱"  ; TODO
             "󰡖"  ; NEXT
             ;; "󰤌"  ; IN PROCESS
             "󱅊"  ; IN PROGRESS
             "󱗝"  ; IN PROGRESS
             "󰔟"  ; WAITING
             "|"
             "󰄵"  ; DONE
             "󱈎"  ; ARCHIVED
             "󰅘") ; CANCELLED
   (sequence "SOMEDAY" "TODO" "NEXT" "IN-PROGRESS" "WAITING" "|"
             "DONE" "ARCHIVED" "CANCELLED")))
#+end_src

Make priority signs be integers from 1 to 5, with 3 as default.
Default priorities are: =#A=, =#B=, =#C=, with =#B= as default.
#+begin_src emacs-lisp
(org-priority-highest ?A)
(org-priority-lowest  ?D)
(org-priority-default ?C)
#+end_src

Consider all nested entries in the subtree for cookies. ([[info:org#Breaking Down Tasks][Manual]])
#+begin_src emacs-lisp
(org-hierarchical-todo-statistics nil)
#+end_src

***** tags
#+begin_src emacs-lisp
;; (org-use-tag-inheritance nil)
(org-tags-exclude-from-inheritance '("project" "main" "index"))
(org-tags-match-list-sublevels nil)
#+end_src

***** footnotes
#+begin_src emacs-lisp
(org-footnote-define-inline nil)
(org-footnote-auto-adjust t)
#+end_src

***** babel
Allow babel code execution without confirming it every time.
#+begin_src emacs-lisp
(org-confirm-babel-evaluate nil)
#+end_src

Available embedded languages for babel.
#+begin_src emacs-lisp
(org-babel-load-languages '((sql . t)
                            (shell . t)
                            (emacs-lisp . t)
                            (python . t)
                            (plantuml . t)))
#+end_src

Use PlantUML executable instead of =.jar= file together with Java.
#+begin_src emacs-lisp
(org-plantuml-exec-mode 'plantuml)
(org-plantuml-jar-path (expand-file-name "~/.nix-profile/lib/plantuml.jar"))
#+end_src

**** config
:PROPERTIES:
:header-args: :noweb-ref org-config
:END:
