home/dot_config/emacs/init.el

(use-package origami
  :ensure t
  :after evil
  ;; :custom
  ;; (origami-show-fold-header t) ;; highlight fold headers
  ;; :init (global-origami-mode)
  :config
  ;; (setq origami-fold-style 'triple-braces)
  (general-def :keymaps 'origami-mode-map :states 'normal
    "z j" 'origami-forward-fold
    "z k" 'origami-previous-fold))

(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package rg
  :ensure t)

(use-package fzf
  :ensure t
  :custom
  ;; (fzf/args "-x --color bw --print-query --margin=1,0 --no-hscroll")
  ;; (fzf/executable "fzf")
  (fzf/git-grep-args "-i --line-number %s")
  ;; command used for `fzf-grep-*` functions
  ;; example usage for ripgrep:
  (fzf/grep-command "rg --files --no-ignore --hidden --follow -g \"!{.git,node_modules}\" 2> /dev/null'")
  ;; If nil, the fzf buffer will appear at the top of the window
  (fzf/position-bottom t)
  (fzf/window-height 20)
  :config
  (defun my/fzf-curdir ()
    (interactive)
    (fzf-find-file-in-dir  default-directory))
  (defun my/fzf-home ()
    (interactive)
    (fzf-find-file-in-dir (getenv "HOME")))
  (my/which-key-set-command-description
   'my/fzf-curdir "fzf"
   'my/fzf-home   "fzf-home")
  )

(use-package vundo
  :ensure t
  ;; :vc (:fetcher github :repo "casouri/vundo")
  :custom
  (vundo-glyph-alist vundo-unicode-symbols)
  ;; (vundo-roll-back-on-quit nil)
  (vundo-compact-display nil)
  :config
  (general-def :states 'normal
    "U" 'vundo))

(use-package separedit :ensure t
  :custom
  ;; Default major-mode for edit buffer can also be other mode e.g. ‘org-mode’.
  (separedit-default-mode 'markdown-mode)
  (separedit-preserve-string-indentation t)
  (separedit-continue-fill-column t)
  (separedit-write-file-when-execute-save t)
  (separedit-remove-trailing-spaces-in-comment t)
  :config
  ;; ;; Key binding for modes you want edit or simply bind ‘global-map’ for all.
  (general-def :keymaps 'global-map :states 'normal
    "z'" 'separedit)
  ;; (general-def :keymaps 'prog-mode-map :states 'normal
  ;;   "z'" 'separedit)
  ;; (general-def :keymaps 'minibuffer-local-map :states 'normal
  ;;   "z'" 'separedit)
  ;; (general-def :keymaps 'help-mode-map :states 'normal
  ;;   "z'" 'separedit)
  ;; (general-def :keymaps 'helpful-mode-map :states 'normal
  ;;   "z'" 'separedit)
  ;; (with-eval-after-load 'obsidian
  ;;   (general-def :keymaps 'obsidian-mode-map :states 'normal
  ;;     "z'" 'separedit))

  ;; (general-def :keymaps 'separedit-mode-map :states 'normal
  ;;   "ZZ" 'separedit-commit
  ;;   "ZQ" 'separedit-abort)
  (general-def :keymaps 'separedit-mode-map :states 'normal
    [remap edit-indirect-commit] 'separedit-commit))

(use-package restart-emacs
  :ensure t
  :commands (restart-emacs  restart-emacs-start-new-emacs))

(use-package org
  :custom
  ;; (org-fold-catch-invisible-edits 'smart)
  (org-fold-catch-invisible-edits 'show-and-error)
  (org-startup-indented t)
  (org-cycle-global-at-bob t)
  (org-special-ctrl-a/e t)
  (org-tags-column -80)
  (org-imenu-depth 8)
  (org-startup-with-inline-images t)
  (org-image-actual-width '(400))
  ;; (org-src-window-setup 'split-window-right)
  (org-src-window-setup 'current-window) ; edit in current window
  (org-edit-src-content-indentation 0)
  (org-src-preserve-indentation nil)
  (org-src-tab-acts-natively nil)
  ;; (org-return-follows-link t)
  ;; (org-tab-follows-link t)
  (org-use-speed-commands nil)
  ;; (org-log-state-notes-into-drawer t)
  (org-link-descriptive t)
  (org-ctrl-k-protect-subtree t)
  (org-id-locations-file-relative t)
  ;; (org-indirect-buffer-display 'current-window)
  (org-list-allow-alphabetical t)
  (org-log-into-drawer t)
  ;; (org-startup-folded 'content)
  (org-startup-folded 'show2levels)
  (org-use-property-inheritance t)
  (org-src-fontify-natively t)
  (org-fontify-whole-heading-line t)
  (org-fontify-done-headline t)
  (org-fontify-quote-and-verse-blocks t)
  (org-log-done 'time) ; Track time when tasks were finished.
  (org-deadline-warning-days 14)
  (org-log-redeadline 'note)
  (org-log-reschedule nil)
  (org-pretty-entities t)
  ;; (org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+")))
  ;; (org-list-indent-offset 1)
  ;; (org-cycle-include-plain-lists 'integrate)
  (org-attach-store-link-p t)
  (org-attach-dir-relative t)
  (org-attach-id-dir "data/")
  ;; (org-attach-use-inheritance nil)
  (org-attach-auto-tag "ATTACH")
  (org-todo-keywords
   '((sequence ;; "󰔌"  ; SOMEDAY
               "󰒅"  ; SOMEDAY
               "󰄱"  ; TODO
               "󰡖"  ; NEXT
               ;; "󰤌"  ; IN PROCESS
               "󱅊"  ; IN PROGRESS
               "󱗝"  ; IN PROGRESS
               "󰔟"  ; WAITING
               "|"
               "󰄵"  ; DONE
               "󱈎"  ; ARCHIVED
               "󰅘") ; CANCELLED
     (sequence "SOMEDAY" "TODO" "NEXT" "IN-PROGRESS" "WAITING" "|"
               "DONE" "ARCHIVED" "CANCELLED")))
  (org-priority-highest ?A)
  (org-priority-lowest  ?D)
  (org-priority-default ?C)
  (org-hierarchical-todo-statistics nil)
  ;; (org-use-tag-inheritance nil)
  (org-tags-exclude-from-inheritance '("project" "main" "index"))
  (org-tags-match-list-sublevels nil)
  (org-footnote-define-inline nil)
  (org-footnote-auto-adjust t)
  (org-confirm-babel-evaluate nil)
  (org-babel-load-languages '((sql . t)
                              (shell . t)
                              (emacs-lisp . t)
                              (python . t)
                              (plantuml . t)))
  (org-plantuml-exec-mode 'plantuml)
  (org-plantuml-jar-path (expand-file-name "~/.nix-profile/lib/plantuml.jar"))
  :config
