home/dot_config/emacs/init.el
  (setq org-file-apps '(("\\.pdf\\'" . "xdg-open %s")
                        ;; ("\\.pdf\\'" . "evince %s")
                        ("\\.djvu\\'" . "xdg-open %s")
                        ("\\.\\(?:jpe?g\\|png\\)\\'" . "xdg-open %s")
                        (auto-mode . emacs)
                        (directory . emacs)
                        ("\\.mm\\'" . default)
                        ("\\.x?html?\\'" . default)))
  (set-fontset-font t ?⤵ "DejaVu Serif" nil 'prepend)
  ;; (org-ellipsis " ⤵")
  (setopt org-ellipsis " ")
  ;; (org-ellipsis " 󰇜")
  ;; (org-ellipsis " ")
  (add-hook 'org-babel-after-execute-hook
            (lambda ()
              (when org-inline-image-overlays
                (org-redisplay-inline-images))))
  (with-eval-after-load 'evil
    (define-advice forward-evil-paragraph
        (:around (orig-fun &rest args) use-default-paragraph-definiton-in-org)
      (if (derived-mode-p 'org-mode)
          (let ((paragraph-start    (default-value 'paragraph-start))
                (paragraph-separate (default-value 'paragraph-separate)))
            (apply orig-fun args))
        (apply orig-fun args))))
  ;; ("TODO" . "")
  ;; ("WAIT" . "")
  ;; ("NOPE" . "")
  ;; ("DONE" . "")
  ;; ("[#A]" . "")
  ;; ("[#B]" . "")
  ;; ("[#C]" . "")
  ;; ("[ ]" . "")
  ;; ("[X]" . "")
  ;; ("[-]" . "")
  ;; (":PROPERTIES:" . "")
  ;; (":END:" . "―")
  ;; ("#+STARTUP:" . "")
  ;; ("#+TITLE: " . "")
  ;; ("#+RESULTS:" . "")
  ;; ("#+NAME:" . "")
  ;; ("#+ROAM_TAGS:" . "")
  ;; ("#+FILETAGS:" . "")
  ;; ("#+HTML_HEAD:" . "")
  ;; ("#+SUBTITLE:" . "")
  ;; ("#+AUTHOR:" . "")
  ;; (":Effort:" . "")
  ;; ("SCHEDULED:" . "")
  ;; ("DEADLINE:" . "")
  
  (defun my/org-icons ()
    "Beautify org mode keywords."
    (setq prettify-symbols-alist
          (mapcan (lambda (x) (list x (cons (upcase (car x)) (cdr x))))
                  '(("#+begin_src" . "")
                    ("#+end_src" . "―")
                    ("#+begin_example" . "")
                    ("#+end_example" . "")
                    ("#+begin_quote" . "")
                    ("#+end_quote" . "")
                    ;; ("#+begin_quote" . "")
                    ;; ("#+end_quote" . "")
                    ;; ("#+header:" . ?)
                    ;; ("#+name:" . ?﮸)
                    ;; ("#+results:" . ?)
                    ;; ("#+call:" . ?)
                    ;; (":properties:" . ?)
                    ;; (":logbook:" . ?)
                    )))
    (prettify-symbols-mode)))

(use-package org-superstar
  :ensure t
  :after org
  :custom
  (org-superstar-remove-leading-stars nil)
  (org-superstar-headline-bullets-list '("●"))
  ;; (org-superstar-leading-bullet)
  (org-superstar-item-bullet-alist '((?+ . ?▸)
                                     (?- . ?•)
                                     (?* . ?◆)
                                     ))
  :hook (org-mode . org-superstar-mode))

(use-package org-pretty-tags
  :ensure t
  :after org
  :hook org-mode
  :custom
  (org-pretty-tags-surrogate-strings '(("ATTACH" . "󰁦"))))

(use-package org-roam
  :ensure t
  :after org
  :custom
  (org-roam-directory (file-truename "~/notes"))
  ;; (org-roam-completion-everywhere t)
  ;; (org-id-link-to-org-use-id 'create-if-interactive)
  (org-id-link-to-org-use-id 'use-existing)
  (org-roam-db-gc-threshold most-positive-fixnum)
  (org-roam-node-display-template (concat "${title:*} "
                                          (propertize "${tags:17}" 'face 'org-tag)))
  (org-roam-graph-executable "dot")
  :config
  (org-roam-db-autosync-mode)
  (add-to-list 'org-default-properties "ROAM_EXCLUDE")
  ;; (add-to-list 'display-buffer-alist
  ;;              '("\\*org-roam\\*"
  ;;                (display-buffer-in-direction)
  ;;                (direction . right)
  ;;                (window-width . 0.33)
  ;;                (window-height . fit-window-to-buffer)))
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (cons arg args))
          (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                    '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))
  (defun my/org-roam-create-untracked-node ()
    "Create Org-Roam node with `ROAM_EXCLUDE' property."
    (interactive)
    (org-id-get-create)
    (org-set-property "ROAM_EXCLUDE" "t"))
  )

(use-package org-roam-dailies
  :after org-roam
  :custom
  (org-roam-dailies-directory "journal/")
  ;; (org-roam-dailies-capture-templates
  ;;  '(("d" "default" entry "* %<%I:%M %p>: %?"
  ;;     :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  )

(use-package consult-org-roam
  :ensure t
  :after org-roam
  :custom
  (consult-org-roam-grep-func #'consult-ripgrep)
