home/dot_config/emacs-old/README.org
***** custom
:PROPERTIES:
:header-args: :noweb-ref dirvish-custom
:END:

| *-l*               | use a long listing format                     |
| *-a*, *--all*        | do not ignore entries starting with =.=         |
| *-A*, *--almost-all* | do not list implied =.= and =..=                  |
| *-F*, *--classify*   | append indicator (one of =*/=>@¦=) to entries   |
| *-v*               | natural sort of (version) numbers within text |
#+begin_src emacs-lisp
(dired-listing-switches "-lAh -v --group-directories-first")
;; (dired-listing-switches "-lAhF -v --group-directories-first")
;; (dired-listing-switches "-l --human-readable --group-directories-first")
#+end_src

#+begin_src emacs-lisp
;; (dired-kill-when-opening-new-dired-buffer t) ;; Dirvish ignore this option.
(delete-by-moving-to-trash t)
(dired-recursive-deletes 'always)
(dired-recursive-copies 'always)
(dired-no-confirm t)
(dired-dwim-target t)
(dired-omit-files "\\`[.]?#\\|\\`[.][.]?\\'\\|\\`[.].+")
#+end_src

#+begin_src emacs-lisp
(dirvish-default-layout '(0 0.4 0.6))
(dirvish-layout-recipes '((0 1 0)
                          (0 0.4 0.6)))
(dirvish-side-width 38)
(dirvish-mode-line-format '(:left (sort symlink) :right (vc-info yank index)))
(dirvish-header-line-format '(:left (path) :right (free-space)))
#+end_src

#+begin_src emacs-lisp
(dirvish-hide-details t)
#+end_src

#+begin_src emacs-lisp
;; (dirvish-attributes '(vc-state file-size subtree-state collapse all-the-icons))
(dirvish-attributes '(all-the-icons file-time file-size collapse subtree-state vc-state git-msg))
#+end_src

#+begin_src emacs-lisp
(dirvish-open-with-programs `((,dirvish-image-exts ,(executable-find "qimgv") "%f")
                              (,dirvish-video-exts ,(executable-find "vlc")   "%f")))
#+end_src

#+begin_src emacs-lisp
(dirvish-quick-access-entries
 `(("h" "~/"                          "Home")
   ("d" "~/Downloads/"                "Downloads")
   ("m" "/run/media/"                 "Drives")
   ("t" "~/.local/share/Trash/files/" "TrashCan")
   ("e" ,user-emacs-directory         "Emacs")))
#+end_src

**** Dired
***** dired
#+begin_src emacs-lisp :noweb yes
(use-package dired
  :custom
  <<dired-custom>>
  :hook
  (dired-mode . dired-omit-mode)
  (dired-mode . dired-hide-details-mode)
  (dired-mode . hl-line-mode))
#+end_src
****** custom
:PROPERTIES:
:header-args: :noweb-ref dired-custom
:END:

| *-l*               | use a long listing format                     |
| *-a*, *--all*        | do not ignore entries starting with =.=         |
| *-A*, *--almost-all* | do not list implied =.= and =..=                  |
| *-F*, *--classify*   | append indicator (one of =*/=>@¦=) to entries   |
| *-v*               | natural sort of (version) numbers within text |
#+begin_src emacs-lisp
(dired-listing-switches "-lAhF -v --group-directories-first")
;; (dired-listing-switches "-l --human-readable --group-directories-first")
#+end_src

#+begin_src emacs-lisp
(dired-kill-when-opening-new-dired-buffer t)
(delete-by-moving-to-trash t)
(dired-recursive-deletes 'always)
(dired-recursive-copies 'always)
(dired-no-confirm t)
(dired-dwim-target t)
(dired-omit-files "\\`[.]?#\\|\\`[.][.]?\\'\\|\\`[.].+")
#+end_src

***** dired-hacks
- [[https://github.com/Fuco1/dired-hacks][GitHub - Fuco1/dired-hacks: Collection of useful dired additions]]

#+begin_src emacs-lisp
(use-package dired-ranger  :ensure t)
(use-package dired-subtree :ensure t)
(use-package dired-narrow  :ensure t)
(use-package dired-open    :ensure t)
(use-package dired-toggle-sudo :ensure t)
#+end_src

***** COMMENT wdired
#+begin_src emacs-lisp
(setopt wdired-allow-to-change-permissions t)
#+end_src

***** dired-collapse
Toggle collapsing of unique nested paths in Dired.

#+begin_src emacs-lisp
(use-package dired-collapse
  :ensure t
  ;; :hook (dired-mode . dired-collapse-mode)
  )
#+end_src

***** dired-rainbow
#+begin_src emacs-lisp :noweb yes
(use-package dired-rainbow
  :ensure t
  :config
  (dired-rainbow-define html "#4e9a06" ("htm" "html" "xhtml"))

  ;; Video files:
  (defconst my/video-files-extensions
    '("mp3" "mp4" "MP3" "MP4" "avi" "mpg" "flv" "ogg" "mkv")
    "Media files.")
  (dired-rainbow-define media "#ce5c00" my/video-files-extensions)

  ;; Highlight executable files, but not directories:
  (dired-rainbow-define-chmod executable-unix "#4e9a06" "-.*x.*"))
#+end_src

***** diredfl
Addtional syntax highlighting for dired
#+begin_src emacs-lisp
(use-package diredfl
  :ensure t
  ;; :config
  ;; (set-face-attribute 'diredfl-dir-name nil :bold t)
  :hook dired-mode
  ;; :hook dirvish-directory-view-mode
  )
#+end_src

***** COMMENT dired-recent
I'm not sure that this package is needed, since I already use [[consult-dir][consult-dir]].
=C-x C-d= to open ~dired-recent-open~.

#+begin_src emacs-lisp
(use-package dired-recent
  :ensure t
  :config
  (dired-recent-mode)
  (keymap-unset dired-recent-mode-map "C-x C-d" :remove))
#+end_src

***** COMMENT dired-preview
#+begin_src emacs-lisp
(use-package dired-preview :ensure t)
#+end_src

*** Magit
#+begin_src emacs-lisp
(use-package magit
  :ensure t
  :custom
  ; hide ^M characters at the end of a line in diffs
  (magit-diff-hide-trailing-cr-characters t)
  :config
  (define-advice magit-display-buffer-traditional
      (:around (orig-fun buffer) open-status-buffer-in-current-window)
    "Show `magit-status' buffer in current window."
    (if (with-current-buffer buffer
          (equal major-mode 'magit-status-mode))
        (display-buffer buffer '(display-buffer-same-window))
      ;; else
      (funcall orig-fun buffer))))
#+end_src

#+begin_src emacs-lisp
(use-package git-modes :ensure t)
#+end_src

#+begin_src emacs-lisp
(use-package forge :ensure t :after magit)
#+end_src

**** difftastic
#+begin_src emacs-lisp
(use-package difftastic
  :ensure t
  ;; :after magit-diff
  :demand t
  :bind (:map magit-blame-read-only-mode-map
              ("D" . difftastic-magit-show)
              ("S" . difftastic-magit-show))
  :config
  (with-eval-after-load 'magit-diff
    (transient-append-suffix 'magit-diff '(-1 -1)
      [("D" "Difftastic diff (dwim)" difftastic-magit-diff)
       ("S" "Difftastic show" difftastic-magit-show)])))
#+end_src

*** Documents viewing
**** Info
Tell Emacs where to search Info files of the packages installed with Nix package
manager. (particular =mu4e=)
#+begin_src emacs-lisp
;; (add-to-list 'Info-directory-list (expand-file-name ".nix-profile/share/info"))

(-map (lambda (dir)
        (let ((dir (expand-file-name dir)))
          (when (f-directory? dir)
            (add-to-list 'Info-additional-directory-list dir))))
      '("~/.local/share/info"
        "~/.nix-profile/share/info"))
#+end_src

#+begin_src emacs-lisp
(use-package info-rename-buffer
  :ensure t
  :after info
  :config (info-rename-buffer-mode))
#+end_src

Provides links from elisp symbols in Gnu-Emacs Info viewer to their help
documentation.
#+begin_src emacs-lisp
(use-package inform
  :after info
  :ensure t)
#+end_src

Extra coloring in Info mode.
#+begin_src emacs-lisp
(use-package info-colors
  :ensure t
  :hook (Info-selection . info-colors-fontify-node))
#+end_src

**** pdf
***** pdf-tools
#+begin_src emacs-lisp
(use-package pdf-tools
  :ensure t
  :config
  ;; Makes Emacs load and use PDF Tools as soon as a PDF file is opened, but not sooner.
  (pdf-loader-install))
#+end_src

***** org-pdftools
Add support for org links from pdftools buffer.

#+begin_src emacs-lisp
(use-package org-pdftools
  :ensure t
  :hook ((org-mode . org-pdftools-setup-link)
         (pdf-view-mode . org-pdftools-setup-link)))
#+end_src

**** epub (nov.el)
#+begin_src emacs-lisp
(use-package nov
  :ensure t
  :mode ("\\.epub\\'" . nov-mode)
  :custom (nov-text-width 80)
  :hook ((nov-mode . visual-line-mode)
         ;; (nov-mode . visual-fill-column-mode)
         ))
#+end_src

**** fb2-reader
#+begin_src emacs-lisp
(use-package fb2-reader
  :ensure t
  :mode ("\\.fb2\\(\\.zip\\)?\\'" . fb2-reader-mode)
  :commands fb2-reader-continue
  :custom
  ;; This mode renders book with fixed width, adjust to your preferences.
  (fb2-reader-page-width 80)
  (fb2-reader-image-max-width 400)
  (fb2-reader-image-max-height 400))
#+end_src

**** djvu
#+begin_src emacs-lisp
(use-package djvu :ensure t)
#+end_src

*** LaTeX
**** AUCTeX
#+begin_src emacs-lisp
(use-package tex
  :ensure auctex
  :init
  (setopt TeX-auto-save t
          TeX-parse-self t)
  (setq-default TeX-master nil))
#+end_src

**** xenops
- [[https://github.com/dandavison/xenops][Source]]
#+begin_src emacs-lisp
(use-package xenops
  :ensure t
  :after no-littering
  :init
  (setq xenops-cache-directory (expand-file-name "xenops" no-littering-var-directory))
  :config
  ;; (setq xenops-math-image-scale-factor 1.4)
  (setq xenops-math-image-current-scale-factor 0.6)
  :hook
  latex-mode
  LaTeX-mode
  ;; org-mode
  ;; (xenops-mode . (lambda ()
  ;;                  (advice-remove 'org-fill-paragraph
  ;;                                 #'xenops-math-fill-paragraph-after-advice)))
  )
#+end_src

*** Email
**** mu4e
#+begin_src emacs-lisp
(-setq (my/mu4e-path) (directory-files "~/.nix-profile/share/emacs/site-lisp/elpa"
                                       :full "mu4e-.*"))
#+end_src

Add mu4e manual into Info path.
#+begin_src emacs-lisp
(add-to-list 'Info-directory-list my/mu4e-path)
#+end_src

#+begin_src emacs-lisp :noweb yes
(use-package mu4e
  :load-path my/mu4e-path
  :commands (mu4e mu4e-search)
  :custom
  (mu4e-mu-binary (expand-file-name "~/.nix-profile/bin/mu"))
  <<mu4e-custom>>
  :config
  <<mu4e-config>>
  )
#+end_src

