home/dot_config/emacs/init.el
  (dired-mode . dired-hide-details-mode)
  (dired-mode . hl-line-mode))

(use-package dired-ranger  :ensure t)
(use-package dired-subtree :ensure t)
(use-package dired-narrow  :ensure t)
(use-package dired-open    :ensure t)
(use-package dired-toggle-sudo :ensure t)

(use-package dired-collapse
  :ensure t
  ;; :hook (dired-mode . dired-collapse-mode)
  )

(use-package dired-rainbow
  :ensure t
  :config
  (dired-rainbow-define html "#4e9a06" ("htm" "html" "xhtml"))

  ;; Video files:
  (defconst my/video-files-extensions
    '("mp3" "mp4" "MP3" "MP4" "avi" "mpg" "flv" "ogg" "mkv")
    "Media files.")
  (dired-rainbow-define media "#ce5c00" my/video-files-extensions)

  ;; Highlight executable files, but not directories:
  (dired-rainbow-define-chmod executable-unix "#4e9a06" "-.*x.*"))

(use-package diredfl
  :ensure t
  ;; :config
  ;; (set-face-attribute 'diredfl-dir-name nil :bold t)
  :hook dired-mode
  ;; :hook dirvish-directory-view-mode
  )

(use-package magit
  :ensure t
  :custom
  ; hide ^M characters at the end of a line in diffs
  (magit-diff-hide-trailing-cr-characters t)
  :config
  (define-advice magit-display-buffer-traditional
      (:around (orig-fun buffer) open-status-buffer-in-current-window)
    "Show `magit-status' buffer in current window."
    (if (with-current-buffer buffer
          (equal major-mode 'magit-status-mode))
        (display-buffer buffer '(display-buffer-same-window))
      ;; else
      (funcall orig-fun buffer))))

(use-package git-modes :ensure t)

(use-package forge :ensure t :after magit)

(use-package difftastic
  :ensure t
  ;; :after magit-diff
  :demand t
  :bind (:map magit-blame-read-only-mode-map
              ("D" . difftastic-magit-show)
              ("S" . difftastic-magit-show))
  :config
  (with-eval-after-load 'magit-diff
    (transient-append-suffix 'magit-diff '(-1 -1)
      [("D" "Difftastic diff (dwim)" difftastic-magit-diff)
       ("S" "Difftastic show" difftastic-magit-show)])))

;; (add-to-list 'Info-directory-list (expand-file-name ".nix-profile/share/info"))

(-map (lambda (dir)
        (let ((dir (expand-file-name dir)))
          (when (f-directory? dir)
            (add-to-list 'Info-additional-directory-list dir))))
      '("~/.local/share/info"
        "~/.nix-profile/share/info"))

(use-package info-rename-buffer
  :ensure t
  :after info
  :config (info-rename-buffer-mode))

(use-package inform
  :after info
  :ensure t)

(use-package info-colors
  :ensure t
  :hook (Info-selection . info-colors-fontify-node))

(use-package pdf-tools
  :ensure t
  :config
  ;; Makes Emacs load and use PDF Tools as soon as a PDF file is opened, but not sooner.
  (pdf-loader-install))

(use-package org-pdftools
  :ensure t
  :hook ((org-mode . org-pdftools-setup-link)
         (pdf-view-mode . org-pdftools-setup-link)))

(use-package nov
  :ensure t
  :mode ("\\.epub\\'" . nov-mode)
  :custom (nov-text-width 80)
  :hook ((nov-mode . visual-line-mode)
         ;; (nov-mode . visual-fill-column-mode)
         ))

(use-package fb2-reader
  :ensure t
  :mode ("\\.fb2\\(\\.zip\\)?\\'" . fb2-reader-mode)
  :commands fb2-reader-continue
  :custom
  ;; This mode renders book with fixed width, adjust to your preferences.
  (fb2-reader-page-width 80)
  (fb2-reader-image-max-width 400)
  (fb2-reader-image-max-height 400))

(use-package djvu :ensure t)

(use-package tex
  :ensure auctex
  :init
  (setopt TeX-auto-save t
          TeX-parse-self t)
  (setq-default TeX-master nil))

(use-package xenops
  :ensure t
  :after no-littering
  :init
  (setq xenops-cache-directory (expand-file-name "xenops" no-littering-var-directory))
  :config
  ;; (setq xenops-math-image-scale-factor 1.4)
  (setq xenops-math-image-current-scale-factor 0.6)
  :hook
  latex-mode
  LaTeX-mode
  ;; org-mode
  ;; (xenops-mode . (lambda ()
  ;;                  (advice-remove 'org-fill-paragraph
  ;;                                 #'xenops-math-fill-paragraph-after-advice)))
  )

(-setq (my/mu4e-path) (directory-files "~/.nix-profile/share/emacs/site-lisp/elpa"
                                       :full "mu4e-.*"))

(add-to-list 'Info-directory-list my/mu4e-path)

(use-package mu4e
  :load-path my/mu4e-path
  :commands (mu4e mu4e-search)
  :custom
  (mu4e-mu-binary (expand-file-name "~/.nix-profile/bin/mu"))
