home/dot_config/emacs-old/README.org
***** custom
:PROPERTIES:
:header-args: :noweb-ref mu4e-custom
:END:

Use mu4e for e-mail in emacs.
#+begin_src emacs-lisp
(mail-user-agent 'mu4e-user-agent)
#+end_src

The one with =:favorite t= will be used for the modeline.
#+begin_src emacs-lisp
(mu4e-bookmarks
 `((:name "Inbox"
          ;; :query ,(string-join '("maildir:\"/anuvyklack@gmail/[Gmail]/Вся почта\""
          ;;                        "AND NOT maildir:/anuvyklack@gmail/Архив") " ")
          :query ,(concat "maildir:\"/anuvyklack@gmail/[Gmail]/Вся почта\" "
                          "AND NOT maildir:/anuvyklack@gmail/Архив "
                          "AND NOT flag:list ")
          :key ?i
          :favorite t)
   (:name "Mail lists"
          :query ,(concat "flag:list "
                          "AND maildir:\"/anuvyklack@gmail/[Gmail]/Вся почта\" ")
          ;; :query ,(concat "flag:list "
          ;;                 "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
          ;;                 "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам")
          :key ?l)
   ;; (:name "Unread messages" :query "flag:unread AND NOT flag:trashed" :key ?u)
   (:name "Today's messages"
          :query ,(concat "date:today..now "
                          "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
                          "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам")
          :key ?t)
   (:name "Last 7 days"
          :query ,(concat "date:7d..now "
                          "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
                          "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам ")
          :hide-unread t :key ?w)
   (:name "Archive" :query "maildir:/anuvyklack@gmail/Архив" :key ?a)
   ;; (:name "Messages with images"
   ;;        :query ,(concat "mime:image/*"
   ;;                        "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
   ;;                        "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам ")
   ;;        :key ?p)
   ))
#+end_src

Note that these folders below must start with =/=.
#+begin_src emacs-lisp
(mu4e-refile-folder "/anuvyklack@gmail/Архив")
;; (mu4e-refile-folder "/anuvyklack@gmail/[Gmail]/Вся почта")
(mu4e-sent-folder   "/anuvyklack@gmail/[Gmail]/Отправленные")
(mu4e-drafts-folder "/anuvyklack@gmail/[Gmail]/Черновики")
(mu4e-trash-folder  "/anuvyklack@gmail/[Gmail]/Корзина")
#+end_src

Setup some handy shortcuts you can quickly switch to your Inbox -- press =ji=
then, when you want archive some messages, move them to the =Архив= folder by
pressing =ma=.
#+begin_src emacs-lisp
(mu4e-maildir-shortcuts
 '((:maildir "/anuvyklack@gmail/[Gmail]/Отправленные" :key ?s)
   (:maildir "/anuvyklack@gmail/Архив" :key ?a)
   ;; (:maildir "/anuvyklack@gmail/Inbox" :key ?i)
   (:maildir "/anuvyklack@gmail/[Gmail]/Вся почта" :key ?A)
   (:maildir "/anuvyklack@gmail/[Gmail]/Корзина"   :key ?t)))
#+end_src

#+begin_src emacs-lisp
(mu4e-headers-fields
 '((:human-date . 12)
   (:flags . 6)
   ;; (:mailing-list . 10)
   (:from . 25)
   (:subject)
   ;; (:thread-subject)
   ))
#+end_src

#+begin_src emacs-lisp
;; (mu4e-headers-date-format "%Y/%m/%d")
#+end_src

Don't save message to =Sent Messages=, Gmail/IMAP takes care of this.
#+begin_src emacs-lisp
(mu4e-sent-messages-behavior 'delete)
#+end_src

This is set to ~t~ to avoid mail syncing issues when using =mbsync=. If you use
=offlineimap= this should be set to ~nil~.
#+begin_src emacs-lisp
(mu4e-change-filenames-when-moving t)
#+end_src

Refresh mail using =mbsync= every 10 minutes.
#+begin_src emacs-lisp
(mu4e-update-interval (* 10 60))
#+end_src

Shell command to re-sync mails.
#+begin_src emacs-lisp
(mu4e-get-mail-command "mbsync -a")
#+end_src

Use [[*vertico][vertico]] for completing instead of ido.
#+begin_src emacs-lisp
(mu4e-completing-read-function 'completing-read)
#+end_src

Skip duplicate messages: do not includ more than one in search results.
#+begin_src emacs-lisp
(mu4e-search-skip-duplicates t)
#+end_src

Do not only show the messages that directly match a certain query, but also
include messages that are related to these messages. That is, messages that
belong to the same discussion threads are included in the results, just like
e.g. Gmail does it.
#+begin_src emacs-lisp
(mu4e-search-include-related t)
#+end_src

***** config
:PROPERTIES:
:header-args: :noweb-ref mu4e-config
:END:

#+begin_src emacs-lisp
;; (add-to-list 'mu4e-bookmarks
;;     ;; ':favorite t' i.e, use this one for the modeline
;;    '(:query "maildir:/anuvyklack@gmail/Inbox" :name "Inbox" :key ?i :favorite t))
#+end_src

Not set flag =T= on deletion. Just move to =Trash= folder. [[https://github.com/djcb/mu/issues/1136#issuecomment-1229005006][Source]]
#+begin_src emacs-lisp
(setf (plist-get (alist-get 'trash mu4e-marks) :action)
      (lambda (docid msg target)
        (mu4e--server-move docid (mu4e--mark-check-target target) "-N"))) ; Instead of "+T-N"
#+end_src

****** icons
#+begin_src emacs-lisp
(setq mu4e-use-fancy-chars nil)
#+end_src

Marks for headers. Each is a cons-cell: ~(basic . fancy)~.
#+begin_src emacs-lisp
(setq mu4e-headers-draft-mark     '("D" . "")
      mu4e-headers-flagged-mark   '("F" . "")
      mu4e-headers-new-mark       '("N" . "")
      mu4e-headers-passed-mark    '("P" . "")
      mu4e-headers-replied-mark   '("R" . "")
      mu4e-headers-seen-mark      '("S" . "")
      mu4e-headers-trashed-mark   '("T" . "")
      mu4e-headers-attach-mark    '("a" . "📎")
      mu4e-headers-encrypted-mark '("x" . "")
      mu4e-headers-signed-mark    '("s" . "")
      mu4e-headers-unread-mark    '("u" . "")
      mu4e-headers-list-mark      '("l" . "")
      mu4e-headers-personal-mark  '("p" . "")
      mu4e-headers-calendar-mark  '("c" . ""))
#+end_src

#+begin_src emacs-lisp
;; (setq mu4e-headers-thread-child-prefix           '("├>" . "├─➤ ")
;;       mu4e-headers-thread-last-child-prefix    '("└>" . "└─➤ ")
;;       mu4e-headers-thread-orphan-prefix        '("┬>" . "┬─➤ ")
;;       mu4e-headers-thread-single-orphan-prefix   '("─>" . "──➤ ")
;;       ;; The following two should have the same width.
;;       mu4e-headers-thread-connection-prefix    '("│" . "│ ")
;;       mu4e-headers-thread-blank-prefix           '(" " . " "))
#+end_src

#+begin_src emacs-lisp
(setq mu4e-headers-thread-orphan-prefix        '("◊ " . "◊ ")
      ;; mu4e-headers-thread-single-orphan-prefix '("◊ " . "◊ ")
      mu4e-headers-thread-single-orphan-prefix '("> " . "◊ ")
      mu4e-headers-thread-duplicate-prefix     '("≡ " . "≡ ")
      mu4e-headers-thread-root-prefix          '("□ " . "□ ")
      mu4e-headers-thread-first-child-prefix   '("○ " . "○ ")
      mu4e-headers-thread-child-prefix         '("├╴" . "├╴")
      mu4e-headers-thread-last-child-prefix    '("└╴" . "└╴")
      ;; mu4e-headers-thread-first-child-prefix   '("○ " . "○ ")
      ;; mu4e-headers-thread-child-prefix         '("├>" . "├>")
      ;; mu4e-headers-thread-last-child-prefix    '("└>" . "└>")
      ;; The following two should have the same width.
      mu4e-headers-thread-connection-prefix    '("│ " . "│ ")
      mu4e-headers-thread-blank-prefix         '("  " . "  "))
#+end_src

**** Send emails
#+begin_src emacs-lisp
(use-package smtpmail
  :custom
  (message-send-mail-function 'smtpmail-send-it)
  (starttls-use-gnutls t)
  (smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil)))
  (smtpmail-auth-credentials '(("smtp.gmail.com" 587 "anuvyklack@gmail.com" nil)))
  (smtpmail-default-smtp-server "smtp.gmail.com")
  (smtpmail-smtp-server "smtp.gmail.com")
  (smtpmail-smtp-service 587)

  ;; Don't keep message buffers around.
  (message-kill-buffer-on-exit t))
#+end_src

*** Man
#+begin_src emacs-lisp
(setenv "MANPATH" (shell-command-to-string "manpath"))
#+end_src

*** COMMENT telega
#+begin_src emacs-lisp :noweb yes
(use-package telega
  :ensure t
  :defer t
  :custom
  <<telega-custom>>)
#+end_src
**** custom
:PROPERTIES:
:header-args: :noweb-ref telega-custom
:END:

#+begin_src emacs-lisp
(telega-directory (file-truename "~/.local/share/telega"))
#+end_src

Telega uses Ido completing read function instead of the default one (that the
user prefers). [[https://github.com/zevlg/telega.el/issues/358#issuecomment-1126650770][Source]]
#+begin_src emacs-lisp
(telega-completing-read-function completing-read-function)
#+end_src

*** COMMENT pocket-reader
#+begin_src emacs-lisp
(use-package pocket-reader :ensure t)
#+end_src

** Major modes
*** Tree-sitter (treesit.el)

Manually build tree-sitter grammar: [[elisp:(helpful-function 'treesit-install-language-grammar)][treesit-install-language-grammar]]

Sources to install C and C++ grammar.
#+begin_src emacs-lisp
(setq treesit-language-source-alist
      '((cpp "https://github.com/anuvyklack/tree-sitter-cpp")
        ;; (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
        (c   "https://github.com/tree-sitter/tree-sitter-c")))

(-each treesit-language-source-alist
  (-lambda ((lang url))
    (unless (treesit-language-available-p lang)
      (treesit-install-language-grammar lang))))
#+end_src

#+begin_src emacs-lisp
(setopt treesit-font-lock-level 4)
;; (setopt treesit-extra-load-path )
#+end_src

