home/dot_config/emacs-old/README.org
**** Auto install tree-sitter grammars
#+begin_src emacs-lisp :noweb yes
(use-package treesit-auto
  :ensure t
  :custom
  (treesit-auto-install 'prompt)
  :config
  <<treesit-auto-extra-grammars>>
  ;; (setopt treesit-auto-langs
  ;;         (seq-map #'treesit-auto-recipe-lang treesit-auto-recipe-list))
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))
#+end_src

***** treesit grammars
:PROPERTIES:
:header-args: :noweb-ref treesit-auto-extra-grammars
:END:
Additional grammars to what are packed with =treesit-auto= package.
****** nushell
#+begin_src emacs-lisp
(add-to-list 'treesit-auto-langs 'nu)
(add-to-list 'treesit-auto-recipe-list
             (make-treesit-auto-recipe
              :lang 'nu
              :ts-mode 'nushell-ts-mode
              :url "https://github.com/nushell/tree-sitter-nu"
              :revision "main"
              :source-dir "src"
              :ext "\\.nu\\'"))
#+end_src

****** nix
#+begin_src emacs-lisp
(add-to-list 'treesit-auto-langs 'nix)
(add-to-list 'treesit-auto-recipe-list
             (make-treesit-auto-recipe
              :lang 'nix
              :ts-mode 'nix-ts-mode
              :remap 'nix-mode
              :url "https://github.com/nix-community/tree-sitter-nix"
              :revision "master"
              :source-dir "src"
              :ext "\\.nix\\'"))
#+end_src

****** COMMENT fennel
#+begin_src emacs-lisp
(add-to-list 'treesit-auto-langs 'fennel)
(add-to-list 'treesit-auto-recipe-list
             (make-treesit-auto-recipe
              :lang 'fennel
              :ts-mode 'fennel-ts-mode
              :remap 'fennel-mode
              :url "https://github.com/travonted/tree-sitter-fennel"
              :revision "master"
              :source-dir "src"
              :ext "\\.fnl\\'"))
#+end_src

*** Prog mode
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook
          (lambda ()
            (setq-local show-trailing-whitespace t)))
#+end_src

*** Emacs lisp
#+begin_src emacs-lisp
(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (setq-local tab-width lisp-body-indent
                        evil-shift-width  lisp-body-indent)
            ;; (message "evil-shift-width: %s" evil-shift-width)
            (hs-minor-mode)
            (general-def :keymaps 'local :states 'normal
              "K" 'helpful-at-point ;; 'describe-symbol
              "p" 'my/paste-and-indent-after
              "P" 'my/paste-and-indent-before)))
#+end_src

#+begin_src emacs-lisp
(add-hook 'lisp-data-mode-hook
          (lambda ()
            (general-def :keymaps 'local :states 'normal
              "K" 'helpful-at-point)))
#+end_src

**** COMMENT Skip dash on word movements
#+begin_src emacs-lisp
(defun skip-dash-backward (n &rest foo)
  (if (eq (char-before (point)) ?-)
      (backward-char))
  (message "Skipped dash"))

(defun skip-dash-forward (n &rest foo)
  (if (eq (char-after (point)) ?-)
      (forward-char))
  (message "Skipped dash"))

(defun skip-dash-forward-end (n &rest foo)
  (if (eq (char-after (+ 1 (point))) ?-)
      (forward-char))
  (message "Skipped dash"))

(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (advice-add 'evil-forward-word-begin  :after  #'skip-dash-forward)
            (advice-add 'evil-forward-word-end    :before #'skip-dash-forward-end)
            (advice-add 'evil-backward-word-begin :before #'skip-dash-backward)))
#+end_src

*** Shell mode
#+begin_src emacs-lisp
(setq sh-basic-offset 2
      sh-indentation 2)

;; (add-hook 'sh-mode-hook
;;           (lambda ()
;;             (setq sh-basic-offset 2
;;                   sh-indentation 2)))
#+end_src

*** Dired
#+begin_src emacs-lisp
(add-hook 'dired-mode-hook
          (lambda ()
            (evil-matchit-mode -1)))
#+end_src

*** C/C++
#+begin_src emacs-lisp :noweb yes
(use-package c-ts-mode
  :custom
  (c-ts-mode-indent-offset 4)
  ;; (c-doc-comment-style '((c-mode . gtkdoc)
  ;;                        (c++-mode . doxygen)
  ;;                        (c++-ts-mode . doxygen)))
  :hook
  ((c-ts-mode c++-ts-mode) . (lambda ()
                               ;; (setq electric-indent-inhibit t)
                               (hs-minor-mode)))
  :config
  <<c-ts-mode-config>>
  (c-ts-mode-toggle-comment-style -1))
#+end_src

**** Indentation rules
:PROPERTIES:
:header-args: :noweb-ref c-ts-mode-config
:END:

- [[info:elisp#Parser-based Indentation][Treesitter-based indentation]] documentation to write custom indentation rules. ([[https://www.gnu.org/software/emacs/manual/html_node/elisp/Parser_002dbased-Indentation.html][online]])

- Use ~treesit-explore-mode~ to see where you're at in the treesitter tree.

- Set ~(setq treesit--indent-verbose t)~ to debug which rule is being applied at
  a given point.

#+begin_src emacs-lisp
(defun my/c-ts-indent-style()
  `(;; align function arguments to the start of the first one, offset if standalone
    ((match nil "argument_list" nil 1 1) parent-bol c-ts-mode-indent-offset)
    ((parent-is "argument_list") (nth-sibling 1) 0)
    ;; same for parameters
    ((match nil "parameter_list" nil 1 1) parent-bol c-ts-mode-indent-offset)
    ((parent-is "parameter_list") (nth-sibling 1) 0)
    ;; indent inside case blocks
    ((parent-is "case_statement") standalone-parent c-ts-mode-indent-offset)
    ;; do not indent preprocessor statements
    ((node-is "preproc") column-0 0)
    ;; do not add indentation level for namespace
    ((n-p-gp nil nil "namespace_definition") grand-parent 0)
    ;; append to bsd style
    ,@(alist-get 'bsd (c-ts-mode--indent-styles 'cpp))))

(setopt c-ts-mode-indent-style #'my/c-ts-indent-style)
#+end_src

*** CMake
- [[https://github.com/Kitware/CMake/blob/master/Auxiliary/cmake-mode.el][cmake-mode.el]]

#+begin_src emacs-lisp
(use-package cmake-mode :ensure t)
#+end_src

*** Org mode
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
          (lambda ()
            (setq fill-column 80) ;; set textwidth to 80
            ;; (display-line-numbers-mode -1)
            (auto-revert-mode) ;; обновлять буфер, если файл изменился
            (auto-fill-mode) ;; hard wrap long lines
            (my/org-icons)
            ;; (setq-local tab-width 2)
            (setq-local evil-shift-width 2)
            (general-def :keymaps 'local :states 'normal
              "SPC f i" 'consult-org-heading)))
#+end_src

*** Fennel
- [[https://git.sr.ht/~technomancy/fennel-mode][~technomancy/fennel-mode]]

#+begin_src emacs-lisp
(use-package fennel-mode
  :ensure t
  :mode "\\.fnl\\'")
#+end_src

*** Fish
#+begin_src emacs-lisp
(use-package fish-mode :ensure t)
#+end_src

*** Lemon (parser)
#+begin_src emacs-lisp
(use-package lemon-mode
  :ensure t
  :mode ("\\.y\\'" . lemon-c++-mode))
#+end_src

*** Lua
#+begin_src emacs-lisp
(use-package lua-mode
  :ensure t
  :config
  (add-hook 'lua-mode-hook
            (lambda ()
              (setq-local tab-width 3
                          evil-shift-width 3))))
#+end_src

*** Markdown-mode
#+begin_src emacs-lisp
(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode) ;; Github Flavored Markdown
  :hook (gfm-mode . visual-line-mode)
        (markdown-mode . (lambda ()
                           ;; (markdown-toggle-url-hiding 1)
                           (auto-revert-mode) ;; обновлять буфер, если файл изменился
                           (setq-local tab-width 2
                                       evil-shift-width 2)))
  :custom
  ;; Command to convert plain text to HTML
  (markdown-command '("pandoc" "--from=markdown" "--to=html5"))
  ;; Command to call standalone Markdown previewer
  (markdown-open-command nil)
  ;; Command to open image link via `markdown-follow-*' commands
  (markdown-open-image-command nil)
  (markdown-asymmetric-header nil)
  (markdown-marginalize-headers t)
  (markdown-list-indent-width 2)
  (markdown-enable-wiki-links t)
  (markdown-wiki-link-alias-first nil)
  ;; (markdown-wiki-link-fontify-missing t)
  ;; (markdown-wiki-link-search-type 'project)
  (markdown-enable-math t)
  (markdown-link-space-sub-char " ")
  (markdown-reference-location 'subtree)
  ;; (markdown-hide-markup t)
  (markdown-hide-urls t)
  ;; (markdown-hr-display-char)
  (markdown-list-item-bullets)
  (markdown-fontify-code-blocks-natively t)
  ;; (markdown-code-lang-modes)
  (markdown-gfm-uppercase-checkbox t)
  (markdown-enable-highlighting-syntax t))
#+end_src

**** evil-markdown
#+begin_src emacs-lisp
(use-package evil-markdown
  :vc (:fetcher github :repo "Somelauw/evil-markdown")
  :after (evil markdown-mode))
#+end_src

*** Nix
**** COMMENT nix-mode
- [[https://github.com/NixOS/nix-mode][NixOS/nix-mode]]

#+begin_src emacs-lisp
(use-package nix-mode
  :ensure t
  :mode "\\.nix\\'")
#+end_src

**** nix-ts-mode
- [[https://github.com/remi-gelinas/nix-ts-mode][remi-gelinas/nix-ts-mode]]

#+begin_src emacs-lisp
(use-package nix-ts-mode
  :ensure t
  :mode "\\.nix\\'"
  :config
  (add-hook 'nix-ts-mode-hook
            (lambda()
              (setq-local evil-shift-width  nix-ts-mode-indent-offset))))
#+end_src

*** COMMENT Nushell
#+begin_src emacs-lisp
(use-package nushell-ts-mode
  :vc (:fetcher github :repo "herbertjones/nushell-ts-mode"))
#+end_src

*** PlantUML
#+begin_src emacs-lisp
(use-package plantuml-mode
  :ensure t
  :custom
  (plantuml-jar-path (expand-file-name "~/.nix-profile/lib/plantuml.jar"))
  (plantuml-default-exec-mode 'executable))
#+end_src

*** Python
#+begin_src emacs-lisp
(add-hook 'python-mode-hook
          (lambda ()
            ;; (setq-local evil-shift-width  python-indent-offset)
            ))
#+end_src

