home/dot_config/emacs/init.el

(use-package treesit-auto
  :ensure t
  :custom
  (treesit-auto-install 'prompt)
  :config
  (add-to-list 'treesit-auto-langs 'nu)
  (add-to-list 'treesit-auto-recipe-list
               (make-treesit-auto-recipe
                :lang 'nu
                :ts-mode 'nushell-ts-mode
                :url "https://github.com/nushell/tree-sitter-nu"
                :revision "main"
                :source-dir "src"
                :ext "\\.nu\\'"))
  (add-to-list 'treesit-auto-langs 'nix)
  (add-to-list 'treesit-auto-recipe-list
               (make-treesit-auto-recipe
                :lang 'nix
                :ts-mode 'nix-ts-mode
                :remap 'nix-mode
                :url "https://github.com/nix-community/tree-sitter-nix"
                :revision "master"
                :source-dir "src"
                :ext "\\.nix\\'"))
  ;; (setopt treesit-auto-langs
  ;;         (seq-map #'treesit-auto-recipe-lang treesit-auto-recipe-list))
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))

(add-hook 'prog-mode-hook
          (lambda ()
            (setq-local show-trailing-whitespace t)))

(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (setq-local tab-width lisp-body-indent
                        evil-shift-width  lisp-body-indent)
            ;; (message "evil-shift-width: %s" evil-shift-width)
            (hs-minor-mode)
            (general-def :keymaps 'local :states 'normal
              "K" 'helpful-at-point ;; 'describe-symbol
              "p" 'my/paste-and-indent-after
              "P" 'my/paste-and-indent-before)))

(add-hook 'lisp-data-mode-hook
          (lambda ()
            (general-def :keymaps 'local :states 'normal
              "K" 'helpful-at-point)))

(setq sh-basic-offset 2
      sh-indentation 2)

;; (add-hook 'sh-mode-hook
;;           (lambda ()
;;             (setq sh-basic-offset 2
;;                   sh-indentation 2)))

(add-hook 'dired-mode-hook
          (lambda ()
            (evil-matchit-mode -1)))

(use-package c-ts-mode
  :custom
  (c-ts-mode-indent-offset 4)
  ;; (c-doc-comment-style '((c-mode . gtkdoc)
  ;;                        (c++-mode . doxygen)
  ;;                        (c++-ts-mode . doxygen)))
  :hook
  ((c-ts-mode c++-ts-mode) . (lambda ()
                               ;; (setq electric-indent-inhibit t)
                               (hs-minor-mode)))
  :config
  (defun my/c-ts-indent-style()
    `(;; align function arguments to the start of the first one, offset if standalone
      ((match nil "argument_list" nil 1 1) parent-bol c-ts-mode-indent-offset)
      ((parent-is "argument_list") (nth-sibling 1) 0)
      ;; same for parameters
      ((match nil "parameter_list" nil 1 1) parent-bol c-ts-mode-indent-offset)
      ((parent-is "parameter_list") (nth-sibling 1) 0)
      ;; indent inside case blocks
      ((parent-is "case_statement") standalone-parent c-ts-mode-indent-offset)
      ;; do not indent preprocessor statements
      ((node-is "preproc") column-0 0)
      ;; do not add indentation level for namespace
      ((n-p-gp nil nil "namespace_definition") grand-parent 0)
      ;; append to bsd style
      ,@(alist-get 'bsd (c-ts-mode--indent-styles 'cpp))))
  
  (setopt c-ts-mode-indent-style #'my/c-ts-indent-style)
  (c-ts-mode-toggle-comment-style -1))

(use-package cmake-mode :ensure t)

(add-hook 'org-mode-hook
          (lambda ()
            (setq fill-column 80) ;; set textwidth to 80
            ;; (display-line-numbers-mode -1)
            (auto-revert-mode) ;; обновлять буфер, если файл изменился
            (auto-fill-mode) ;; hard wrap long lines
            (my/org-icons)
            ;; (setq-local tab-width 2)
            (setq-local evil-shift-width 2)
            (general-def :keymaps 'local :states 'normal
              "SPC f i" 'consult-org-heading)))

(use-package fennel-mode
  :ensure t
  :mode "\\.fnl\\'")

(use-package fish-mode :ensure t)

(use-package lemon-mode
  :ensure t
  :mode ("\\.y\\'" . lemon-c++-mode))

(use-package lua-mode
  :ensure t
  :config
  (add-hook 'lua-mode-hook
            (lambda ()
              (setq-local tab-width 3
                          evil-shift-width 3))))

(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode) ;; Github Flavored Markdown
  :hook (gfm-mode . visual-line-mode)
        (markdown-mode . (lambda ()
                           ;; (markdown-toggle-url-hiding 1)
                           (auto-revert-mode) ;; обновлять буфер, если файл изменился
                           (setq-local tab-width 2
                                       evil-shift-width 2)))
  :custom
  ;; Command to convert plain text to HTML
  (markdown-command '("pandoc" "--from=markdown" "--to=html5"))
  ;; Command to call standalone Markdown previewer
  (markdown-open-command nil)
  ;; Command to open image link via `markdown-follow-*' commands
  (markdown-open-image-command nil)
  (markdown-asymmetric-header nil)
  (markdown-marginalize-headers t)
  (markdown-list-indent-width 2)
  (markdown-enable-wiki-links t)
  (markdown-wiki-link-alias-first nil)
  ;; (markdown-wiki-link-fontify-missing t)
  ;; (markdown-wiki-link-search-type 'project)
  (markdown-enable-math t)
  (markdown-link-space-sub-char " ")
  (markdown-reference-location 'subtree)
  ;; (markdown-hide-markup t)
  (markdown-hide-urls t)
  ;; (markdown-hr-display-char)
  (markdown-list-item-bullets)
  (markdown-fontify-code-blocks-natively t)
  ;; (markdown-code-lang-modes)
  (markdown-gfm-uppercase-checkbox t)
  (markdown-enable-highlighting-syntax t))

(use-package evil-markdown
  :vc (:fetcher github :repo "Somelauw/evil-markdown")
  :after (evil markdown-mode))

(use-package nix-ts-mode
  :ensure t
  :mode "\\.nix\\'"
  :config
  (add-hook 'nix-ts-mode-hook
            (lambda()
              (setq-local evil-shift-width  nix-ts-mode-indent-offset))))

(use-package plantuml-mode
  :ensure t
  :custom
  (plantuml-jar-path (expand-file-name "~/.nix-profile/lib/plantuml.jar"))
  (plantuml-default-exec-mode 'executable))

(add-hook 'python-mode-hook
          (lambda ()
            ;; (setq-local evil-shift-width  python-indent-offset)
            ))
