home/dot_config/emacs-old/README.org
*** Yaml
#+begin_src emacs-lisp
(use-package yaml-ts-mode
  :mode
  ("\\.yml\\'" . yaml-ts-mode)
  ("\\.yaml\\'" . yaml-ts-mode)
  ("clang.format\\'" . yaml-ts-mode))
#+end_src

**** COMMENT yaml-pro
#+begin_src emacs-lisp
(use-package yaml-pro
  :ensure t
  :hook (yaml-ts-mode . yaml-pro-ts-mode))
#+end_src

*** xkb-mode
#+begin_src emacs-lisp
(use-package xkb-mode :ensure t)
#+end_src

*** COMMENT Options for =init.el= file
#+begin_src emacs-lisp
(add-hook 'find-file-hook
          (lambda ()
            (when (string-equal (buffer-file-name) user-init-file)
              ;; (outline-minor-mode 1)
              (general-def :keymaps 'global :states 'normal
                "zj" 'origami-forward-fold
                "zk" 'origami-previous-fold))))
#+end_src

** Custom commands
*** narrow-to-active-region
#+begin_src emacs-lisp
(defun my/narrow-to-active-region ()
  (interactive)
  (narrow-to-region (region-beginning)
                    (region-end))
  (evil-exit-visual-state))
#+end_src

*** dired-open-file
#+begin_src emacs-lisp
(defun my/dired-xdg-open ()
  "In a dired buffer, open file or folder on the current line with `xdg-open'
shell command."
  (interactive)
  (let ((file (dired-get-filename nil t)))
    (call-process "xdg-open" nil 0 nil file)))
#+end_src

*** COMMENT ansi-color
#+begin_src emacs-lisp
(require 'ansi-color)
(defun display-ansi-colors ()
  (interactive)
  (ansi-color-apply-on-region (point-min) (point-max)))
#+end_src

*** toggle line spacing
- [[http://xahlee.info/emacs/emacs/emacs_toggle_line_spacing.html][Source]]
#+begin_src emacs-lisp
(defun my/toggle-line-spacing ()
  "Toggle line spacing between no extra space to extra 0.2 line height."
  (interactive)
  (if line-spacing
      (setq line-spacing nil)
    (setq line-spacing (default-value 'line-spacing)))
  (redraw-frame (selected-frame)))
#+end_src

*** Copy current file path and line-position to clipboard
#+begin_src emacs-lisp
(defun my/copy-file-current-line-position-to-clipboard ()
  "Copy current line in file to clipboard as '</path/to/file>:<line-number>'"
  (interactive)
  (let* ((path (if (equal current-prefix-arg '(4))
                   (string-replace (getenv "HOME") "~" (buffer-file-name))
                 (buffer-file-name)))
         (path-with-line-number (concat path ":" (number-to-string (line-number-at-pos)))))
    (kill-new path-with-line-number)
    (message path-with-line-number)))
#+end_src

#+begin_src emacs-lisp
(defun my/copy-file-org-link-to-clipboard ()
  "Copy current line in file to clipboard as 'file:</path/to/file>::<line-number>'"
  (interactive)
  (let ((path-with-line-number
         (concat "file:" (buffer-file-name) "::" (number-to-string (line-number-at-pos)))))
    (kill-new path-with-line-number)
    (message (concat path-with-line-number " copied to clipboard"))))
#+end_src

** Keybindings
*** Keymaps
#+begin_src emacs-lisp
(define-prefix-command 'leader-map)
(define-prefix-command 'semicolon-leader-map)
(define-prefix-command 'my/bookmark-map)
(define-prefix-command 'my/orgmode-leader-map)
(define-prefix-command 'my/obsidian-map)
(define-prefix-command 'my/notes-map)
#+end_src

*** Which-key descriptions
ZZ 'evil-save-modified-and-close

**** misc
#+begin_src emacs-lisp
(my/which-key-set-command-description
 'my/narrow-to-active-region "narrow to region"
 'narrow-to-region           "narrow to region")
#+end_src

**** evil
#+begin_src emacs-lisp
(my/which-key-set-command-description
 'evil-scroll-line-to-top    "scroll line to top"
 'evil-scroll-line-to-center "scroll line to center"
 'evil-scroll-line-to-bottom "scroll line to bottom"
 'evil-scroll-bottom-line-to-top "scroll line to top"
 'evil-scroll-top-line-to-bottom "scroll line to bottom"
 'evil-scroll-line-to-top-first-non-blank    "scroll line to top"
 'evil-scroll-line-to-bottom-first-non-blank "scroll line to bottom"
 'evil-scroll-line-to-center-first-non-blank "scroll line to center"
 'evil-first-non-blank       "start of line"
 'evil-end-of-line           "end of line"
 'evil-org-beginning-of-line "start of line"
 'evil-org-end-of-line       "end of line"
 'evil-open-fold             "open fold"
 'evil-close-fold            "close fold"
 'evil-open-fold-rec         "open fold recursively")

(my/which-key-set-command-description
 'evil-collection-unimpaired-insert-newline-above "insert newline above"
 'evil-collection-unimpaired-insert-newline-below "insert newline below"
 'evil-next-mark-line         "next mark line"
 'evil-previous-mark-line     "prev mark line"
 'evil-next-mark              "next mark"
 'evil-previous-mark          "previous mark"
 'evil-next-buffer            "next buffer"
 'evil-prev-buffer            "previous buffer"
 'evil-forward-section-begin  "forward section"
 'evil-backward-section-begin "backward section")
#+end_src

**** org-mode
#+begin_src emacs-lisp
(my/which-key-set-command-description
 'outline-up-heading             "up heading"
 'outline-show-subtree           "show subtree"
 'outline-hide-entry             "hide entry"
 'outline-hide-other             "hide all other"
 'outline-hide-body              "hide all bodies")

(my/which-key-set-command-description
 'org-ctrl-c-ctrl-c              "C-c C-c"
 'org-toggle-comment             "comment subtree"
 'org-sparse-tree                "sparce tree"
 'org-insert-structure-template  "structure template"
 'org-narrow-to-subtree          "narrow to subtree"
 'org-table-create-or-convert-from-region "table"
 'org-id-get-create              "create ID"
 'org-set-property               "set subtree property"
 'org-babel-insert-header-arg    "set src block header"
 'org-footnote-action            "footnote"
 'org-insert-link                "insert link"
 'org-deadline                   "deadline"
 'org-schedule                   "schedule"
 'org-time-stamp                 "time stamp"
 'org-time-stamp-inactive        "inactive time stamp"
 'org-cliplink                   "URL form clipboard"
 'org-attach                     "attachment"
 'org-agenda-file-to-front       "add file to agenda"
 'org-remove-file                "remove file from agenda"
 'org-next-link                  "next link"
 'org-previous-link              "previous link"
 'org-next-visible-heading       "next heading"
 'org-previous-visible-heading   "prev heading"
 'org-kill-note-or-show-branches "show subtree headings")
#+end_src

*** General keybindings
**** universal-argument
#+begin_src emacs-lisp
(general-def :keymaps 'universal-argument-map
  "M-u" 'universal-argument-more)
#+end_src

**** evil
#+begin_src emacs-lisp
(general-def :states 'motion
  "M-u" 'universal-argument
  "SPC" '(:keymap leader-map)
  ";"   '(:keymap semicolon-leader-map)
  "<backspace>"     'execute-extended-command ; emacs M-x
  "C-<backspace>"   'vertico-repeat
  "C-S-<backspace>" 'vertico-repeat-select
  "gh"  'evil-first-non-blank
  "gl"  'evil-end-of-line
  ;; "gb"  'ibuffer-jump
  "gb"  'bufler
  "C-s" 'evil-write
  "C-p" 'consult-yank-from-kill-ring
  "-"   'dired-jump
  "/"   'consult-line
  "?"   'evil-search-forward
  "zn"  'narrow-to-region
  "zw"  'widen
  "z="  'flyspell-correct-wrapper
  "g <tab>"     'tab-new
  "g <backtab>" 'tab-bar-move-window-to-tab
  "C-<tab>"     'tab-next
  "C-<backtab>" 'tab-previous)

(general-def :states 'normal
  "ga" 'describe-char)

(general-def :states '(normal visual)
  "C-p" 'consult-yank-from-kill-ring)

(general-def :states 'visual
  "zn" 'my/narrow-to-active-region)

(general-def :states '(replace insert)
  "C-<backspace>" 'evil-delete-backward-word)

(general-def :states 'insert
  "C-l" 'right-char
  "C-S-t" 'indent-relative
  "M-t" 'indent-relative)
#+end_src

**** COMMENT Invoke =C-w= (~evil-window-map~) as hydra head
- [[https://github.com/abo-abo/hydra/issues/335][Source]]
#+begin_src emacs-lisp
(eval
 `(defhydra hydra-evil-window-map (:columns 2)
    ,@(mapcar (lambda (x)
                (list (car x) (intern (cdr x)) (cdr x)))
              (which-key--get-keymap-bindings evil-window-map))
    ("q" nil "quit")))

(general-def :states 'normal
  "C-w" 'hydra-evil-window-map/body)
#+end_src

**** help system
#+begin_src emacs-lisp
(general-def :keymaps 'help-map
  "s" 'info-lookup-symbol
  "M" 'describe-keymap)
#+end_src

*** Leader map
#+begin_src emacs-lisp
(general-def :keymaps 'leader-map
  ":" 'eval-expression
  ;; "h"  '(:keymap help-map :wk "help")
  ;; "p"  '(:keymap projectile-command-map :wk "projectile prefix")
  "p"  '("projectile" . projectile-command-map)
  "n"  '("notes" . my/notes-map)
  "m"  '("bookmark" . my/bookmark-map)
  ;; "o"  '("obsidian" . my/obsidian-map)
  "oo" 'obsidian-jump
  "oc" 'obsidian-capture
  "b"  'consult-buffer
  "ff" 'find-file
  ;; "fF" 'affe-find
  ;; "fzf" 'fzf
  "fzf" 'my/fzf-curdir
  "fzh" 'my/fzf-home
  "fo" 'consult-outline
  "fg" 'consult-ripgrep
  "fi" 'consult-imenu
  "fr" 'consult-recent-file
  "fd" 'consult-dir
  "fb" 'consult-bookmark
  ;; "fv" 'vertico-repeat-select ; v for vertico
  "4f" 'find-file-other-window)
#+end_src

