home/dot_config/emacs-old/README.org
*** Minibuffer
#+begin_src emacs-lisp
(general-def :keymaps 'minibuffer-local-map
  "C-h" 'backward-kill-word)
#+end_src

**** Vertico
#+begin_src emacs-lisp
(with-eval-after-load 'vertico
  (general-def :keymaps 'vertico-map :states '(normal visual)
    "C-j" 'vertico-next
    "C-k" 'vertico-previous
    "C-l" 'vertico-insert
    "<tab>" 'vertico-insert
    "n"   'vertico-next-group
    "N"   'vertico-previous-group
    "C-f" 'vertico-scroll-up
    "C-b" 'vertico-scroll-down
    "C-d" 'consult-dir
    ;; "C-j" 'consult-dir-jump-file
    "C-p" 'consult-yank-from-kill-ring
    "gg" 'vertico-first
    "G"  'vertico-last
    "q"  'abort-recursive-edit)

  (general-def :keymaps 'vertico-map :states 'insert
    "C-y" 'yank
    "C-j" 'vertico-next
    "C-k" 'vertico-previous
    "C-l" 'vertico-insert
    "<tab>" 'vertico-insert
    "C-d" 'consult-dir
    "C-n" 'vertico-next-group
    "C-p" 'vertico-previous-group
    "C-f" 'vertico-scroll-up
    "C-b" 'vertico-scroll-down)

  ;; More convenient directory navigation commands
  (general-def :keymaps 'vertico-map :states 'insert
    "<return>" 'vertico-directory-enter
    "<backspace>" 'vertico-directory-delete-char
    "C-<backspace>" 'vertico-directory-delete-word)

  ;; Russian
  (general-def :keymaps 'vertico-map :states 'insert
    "C-о" 'vertico-next
    "C-л" 'vertico-previous))
#+end_src

**** Marginalia
#+begin_src emacs-lisp
(general-def :keymaps 'minibuffer-local-map :states '(motion insert)
  "M-a" 'marginalia-cycle)
#+end_src

*** Lisp structural editing
#+begin_src emacs-lisp
(general-def :keymaps 'evil-cleverparens-mode-map :states '(normal visual)
  ")"   'my/evil-cp-up-sexp
  "["    nil  ; unbind `evil-cp-previous-opening' in favor of unimpaired
  "]"    nil  ; unbind `evil-cp-next-closing' in favor of unimpaired
  "C-(" 'evil-cp-backward-up-sexp
  "C-)" 'my/evil-cp-up-sexp
  "M-w" 'my/evil-cp-forward-sexp
  "M-b" 'my/evil-cp-backward-sexp
  "L"   'my/evil-cp-forward-sexp
  "H"   'my/evil-cp-backward-sexp
  ",w"  'evil-cp-wrap-next-round
  ",W"  'evil-cp-wrap-previous-round
  ",b"  'evil-cp-wrap-next-square
  ",B"  'evil-cp-wrap-previous-square
  ",f"  'evil-cp-wrap-next-curly
  ",F"  'evil-cp-wrap-previous-curly)
#+end_src

*** Bufler
#+begin_src emacs-lisp
(general-def :keymaps 'bufler-list-mode-map :states 'normal
  "<return>" 'bufler-list-buffer-switch
  "C-s" 'bufler-list-buffer-save
  "gr" '(bufler :wk "refresh")
  "d" 'bufler-list-buffer-kill
  "x" 'bufler-list-buffer-kill
  "W" 'bufler-list-buffer-peek
  "?" 'hydra:bufler/body)
#+end_src

#+begin_src emacs-lisp
(my/which-key-set-command-description
 'bufler-list-buffer-switch "switch to buffer"
 'bufler-list-buffer-save   "save buffer"
 'bufler-list-buffer-kill   "kill buffer")
#+end_src

*** Folds
#+begin_src emacs-lisp
;; (general-def :keymaps 'hs-minor-mode-map :states 'normal
;;   "zM" 'hs-hide-level)

(add-hook 'hs-minor-mode-hook
          (lambda ()
            (general-def :keymaps 'local :states 'normal
              "zM" 'hs-hide-level)))
#+end_src

*** Bookmarks
#+begin_src emacs-lisp
(general-def :keymaps 'my/bookmark-map
  "m" 'consult-bookmark
  "n" 'bookmark-set
  "d" 'bookmark-delete
  "l" 'bookmark-bmenu-list)
#+end_src

#+begin_src emacs-lisp
(my/which-key-set-command-description
 'bookmark-bmenu-list "bookmarks list")
#+end_src

*** Dired
**** COMMENT Dirvish
#+begin_src emacs-lisp
(general-def :keymaps 'dired-mode-map :states 'normal
  [remap dired]                     'dirvish-dwim
  [remap dired-sort-toggle-or-edit] 'dirvish-quicksort
  [remap dired-do-redisplay]        'dirvish-ls-switches-menu
  [remap dired-do-copy]             'dirvish-yank-menu
  "<mouse-1>" 'dirvish-subtree-toggle-or-open ;; Left click for expand/collapse dir or open file
  "<mouse-2>" 'dired-mouse-find-file-other-window ;; middle click for opening file / entering dir in other window
  "<mouse-3>" 'dired-mouse-find-file ;; right click for opening file / entering dir
  "<tab>" 'dirvish-toggle-subtree
  "<backspace>" 'dired-up-directory
  "l"   'dired-find-file
  "h"   'dired-up-directory
  "f"   'find-file
  "gh"  'dired-home-directory
  "C-o" 'dirvish-history-go-backward
  "C-i" 'dirvish-history-go-forward
  "q"   'dirvish-quit
  "?"   'dirvish-dispatch
  "gb"  '(dirvish-ibuffer :which-key "ibuffer")
  "a"   'dirvish-quick-access
  "p"   'dirvish-yank-menu
  "s"   'dirvish-quicksort
  "w"   'dirvish-layout-toggle
  "<"   'dired-prev-marked-file
  ">"   'dired-next-marked-file
  "gh"  'dirvish-history-jump)

(general-def :keymaps 'dired-mode-map :states 'visual
  "d" 'dired-flag-file-deletion
  "u" 'dired-unmark)

(general-def :keymaps 'dired-mode-map :states 'normal
  :prefix "SPC"
  "n" 'dirvish-narrow
  "m" 'dirvish-mark-menu
  "s" 'dirvish-setup-menu
  "e" 'dirvish-emerge-menu
  "l" 'dired-launch-command
  "f" '(nil :which-key t))
#+end_src

#+begin_src emacs-lisp :tangle no
"C-c f" 'dirvish-fd
"f"   'dirvish-file-info-menu
"y"   'dirvish-yank-menu
"N"   'dirvish-narrow
"^"   'dirvish-history-last
"h"   'dirvish-history-jump ; remapped `describe-mode'
"s"   'dirvish-quicksort    ; remapped `dired-sort-toggle-or-edit'
"v"   'dirvish-vc-menu      ; remapped `dired-view-file'
"TAB" 'dirvish-subtree-toggle
"M-f" 'dirvish-history-go-forward
"M-b" 'dirvish-history-go-backward
"M-l" 'dirvish-ls-switches-menu
"M-m" 'dirvish-mark-menu
"M-t" 'dirvish-layout-toggle
"M-s" 'dirvish-setup-menu
"M-e" 'dirvish-emerge-menu
"M-j" 'dirvish-fd-jump
#+end_src

#+begin_src emacs-lisp
(defun dirvish-ibuffer ()
  (interactive)
  (dirvish-quit)
  (ibuffer))
#+end_src

**** dired
#+begin_src emacs-lisp
(general-def :keymaps 'dired-mode-map :states 'normal
  "SPC" '(:keymap leader-map)
  "<backspace>" 'execute-extended-command ;; emacs M-x
  "l" 'dired-find-file
  "h" 'dired-up-directory
  "f" 'find-file
  "r" 'dired-do-rename
  "y" 'dired-ranger-copy
  ;; "Y" 'dired-copy-filename-as-kill
  "p" 'dired-ranger-paste
  "P" 'dired-ranger-move
  "w" 'dired-display-file
  ")" 'dired-omit-mode
  "<" 'dired-prev-marked-file
  ">" 'dired-next-marked-file
  "s" 'dired-narrow-fuzzy
  "S" 'dired-narrow-regexp
  "." 'hydra-dired/body
  "M-<return>" 'my/dired-xdg-open)

(general-def :keymaps 'dired-mode-map :states 'visual
  "d" 'dired-flag-file-deletion
  "u" 'dired-unmark)
#+end_src

***** dired subtree
#+begin_src emacs-lisp
(general-def :keymaps 'dired-mode-map :states 'normal
  "<tab>"     'dired-subtree-toggle
  "<backtab>" 'dired-subtree-cycle
  "zk" 'dired-subtree-up
  "zj" 'dired-subtree-down
  "C-j" 'dired-subtree-next-sibling
  "C-k" 'dired-subtree-previous-sibling)
#+end_src

***** dired hydra
#+begin_src emacs-lisp
(defhydra hydra-dired (:hint nil :color pink)
  "
_Y_ rel symlink    _O_pen marked
_S_ymlink          _n_ narrow
_z_ compress-file  _m_ chmod       _s_ort             _E_ ediff
_Z_ compress       _g_ chgrp       _e_xtension mark   _=_ pdiff
"
  ("+" dired-maybe-create-dirs)
  ("=" diredp-ediff) ;; smart diff
  ("e" dired-mark-extension)
  ("E" dired-ediff-files)
  ("g" dired-do-chgrp)
  ("m" dired-do-chmod)
  ("n" dired-narrow)
  ("O" dired-do-find-marked-files) ;; open in Emacs all marked files
  ;; ("o" dired-display-file)
  ;; ("r" dired-do-rsynch)
  ("S" dired-do-symlink)
  ("s" dired-sort-toggle-or-edit)
  ("Y" dired-do-relsymlink)
  ("z" diredp-compress-this-file)
  ("Z" dired-do-compress)
  ("q" nil)
  ("." nil :color blue)
  ("<escape>" nil :color blue))
#+end_src

*** Project.el & Projectile
#+begin_src emacs-lisp
(general-def :keymaps 'projectile-command-map
  "I" 'projectile-project-info
  "B" 'projectile-ibuffer)
  #+end_src

#+begin_src emacs-lisp
(my/which-key-set-command-description
 'projectile-project-info "project info")
#+end_src

*** LSP
