home/dot_config/emacs-old/README.org
**** COMMENT lsp-mode
#+begin_src emacs-lisp
(with-eval-after-load 'lsp-mode
  (define-prefix-command 'lsp-mode-leader-map)
  (general-def :keymaps 'lsp-mode-leader-map
    "hh" '(lsp-document-highlight
           :predicate (lsp-feature? "textDocument/documentHighlight"))
    "hs" '(lsp-signature-activate
           :predicate (lsp-feature? "textDocument/signatureHelp"))
    ;;; goto
    "ga" '(xref-find-apropos
           :predicate (lsp-feature? "workspace/symbol"))
    "gd" '(lsp-find-declaration
           :predicate (lsp-feature? "textDocument/declaration"))
    "ge" '(lsp-treemacs-errors-list
           :predicate (fboundp 'lsp-treemacs-errors-list))
    "gg" '(lsp-find-definition
           :predicate (lsp-feature? "textDocument/definition"))
    "gh" '(lsp-treemacs-call-hierarchy
           :predicate (and (lsp-feature? "callHierarchy/incomingCalls")
                           (fboundp 'lsp-treemacs-call-hierarchy)))
    "gi" '(lsp-find-implementation
           :predicate (lsp-feature? "textDocument/implementation"))
    "gr" '(lsp-find-references
           :predicate (lsp-feature? "textDocument/references"))
    "gt" '(lsp-find-type-definition
           :predicate (lsp-feature? "textDocument/typeDefinition"))
    ;;; refactoring
    "rr" '(lsp-rename
           :predicate (lsp-feature? "textDocument/rename"))
    "ro" '(lsp-organize-imports
           :predicate (lsp-feature? "textDocument/codeAction"))
    ;;; actions
    "aa" '(lsp-execute-code-action
           :predicate (lsp-feature? "textDocument/codeAction"))
    "al" '(lsp-avy-lens
           :predicate (featurep 'avy))
    ;;; peeks
    "Gg" '(lsp-ui-peek-find-definitions
           :predicate (and (lsp-feature? "textDocument/definition")
                           (fboundp 'lsp-ui-peek-find-definitions)))
    "Gi" '(lsp-ui-peek-find-implementation
           :predicate (and (fboundp 'lsp-ui-peek-find-implementation)
                           (lsp-feature? "textDocument/implementation")))
    "Gr" '(lsp-ui-peek-find-references
           :predicate (and (fboundp 'lsp-ui-peek-find-references)
                           (lsp-feature? "textDocument/references")))
    "Gs" '(lsp-ui-peek-find-workspace-symbol
           :predicate (and (fboundp 'lsp-ui-peek-find-workspace-symbol)
                           (lsp-feature? "workspace/symbol")))
    ;;; formatting
    "=" '(lsp-format-buffer
          :predicate (or (lsp-feature? "textDocument/rangeFormatting")
                         (lsp-feature? "textDocument/formatting")))
    ;;; toggles
    "tL" 'lsp-toggle-trace-io
    "tS" '(lsp-ui-sideline-mode
           :predicate (featurep 'lsp-ui-sideline))
    "tT" '(lsp-treemacs-sync-mode
           :predicate (featurep 'lsp-treemacs))
    "ta" '(lsp-modeline-code-actions-mode
           :predicate (lsp-feature? "textDocument/codeAction"))
    "tb" '(lsp-headerline-breadcrumb-mode
           :predicate (lsp-feature? "textDocument/documentSymbol"))
    "td" '(lsp-ui-doc-mode
           :predicate (featurep 'lsp-ui-doc))
    "tf" '(lsp-toggle-on-type-formatting
           :predicate (lsp-feature? "textDocument/onTypeFormatting"))
    "th" '(lsp-inlay-hints-mode
           :predicate (lsp-feature? "textDocument/inlayHint"))
    "tH" '(lsp-toggle-symbol-highlight
           :predicate (lsp-feature? "textDocument/documentHighlight"))
    "tl" '(lsp-lens-mode
           :predicate (lsp-feature? "textDocument/codeLens"))
    "ts" '(lsp-toggle-signature-auto-activate
           :predicate (lsp-feature? "textDocument/signatureHelp"))
    ;;; workspaces
    "wD" 'lsp-disconnect
    "wd" 'lsp-describe-session
    "wq" 'lsp-workspace-shutdown
    "wr" 'lsp-workspace-restart)

  (general-def :keymaps 'lsp-mode-map :states 'normal
    "SPC" '(:keymap lsp-mode-leader-map)
    "K"   'eldoc-box-help-at-point
    "C-h ." '(lsp-describe-thing-at-point
              :predicate (lsp-feature? "textDocument/hover")))

  (general-def :keymaps 'lsp-mode-map :states 'visual
    "SPC =" '(lsp-format-region
              :predicate (lsp-feature? "textDocument/rangeFormatting"))))
#+end_src

***** which-key descriptions
#+begin_src emacs-lisp
(with-eval-after-load 'lsp-mode
  (my/which-key-set-command-description
   'xref-find-apropos                  "find symbol in workspace"
   'lsp-find-declaration               "find declarations"
   'lsp-find-definition                "find definitions"
   'lsp-find-implementation            "find implementations"
   'lsp-find-references                "find references"
   'lsp-find-type-definition           "find type definition"
   'lsp-organize-imports               "organize imports"
   'lsp-rename                         "rename"
   'lsp-execute-code-action            "code actions"
   'lsp-document-highlight             "highlight symbol"
   'lsp-avy-lens                       "lens"
   'lsp-ui-peek-find-definitions       "peek definitions"
   'lsp-ui-peek-find-implementation    "peek implementations"
   'lsp-ui-peek-find-references        "peek references"
   'lsp-ui-peek-find-workspace-symbol  "peek workspace symbol"
   'lsp-ui-doc-glance                  "glance symbol"
   'lsp-describe-thing-at-point        "describe symbol at point"
   'lsp-signature-activate             "signature help"
   'lsp-format-buffer                  "format buffer"
   'lsp-format-region                  "format region"
   'lsp-modeline-diagnostics-mode      "toggle modeline diagnostics"
   'lsp-toggle-trace-io                "toggle log io"
   'lsp-ui-sideline-mode               "toggle sideline"
   'lsp-modeline-code-actions-mode     "toggle modeline code actions"
   'lsp-headerline-breadcrumb-mode     "toggle breadcrumb"
   'lsp-ui-doc-mode                    "toggle documentation popup"
   'lsp-toggle-on-type-formatting      "toggle on type formatting"
   'lsp-toggle-symbol-highlight        "toggle highlighting"
   'lsp-lens-mode                      "toggle lenses"
   'lsp-toggle-signature-auto-activate "toggle signature"
   'lsp-disconnect                     "disconnect"
   'lsp-describe-session               "describe session"
   'lsp-workspace-shutdown             "shutdown server"
   'lsp-workspace-restart              "restart server"))

(with-eval-after-load 'lsp-treemacs
  (my/which-key-set-command-description
   'lsp-treemacs-errors-list    "show errors"
   'lsp-treemacs-call-hierarchy "call hierarchy"
   'lsp-treemacs-sync-mode      "toggle treemacs integration"))
#+end_src

**** eglot
#+begin_src emacs-lisp
(with-eval-after-load 'eglot
  (define-prefix-command 'eglot-leader-map)
  (general-def :keymaps 'eglot-leader-map
    "rr" 'eglot-rename
    "rq" 'eglot-code-action-quickfix
    "re" 'eglot-code-action-extract
    "ri" 'eglot-code-action-inline
    "rI" 'eglot-code-action-organize-imports
    "rR" 'eglot-code-action-rewrite
    "="  'eglot-format
    "th" 'eglot-inlay-hints-mode
    "dd" 'flymake-show-buffer-diagnostics
    "dj" 'flymake-goto-next-error
    "dk" 'flymake-goto-prev-error
    ;; "d[" 'flymake-goto-next-error
    ;; "d]" 'flymake-goto-prev-error
    "dc" 'consult-flymake
    "dD" 'flymake-show-project-diagnostics
    "a"  'eglot-code-actions)
  (general-def :keymaps 'eglot-mode-map :states '(normal visual)
    "SPC"   '(:keymap eglot-leader-map)
    "K"     'eldoc-box-help-at-point
    "M-k"   'eldoc-doc-buffer
    "C-S-k" 'eldoc-doc-buffer
    "C-t"   'xref-go-back
    "C-S-t" 'xref-go-forward
    "gi" 'eglot-find-implementation
    "gt" 'eglot-find-typeDefinition))
#+end_src

#+begin_src emacs-lisp
(dolist (map '(flymake-diagnostics-buffer-mode-map
               flymake-project-diagnostics-mode-map))
  (general-def :keymaps map :states 'normal
    "o" 'flymake-show-diagnostic))
#+end_src

***** which-key descriptions

#+begin_src emacs-lisp
(with-eval-after-load 'eglot
  (my/which-key-set-command-description
   'eglot-rename               "lsp rename"
   'eglot-code-action-organize-imports "organize imports"
   'eglot-code-action-quickfix "quickfix"
   'eglot-code-action-extract  "refactor extract"
   'eglot-code-action-inline   "refactor inline"
   'eglot-code-action-rewrite  "refactor rewrite"
   'eglot-format               "lsp format"
   'eglot-inlay-hints-mode     "toggle inlay hints"
   'eglot-code-actions         "code actions"
   ))
#+end_src

#+begin_src emacs-lisp
(with-eval-after-load 'flymake
  (my/which-key-set-command-description
   'flymake-show-buffer-diagnostics  "buffer diagnostics"
   'flymake-show-project-diagnostics "project diagnostics"
   'flymake-show-project-diagnostics "project-diagnostics"
   'flymake-show-buffer-diagnostics  "buffer-diagnostics"
   'flymake-goto-next-error          "next error"
   'flymake-goto-prev-error          "prev error"
   ;; 'consult-flymake
   ))
#+end_src

*** Corfu
#+begin_src emacs-lisp
;; (general-def :keymaps 'corfu-map :states 'insert
;;   "<escape>" 'corfu-quit
;;   "<tab>" 'corfu-insert)
#+end_src

Russian letters:
#+begin_src emacs-lisp
(general-def :keymaps 'corfu-map :states 'insert
  "C-о" 'corfu-next
  "C-л" 'corfu-previous
  "C-а" 'corfu-scroll-up
  "C-и" 'corfu-scroll-down)
#+end_src

Swap ~corfu-scroll-down~ and ~corfu-scroll-up~ functions.
#+begin_src emacs-lisp
(when evil-want-C-u-scroll
  (evil-collection-define-key 'insert 'corfu-map (kbd "C-u") 'corfu-scroll-down))

(when evil-want-C-d-scroll
  (evil-collection-define-key 'insert 'corfu-map (kbd "C-d") 'corfu-scroll-up))

(general-def :keymaps 'corfu-map :states 'insert
  "C-f" 'corfu-scroll-up
  "C-b" 'corfu-scroll-down)
#+end_src

*** Magit
#+begin_src emacs-lisp
(setopt
 evil-collection-magit-use-z-for-folds t ; use Z for stash instead
 evil-collection-magit-use-$-for-end-of-line nil ; use $ for `magit-process-buffer'
 ;; evil-collection-magit-want-horizontal-movement t
 )
#+end_src

#+begin_src emacs-lisp
(with-eval-after-load 'magit-section
  (general-def :keymaps 'magit-mode-map :states 'normal
    "C-j" 'magit-section-forward-sibling
    "C-k" 'magit-section-backward-sibling
    "zj"  'magit-section-forward
    "zk"  'magit-section-backward
    "Z"   'magit-stash)
  (general-def :keymaps 'magit-section-mode-map :states 'normal
    "C-j" 'magit-section-forward-sibling
    "C-k" 'magit-section-backward-sibling
    "zj"  'magit-section-forward
    "zk"  'magit-section-backward
    "zu"  'magit-section-up
    "gh"  'evil-first-non-blank
    "gl"  'evil-end-of-line
    "zt"  'evil-scroll-line-to-top
    "zz"  'evil-scroll-line-to-center
    "zb"  'evil-scroll-line-to-bottom
    "za"  'magit-section-toggle
    "zo"  'magit-section-toggle
    "zc"  'magit-section-toggle
    "<tab>"       'magit-section-cycle
    "C-<tab>"     'tab-next
    ;; "C-S-<tab>"   'tab-previous
    "C-<backtab>"   'tab-previous
    "g <tab>"     'tab-new
    "g <backtab>" 'tab-bar-move-window-to-tab)
  (general-def :keymaps 'magit-status-mode-map :states 'normal
    "g t "'tab-next
    "g T" 'tab-previous))
#+end_src

#+begin_src emacs-lisp
(general-def :keymaps 'with-editor-mode-map :states 'normal
  "ZZ" 'with-editor-finish
  "Q"  'with-editor-cancel
  "ZQ" 'with-editor-cancel)
#+end_src

#+begin_src emacs-lisp
(my/which-key-set-command-description
 'evil-collection-magit-yank-whole-line "yank whole line")
#+end_src

