home/dot_config/emacs/init.el
  (define-prefix-command 'eglot-leader-map)
  (general-def :keymaps 'eglot-leader-map
    "rr" 'eglot-rename
    "rq" 'eglot-code-action-quickfix
    "re" 'eglot-code-action-extract
    "ri" 'eglot-code-action-inline
    "rI" 'eglot-code-action-organize-imports
    "rR" 'eglot-code-action-rewrite
    "="  'eglot-format
    "th" 'eglot-inlay-hints-mode
    "dd" 'flymake-show-buffer-diagnostics
    "dj" 'flymake-goto-next-error
    "dk" 'flymake-goto-prev-error
    ;; "d[" 'flymake-goto-next-error
    ;; "d]" 'flymake-goto-prev-error
    "dc" 'consult-flymake
    "dD" 'flymake-show-project-diagnostics
    "a"  'eglot-code-actions)
  (general-def :keymaps 'eglot-mode-map :states '(normal visual)
    "SPC"   '(:keymap eglot-leader-map)
    "K"     'eldoc-box-help-at-point
    "M-k"   'eldoc-doc-buffer
    "C-S-k" 'eldoc-doc-buffer
    "C-t"   'xref-go-back
    "C-S-t" 'xref-go-forward
    "gi" 'eglot-find-implementation
    "gt" 'eglot-find-typeDefinition))

(dolist (map '(flymake-diagnostics-buffer-mode-map
               flymake-project-diagnostics-mode-map))
  (general-def :keymaps map :states 'normal
    "o" 'flymake-show-diagnostic))

(with-eval-after-load 'eglot
  (my/which-key-set-command-description
   'eglot-rename               "lsp rename"
   'eglot-code-action-organize-imports "organize imports"
   'eglot-code-action-quickfix "quickfix"
   'eglot-code-action-extract  "refactor extract"
   'eglot-code-action-inline   "refactor inline"
   'eglot-code-action-rewrite  "refactor rewrite"
   'eglot-format               "lsp format"
   'eglot-inlay-hints-mode     "toggle inlay hints"
   'eglot-code-actions         "code actions"
   ))

(with-eval-after-load 'flymake
  (my/which-key-set-command-description
   'flymake-show-buffer-diagnostics  "buffer diagnostics"
   'flymake-show-project-diagnostics "project diagnostics"
   'flymake-show-project-diagnostics "project-diagnostics"
   'flymake-show-buffer-diagnostics  "buffer-diagnostics"
   'flymake-goto-next-error          "next error"
   'flymake-goto-prev-error          "prev error"
   ;; 'consult-flymake
   ))

;; (general-def :keymaps 'corfu-map :states 'insert
;;   "<escape>" 'corfu-quit
;;   "<tab>" 'corfu-insert)

(general-def :keymaps 'corfu-map :states 'insert
  "C-о" 'corfu-next
  "C-л" 'corfu-previous
  "C-а" 'corfu-scroll-up
  "C-и" 'corfu-scroll-down)

(when evil-want-C-u-scroll
  (evil-collection-define-key 'insert 'corfu-map (kbd "C-u") 'corfu-scroll-down))

(when evil-want-C-d-scroll
  (evil-collection-define-key 'insert 'corfu-map (kbd "C-d") 'corfu-scroll-up))

(general-def :keymaps 'corfu-map :states 'insert
  "C-f" 'corfu-scroll-up
  "C-b" 'corfu-scroll-down)

(setopt
 evil-collection-magit-use-z-for-folds t ; use Z for stash instead
 evil-collection-magit-use-$-for-end-of-line nil ; use $ for `magit-process-buffer'
 ;; evil-collection-magit-want-horizontal-movement t
 )

(with-eval-after-load 'magit-section
  (general-def :keymaps 'magit-mode-map :states 'normal
    "C-j" 'magit-section-forward-sibling
    "C-k" 'magit-section-backward-sibling
    "zj"  'magit-section-forward
    "zk"  'magit-section-backward
    "Z"   'magit-stash)
  (general-def :keymaps 'magit-section-mode-map :states 'normal
    "C-j" 'magit-section-forward-sibling
    "C-k" 'magit-section-backward-sibling
    "zj"  'magit-section-forward
    "zk"  'magit-section-backward
    "zu"  'magit-section-up
    "gh"  'evil-first-non-blank
    "gl"  'evil-end-of-line
    "zt"  'evil-scroll-line-to-top
    "zz"  'evil-scroll-line-to-center
    "zb"  'evil-scroll-line-to-bottom
    "za"  'magit-section-toggle
    "zo"  'magit-section-toggle
    "zc"  'magit-section-toggle
    "<tab>"       'magit-section-cycle
    "C-<tab>"     'tab-next
    ;; "C-S-<tab>"   'tab-previous
    "C-<backtab>"   'tab-previous
    "g <tab>"     'tab-new
    "g <backtab>" 'tab-bar-move-window-to-tab)
  (general-def :keymaps 'magit-status-mode-map :states 'normal
    "g t "'tab-next
    "g T" 'tab-previous))

(general-def :keymaps 'with-editor-mode-map :states 'normal
  "ZZ" 'with-editor-finish
  "Q"  'with-editor-cancel
  "ZQ" 'with-editor-cancel)

(my/which-key-set-command-description
 'evil-collection-magit-yank-whole-line "yank whole line")
