home/dot_config/emacs/init.el

(with-eval-after-load 'markdown-mode
  (defvar-keymap my/markdown-leader-map :parent 'leader-map)
  (general-def :keymaps 'my/markdown-leader-map
    "<return>" 'markdown-toggle-markup-hiding)

  (general-def :keymaps 'markdown-mode-map :states 'normal
    "SPC" '(:keymap my/markdown-leader-map)
    "z'"  'markdown-edit-code-block
    "zu"  'markdown-outline-up
    "zj"  'markdown-outline-next
    "zk"  'markdown-outline-previous
    "C-k" 'markdown-outline-previous-same-level
    "C-j" 'markdown-outline-next-same-level
    "C-<up>"   'markdown-outline-previous-same-level
    "C-<down>" 'markdown-outline-next-same-level
    ;; "<return>" 'markdown-toggle-markup-hiding
    "M-<up>"   'markdown-move-up
    "M-<down>" 'markdown-move-down)

  (general-def :keymaps 'edit-indirect-mode-map :states 'normal
    "ZZ" 'edit-indirect-commit
    "ZQ" 'edit-indirect-abort))

(with-eval-after-load 'obsidian
  (defvar-keymap my/obsidian-leader-map :parent 'leader-map)
  (general-def :keymaps 'my/obsidian-leader-map
    "ob" 'obsidian-backlink-jump
    "o/" 'obsidian-search
    "w"  'obsidian-insert-wikilink
    "l"  'obsidian-insert-link)

  (general-def :keymaps 'obsidian-mode-map :states 'normal
    "SPC" '(:keymap my/obsidian-leader-map)
    "gx"  'obsidian-follow-link-at-point))

(my/which-key-set-command-description
 'obsidian-jump            "open Obsidian note"
 'obsidian-insert-wikilink "insert wikilink"
 'obsidian-insert-link     "insert markdown link")

(general-def :keymaps 'outline-mode-map :states 'normal
  ;; "<tab>" 'outline-cycle
  "zm" 'my/outline-hide-sublevels
  "zj" 'outline-next-visible-heading
  "zk" 'outline-previous-visible-heading
  "zL" 'outline-hide-leaves
  "zl" nil ;;'outline-hide-leaves
  )

(defun my/outline-hide-sublevels (levels)
  (interactive "p")
  (outline-hide-sublevels (or levels 1)))

(general-def :keymaps 'my/orgmode-leader-map
  "SPC" 'org-ctrl-c-ctrl-c
  "<return>" 'org-ctrl-c-ret
  "ni" 'org-id-get-create
  "np" 'org-set-property
  "nh" 'org-babel-insert-header-arg
  "nf" 'org-footnote-action
  "l"  'org-insert-link
  "d"  'org-deadline
  "e"  'org-export-dispatch
  "s"  'org-schedule
  "t"  'org-time-stamp
  "T"  'org-time-stamp-inactive
  "L"  'org-cliplink
  "a"  'org-attach
  "["  'org-agenda-file-to-front
  "]"  'org-remove-file)

(general-def :keymaps 'org-mode-map :states '(normal visual)
  "SPC" '(:keymap my/orgmode-leader-map)
  "C-<up>"   'org-backward-heading-same-level
  "C-<down>" 'org-forward-heading-same-level
  "K"  'helpful-at-point
  "^"  'evil-org-beginning-of-line
  "$"  'evil-org-end-of-line
  "gh" 'evil-org-beginning-of-line
  "gl" 'evil-org-end-of-line
  ;; "H"  'org-up-element
  ;; "L"  'org-down-element
  "gn" 'org-next-link
  "gN" 'org-previous-link
  "gx" 'org-open-at-point
  "zC" 'outline-hide-entry
  "zn" 'org-narrow-to-subtree
  "z'" 'org-edit-special
  "z," 'org-insert-structure-template
  "z/" 'org-sparse-tree
  "z;" 'org-toggle-comment
  "z|" 'org-table-create-or-convert-from-region
  ;; "M-q" 'unpackaged/flex-fill-paragraph
  )
(general-def :keymaps 'org-mode-map :states '(motion insert)
  "<tab>" 'org-cycle)

(add-hook 'evil-org-mode-hook
          (lambda ()
            (general-def :keymaps 'local :states 'insert
              "C-t" 'evil-shift-right-line
              "C-d" 'evil-shift-left-line)))

(defhydra hydra-org-link ()
  "Link"
  ("n" org-next-link     "next")
  ("N" org-previous-link "previous")
  ("j" org-next-link     "next")
  ("k" org-previous-link "previous"))

(defhydra hydra-backward-org-link ()
  "Backward Link"
  ("N" org-next-link     "next")
  ("n" org-previous-link "previous")
  ("j" org-next-link     "next")
  ("k" org-previous-link "previous"))

(general-def :keymaps 'org-mode-map :states 'normal
  "gn" (lambda ()
         (interactive)
         (org-next-link)
         (hydra-org-link/body))
  "gN" (lambda ()
         (interactive)
         (org-previous-link)
         (hydra-backward-org-link/body)))

(with-eval-after-load 'org-transclusion
  (general-def :keymaps 'org-transclusion-map :states 'normal
    ;; "e" 'org-transclusion-live-sync-start
    ;; "g" 'org-transclusion-refresh
    ;; "d" 'org-transclusion-remove
    ;; "C-d" 'org-transclusion-detach
    ;; "P" 'org-transclusion-promote-subtree
    ;; "D" 'org-transclusion-demote-subtree
    ;; "o" 'org-transclusion-open-source
    ;; "O" 'org-transclusion-move-to-source
    "gi" 'org-transclusion-live-sync-start)

  (general-def :keymaps 'org-transclusion-live-sync-map :states 'normal
    ;; "C-c C-c" 'org-transclusion-live-sync-exit
    ;; "C-y" 'org-transclusion-live-sync-paste
    "q" 'org-transclusion-live-sync-exit))

(general-def :keymaps 'my/notes-map
  "I" 'my/org-roam-create-untracked-node
  "a" 'org-agenda
  "s" 'org-store-link
  "n" 'org-roam-node-find
  "c" 'org-roam-capture
  "b" 'org-roam-buffer-toggle
  "v" 'org-switchb
  "l" 'org-roam-node-insert
  "t" 'org-roam-tag-add
  "u" 'org-roam-ui-mode
  "d" '(:keymap org-roam-dailies-map)
  "/" 'consult-org-roam-search)

(general-def :keymaps 'org-roam-dailies-map
  "Y" 'org-roam-dailies-capture-yesterday
  "T" 'org-roam-dailies-capture-tomorrow)

(my/which-key-set-command-description
 'my/org-roam-create-untracked-node  "untracked org-roam node"
 'org-roam-dailies-capture-yesterday "capture yesterday"
 'org-roam-dailies-capture-tomorrow  "capture tomorrow")

(general-def :keymaps 'Info-mode-map :states 'normal
  "SPC" (define-keymap :parent 'leader-map
          "1" 'Info-top-node
          "t" 'Info-toc
          "h" 'Info-history
          "d" 'Info-directory)

  "C-j" 'Info-next
  "C-k" 'Info-prev

  "zj" 'Info-forward-node
  "zk" 'Info-backward-node

  "J" 'Info-forward-node
  "K" 'Info-backward-node

  "zu" 'Info-up
  "gd" 'Info-directory

  "M" 'Info-menu)

(dolist (i (number-sequence 1 9))
  (keymap-unset Info-mode-map (format "<normal-state> g %s" i) :remove))

(my/which-key-set-command-description
 'Info-directory "Info dir"
 'Info-history   "history"
 'Info-toc       "TOC"
 'Info-top-node  "top node"
 'Info-up        "Info parent node")

(general-def :states 'insert
  "C-д"   'right-char
  "C-ч 8" 'iso-transl-ctl-x-8-map
  "C-ц"   'evil-delete-backward-word)

(provide 'init.el)
;;; init.el ends here
